/**
* \file    ActivityManager_connect.h
* \brief   Обеспечение взаимодействия ActivityManager.h и BlockExch.h 
* \details Интерфейс
*
* \version 1.0.1
* \date    22-05-2017
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef ACTIVITYMANAGER_CONNECT_H
#define ACTIVITYMANAGER_CONNECT_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "ActivityManager_internal.h"
#include "BlockExch.h"

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Управление взаимодействием ActivityManager.h и BlockExch.h.
/// \note Вызывается из главного цикла с периодом 1 мс.
/// \param activityManager - указатель на структуру состояния \a ActivityManager_DeviceStr;
/// \param blockExch - указатель на структуру состояния \a BlockExch_Str.
///
void ActiveManagerConnect_run( ActivityManager_DeviceStr *activityManager, BlockExch_Str *blockExch );

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   22-05-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
