/**
* \file    ActivityManager_internal.h
* \brief   Внутренние функции ActivityManager 
* \details Интерфейс
*
* \version 1.0.1
* \date    19-05-2017
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef ACTIVITYMANAGER_INTERNAL_H
#define ACTIVITYMANAGER_INTERNAL_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "ActivityManager.h"

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Установление состояния связи с соседним прибором.
/// \param str - указатель на структуру состояния;
/// \param connect - состояние связи (true (есть связь), false (нет связи)).
///
void ActivityManager_setNeighborConnection( ActivityManager_DeviceStr *str, bool connect );

//*****************************************************************************
/// \brief Установление состояния соседнего прибора и прием данных от "моего" прибора.
/// \param str - указатель на структуру состояния;
/// \param reception - состояние соседнего прибора (true (принимает), false (не принимает)).
///
void ActivityManager_setNeighborHearsMe( ActivityManager_DeviceStr *str, bool reception );

//*****************************************************************************
/// \brief Установление состояния соседа (рабочее / безопасное).
/// \param str - указатель на структуру состояния;
/// \param state - состояние соседа (true (рабочее), false (безопасное)).
///
void ActivityManager_setNeighborState( ActivityManager_DeviceStr *str, bool state );

//*****************************************************************************
/// \brief Установление состояния активности соседа (активный / пассивный).
/// \param str - указатель на структуру состояния;
/// \param active - состояние активности соседа (true (активный), false (пассивный)).
///
void ActivityManager_setNeighborActivity( ActivityManager_DeviceStr *str, bool active );

//*****************************************************************************
/// \brief Установление состояния связи соседа по интерфейсу RS-422.
/// \param str - указатель на структуру состояния;
/// \param line - номер линии связи;
/// \param connect - состояние связи (true (есть связь), false (нет связи)).
///
void ActivityManager_setNeighborRS422connect( ActivityManager_DeviceStr *str, Rs422_numLine line, bool connect );

//*****************************************************************************
/// \brief Установление состояния связи соседа с УС по интерфейсу RS-422.
/// \param str - указатель на структуру состояния;
/// \param line - номер линии связи;
/// \param connect - состояние связи соседа (true (есть связь), false (нет связи)).
///
void ActivityManager_setNeighborRS422ctrlSysConnect( ActivityManager_DeviceStr *str, Rs422_numLine line,
                                                     bool connect );

//*****************************************************************************
/// \brief Получает состояние прибора.
/// \param str - указатель на структуру состояния.
/// \retval true  - рабочее;
/// \retval false - безопасное.
///
bool ActivityManager_getState( ActivityManager_DeviceStr *str );

//*****************************************************************************
/// \brief Получает состояние связи по интерфейсу RS-422.
/// \param str - указатель на структуру состояния;
/// \param line - номер линии связи.
/// \retval true  - есть связь;
/// \retval false - нет связи.
///
bool ActivityManager_getRS422connect( ActivityManager_DeviceStr *str, Rs422_numLine line );

//*****************************************************************************
/// \brief Получает состояние связи c УС.
/// \param str - указатель на структуру состояния;
/// \param line - номер линии связи.
/// \retval true  - есть связь;
/// \retval false - нет связи.
///
bool ActivityManager_getRS422ctrlSysConnect( ActivityManager_DeviceStr *str, Rs422_numLine line );

//*****************************************************************************
///\brief Запись состояния инициализации соседа в структуру состояния менеджера активности.
/// \param str - указатель на структуру состояния.
/// \param state - состояние инициализации соседа (false - в процессе, true - окончено).
/// 
void ActivityManager_writeNeighborIsInWork( ActivityManager_DeviceStr *str, bool state );

#endif 

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   19-05-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
