/**
* \file    BlockExch.h
* \brief   Связь между основным и резервным приборами 
* \details Интерфейс
*
* \version 1.0.1
* \date    22-05-2017
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef BLOCKEXCH_H
#define BLOCKEXCH_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>
#include <stdint.h>

//*****************************************************************************
// Определение типов данных
//*****************************************************************************

//*****************************************************************************
typedef struct BlockExch_Str_ BlockExch_Str;        ///< Определение типа структуры состояния.

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация.
/// \param length - длина данных обмена, байт;
/// \param noExchangeTime - время формирования признака отсутствия связи, мс.
/// \return Указатель на структуру состояния, который должен передаваться во все интерфейсные функции.
///
BlockExch_Str *BlockExch_ctor( uint8_t length, uint16_t noExchangeTime );

//*****************************************************************************
/// \brief Управление приемом и передачей данных межприборного обмена.
/// \note Вызывается из главного цикла с периодом 1 мс.
/// \param str - указатель на структуру состояния.
///
void BlockExch_run( BlockExch_Str *str );

//*****************************************************************************
/// \brief Обработка прерывания.
/// \note Вызывается из прерывания с периодом 62,5 мкс.
/// \param str - указатель на структуру состояния; 
/// \param interruptNumb - номер прерывания.
///
void BlockExch_interrupt( BlockExch_Str *str, uint16_t interruptNumb );

//*****************************************************************************
/// \brief Формирование данных для передачи.
/// \param str - указатель на структуру состояния;
/// \param data -массив данных для передачи.
///
void BlockExch_setData( BlockExch_Str *str, const uint8_t *data );

//*****************************************************************************
/// \brief Получает принятые данные от соседнего прибора.
/// \param str - указатель на структуру состояния;
/// \param data - указатель на массив для записи принятых данных.
/// \retval true  - данные есть;
/// \retval false - данных нет.
///
bool BlockExch_getData( BlockExch_Str *str, uint8_t *data );

//*****************************************************************************
/// \brief Получает состояние связи с соседним прибором.
/// \param str - указатель на структуру состояния. 
/// \retval true  - есть связь;
/// \retval false - нет связи.
///
bool BlockExch_getConnectionState( BlockExch_Str *str );

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   22-05-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
