/**
* \file    Fsm.c
* \brief   \copybrief Fsm.h
*
* \version 1.0.2
* \date    06-09-2018
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "Fsm.h"

//*****************************************************************************
// Объявление локальных переменных
//*****************************************************************************

//*****************************************************************************
static FsmState *pState;        ///< Адрес текущего состояния.

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Выход из состояний вверх по иерархии.
/// \param from - указатель на исходное состояние;
/// \param to - указатель на конечное состояние.
///
static void stateExit( const FsmState *from, const FsmState *to );

//*****************************************************************************
/// \brief Вход в состояния вниз по иерархии.
/// \param from - указатель на исходное состояние;
/// \param to - указатель на конечное состояние.
///
static void stateEntry( const FsmState *from, const FsmState *to );

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Запуск ДКА
void Fsm_start( const FsmState *state )
{
    Fsm *fsm = state->fsm;
    while( fsm )
    {
        const FsmState *current = state->initial;
        fsm->current = current;
        if( current->onEntry )
        {
            current->onEntry( );
        }
        state = current;
        fsm = state->fsm;
    }
}

//*****************************************************************************
// Переход в состояние
void Fsm_transit( const FsmState *to )
{
    const FsmState *s = to;
    while( s->super && s->super->fsm->current != s )
    {
        s = s->super;
    }
    stateExit( to->top, s );
    stateEntry( s, to );
    Fsm_start( to );

    pState = ( FsmState * )to;
}

//*****************************************************************************
// Работа ДКА
void Fsm_run( const FsmState *state )
{
    bool cont = true;
    while( cont )
    {
        if( state->onRun )
        {
            cont = state->onRun( );
        }
        if( state->fsm )
        {
            state = state->fsm->current;
        }
        else
        {
            break;
        }
    }
}

//*****************************************************************************
// Реализация локальных функций
//*****************************************************************************

//*****************************************************************************
//Выход из состояний вверх по иерархии
static void stateExit( const FsmState *from, const FsmState *to )
{
    while( from->fsm && from->fsm->current )
    {
        from = from->fsm->current;
    }
    while( from != to )
    {
        if( from->onExit )
        {
            from->onExit( );
        }
        const FsmState *super = from->super;
        super->fsm->current = 0;
        from = super;
    }
}

//*****************************************************************************
// Вход в состояния вниз по иерархии
static void stateEntry( const FsmState *from, const FsmState *to )
{
    const FsmState *s;
    for( s = to; s != from; )
    {
        const FsmState *super = s->super;
        super->fsm->current = s;
        s = super;
    }
    while( from != to )
    {
        from = from->fsm->current;
        if( from->onEntry )
        {
            from->onEntry( );
        }
    }
}

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   28-09-2017
* Автор  Мирошниченко А.А.
*
* Изменения:
*    Базовая редакция.
* 
* Версия 1.0.2
* Дата   06-09-2018
* Автор  Кругликов В.П.
*
* Изменения:
*    Добавлено сохранение текущего состояния работы прибора.
*/
