/**
* \file    CheckRegisters.c
* \brief   \copybrief CheckRegisters.h
*
* \version 2.0.1
* \date    05-07-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "asserts.h"
#include "ProtectionState_codes.h"
#include "checkRegistersDrv.h"
#include "CheckRegisters.h"

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Проверка основных регистров, используемых при работе
bool CheckRegisters_run( void )
{
    return checkRegistersDrv();
}

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   05-07-2015
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*
* Версия 2.0.1
* Дата   05-07-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Изменения под новую схему на dsPIC33.
*/
