/**
* \file    CheckRAM.h
* \brief   Проверка ОЗУ
* \details Интерфейс
* 
* \version 1.0.1
* \date    05-07-2016
* \author  Третьяков В.Ж.
*/

#ifndef CheckRAM_h
#define CheckRAM_h

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>
#include "typeMK.h"

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************
#define RAM_START_ADDRESS    __DATA_BASE        ///< Адрес начала области ОЗУ.
#define RAM_END_ADDRESS      0x7000             ///< Адрес конца области ОЗУ.

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief  Инициализация переменных модуля CheckRAM.h.
///
void CheckRAM_ctor( void );

//*****************************************************************************
/// \brief Проверка ОЗУ.
/// \retval true  - все в порядке;
/// \retval false - обнаружена неисправность.
/// \note Вызывается с частотой 1 кГц.
/// \note При обнаружении неисправностей происходит переход в состояние ЗС.
///
bool CheckRAM_run( void );

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   05-07-2016
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
