/**
* \file    CheckRegisters.h
* \brief   Проверка основных регистров МК, используемых при работе
* \details Интерфейс
* 
* \version 2.0.1
* \date    14-06-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef CHECKREGISTERS_H
#define CHECKREGISTERS_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Проверка основных регистров, используемых при работе.
/// \retval true  - все в порядке;
/// \retval false - обнаружена неисправность.
/// \note Вызывается с частотой 1 кГц.
/// \note При обнаружении неисправностей происходит переход в состояние ЗС.
/// \note Возвращает результат проверки.
///
bool CheckRegisters_run( void );

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   14-06-2016
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*
* Версия 2.0.1
* Дата   14-06-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Изменения под новую схему на dsPIC33.
*/
