/**
* \file    CheckCallFunctions.h
* \brief   Контроль вызова функций
* \details Интерфейс 
*
* \version 1.0.2
* \date    29-09-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef CheckCallFunctions_h
#define CheckCallFunctions_h

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>
#include <stdbool.h>

//*****************************************************************************
// Макросы типа функция
//*****************************************************************************

//*****************************************************************************
/// \brief Вызов функции с сохранением ее имени.
///
#define CALL_FUNCTION( function )    CheckCallFunctions_call( function, #function );

//*****************************************************************************
/// \brief Маркирование выполнения функции.
///
#define MARKED_CALL_FUNCTION   CheckCallFunctions_marked( );

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
void CheckCallFunctions_ctor( void );               ///< Инициализация.

//*****************************************************************************
/// \brief Контроль количества вызванных функций. 
/// \note Вызывается с периодом 1 мс. 
/// \note При обнаружении неисправности происходит переход в ЗС.
///
void CheckCallFunctions_run( void );

//*****************************************************************************
/// \brief Передача для контроля количества вызванных функций.
/// \note  Вызывается с периодом 62,5 мкс из 15-го прерывания.
///
void CheckCallFunctions_interrupt( bool sync );

//*****************************************************************************
/// \brief Маркирование выполнения функции. 
///
void CheckCallFunctions_marked( void );

//*****************************************************************************
/// \brief Вызов функции с сохранением ее имени.
/// \param pFunction - указатель на выполняемую функцию
/// \param ac - строка, представляющая собой имя выполняемой функции
///
void CheckCallFunctions_call( void ( *pFunction )( void ), const char *ac );

//*****************************************************************************
/// \brief Запись последних #N_STACK_NAME_FUNCTION имен функций в \a EEPROM.
/// \param address - начальный адрес \a EEPROM.
///
uint16_t CheckCallFunctions_saveBlackBox( uint16_t address );

#endif

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Дата:  11-07-2016
* Автор: Третьяков В.Ж.
* 
* Изменения:
*     Базовая версия.
*
* Версия 1.0.2
* Дата   29-09-2017
* Автор  Третьяков В.Ж.
* 
* Изменения:
*     Добавлена функция  CheckCallFunctions_interrupt(bool sync)
*     для контроля вызываемых функций в прерывании, добавлена переменная 
*     cCallFunctionsSync в структуру checkCallFunctions для перезаписи
*     количества вызываемых функций в 15-м прерывании.
*/
