/**
* \file    ControlMK.h
* \brief   Проверка работоспособности МК
* \details Интерфейс
* 
* \version 1.0.1
* \date    05-07-2016
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef CONTROLMK_H
#define CONTROLMK_H

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация переменных компонента ControlMK.h.
///
void ControlMK_ctor( void );

//*****************************************************************************
/// \brief Проверка работоспособности МК.
/// \details Организация вызова проверок, формирование обобщенных результатов 
/// контроля и контроль их совпадения по двум МК.
/// \note Вызывается c частотой 1 кГц.
///
void ControlMK_run( void );

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   05-07-2016
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
