/**
* \file    CheckFlashChecksum.h
* \brief   Проверка памяти программ, области конфигурации и контрольной суммы памяти программ
* \details Интерфейс
* \details Для правильной работы должна быть включена опция
* \details File/Project Properties -> Building/Insert unprotect checksum in user ID memory.
* 
* \version 1.0.1
* \date    30-07-2018
* \author  Агулов М.А.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef CHECKFLASHCHECKSUM_H
#define CHECKFLASHCHECKSUM_H

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
#define    FLASH_ADDRESS_START    0UL               ///< Начальный адрес FLASH-памяти.
#define    FLASH_PROG_SIZE        0x0557ECUL        ///< Размер памяти программ FLASH-памяти.

//*****************************************************************************
#define    FLASH_CELL_TO_READ_NUM    4              ///< Число ячеек FLASH-памяти при блочном чтении (в цикле 1 мс).
#define    FLASH_BYTES_PER_CELL      3              ///< Число байт в каждой ячейке FLASH-памяти.
#define    FLASH_ADDRESS_STEP        2              ///< Приращение адресов FLASH-памяти.

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация переменных функции #FlashCheck_run.
/// \details Инициализируются все данные для корректной 
/// работы компонента.
/// \note Вызывается перед началом работы однократно. 
/// \note Вызов этой функции перед использованием других функций этого 
/// компонента обязателен.
///
void FlashCheck_ctor( void );

//*****************************************************************************
/// \brief Проверка памяти программ (Flash-памяти).
/// \note Вызывается с частотой 1 мс.
/// \note При обнаружении неисправностей происходит переход в ЗС.
///
void FlashCheck_run( void );

#endif  /* CHECKFLASHCHECKSUM_H */

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   30-07-2018
* Автор  Агулов М.А.
*
* Изменения:
*    Базовая версия.
*/
