/**
* \file    ControlSystem.h
* \brief   Общее управление работой прибора
* \details Интерфейс
*
* \version 1.0.1
* \date    02-06-2017
* \author  Мирошниченко А.А.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef CONTROLSYSTEM_H
#define CONTROLSYSTEM_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация модуля общего управления.
///
void ControlSystem_ctor( void );

//*****************************************************************************
/// \brief Работа модуля общего управления.
///
void ControlSystem_run( void );

//*****************************************************************************
/// \brief Проверка условий рабочего режима.
/// \retval true  - прибор может управлять переводом стрелки;
/// \retval false - прибор не может управлять переводом стрелки и должен быть переведен в БС.
///
bool ControlSystem_workCondition( void );

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   02-06-2017
* Автор  Мирошниченко А.А.
* 
* Изменения:
*     Базовая версия.
*/
