/**
* \file    ConfigMK.c
* \brief   \copybrief ConfigMK.h
*
* \version 1.0.1
* \date    21-02-2018
* \author  Агулов М.А.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "wait.h"
#include "ConfigMK.h"
#include "IOports.h"
#include "asserts.h"
#include "ProtectionState_codes.h"

//*****************************************************************************
// Локальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
#define TRY_NUMBER              16      ///< Число считываний.
#define PIN_MASTER_OR_SLAVE     _RG6    ///< Пин "тип микроконтроллера" (1 - Master, 0 - Slave).

//*****************************************************************************
// Объявление локальных переменных
//*****************************************************************************

//*****************************************************************************
static bool isMaster;        ///< Конфигурация процессора (true (Master), false (Slave)).

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Определение типа процессора: Master или Slave
void ConfigMK_ctor( void )
{
    uint16_t cnt = 0;
    
    INIC_PORT_IN( G, 6, eIO_pullOff );               // Инициализация пина конфигурации процессора
    
    for( uint8_t i = 0; i < TRY_NUMBER; i++ )
    {
        wait1ms( );
        if( PIN_MASTER_OR_SLAVE ) 
            cnt++;
    }
    ( cnt == 0 || cnt == TRY_NUMBER ) ? ( isMaster = ( cnt > 0 ) ) : ERROR_ID( eGrPS_Main, ePS_MainErrorConfigCPU );
}

//*****************************************************************************
// Определение конфигурации процессора. Возвращает true, если процессор Master
bool ConfigMK_isMaster( void )
{
    return isMaster;
}

//*****************************************************************************
// Определение конфигурации процессора. Возвращает true, если процессор Slave
bool ConfigMK_isSlave( void )
{
    return !isMaster;
}

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   21-02-2018
* Автор  Агулов М.А.
*
* Изменения:
*    Базовая версия.
*/
