/**
* \file    ConfigMK.h
* \brief   Определение конфигурации процессора 
* \details Интерфейс
* 
* \version 1.0.1
* \date    21-02-2018
* \author  Агулов М.А.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef CONFIGMK_H
#define CONFIGMK_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Определение типа процессора: Master или Slave.
/// 
void ConfigMK_ctor( void );

//*****************************************************************************
/// \brief Определение конфигурации процессора как Master.
/// \retval true  - процессор сконфигурирован как Master;
/// \retval false - процессор сконфигурирован как Slave.
/// 
bool ConfigMK_isMaster( void );

//*****************************************************************************
/// \brief Определение конфигурации процессора как Slave.
/// \retval true  - процессор сконфигурирован как Slave;
/// \retval false - процессор сконфигурирован как Master.
/// 
bool ConfigMK_isSlave( void );

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   21-02-2018
* Автор  Агулов М.А.
*
* Изменения:
*    Базовая версия.
*/
