/**
* \file    BlackBox.h
* \brief   Формирование и чтение информации ЧЯ 
* \details Интерфейс
*
* \version 2.0.1
* \date    06-04-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef BLACKBOX_H
#define BLACKBOX_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Сохранить в \a EEPROM информацию ЧЯ.
///
void BlackBox_save( void );

//*****************************************************************************
/// \brief Чтение из \a EEPROM информации ЧЯ и выдача ее в канал связи.
///
void BlackBox_read( void );

//*****************************************************************************
/// \brief Сохранить параметр, уточняющий причину ЗС.
/// \note Информация, уточняющая код, может состоять из нескольких переменных.
/// \param addCodePS - параметр, уточняющий причину ЗС;
/// \param number - индекс в массиве 0-3.
/// 
void BlackBox_saveAddCodeProtectionState( uint16_t addCodePS, uint8_t number );

//*****************************************************************************
/// \brief Сохранить параметр, уточняющий причину запуска МК.
/// \param data - параметр, уточняющий причину запуска МК.
///
void BlackBox_saveSourceReset( uint16_t data );

//*****************************************************************************
/// \brief Сохранить имя файла и номер строки \a ASSERT, вызвавшего ЗС.
/// \param nameFile - имя файла;
/// \param line - номер строки.
///
void BlackBox_saveASSERT( char const * const nameFile, int16_t line );

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   22-01-2016
* Автор  Третьяков В.Ж.
* 
* Изменения:
*    Базовая версия.
*
* Версия 2.0.1
* Дата   06-04-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Изменения под новую схему на dsPIC33.
*/
