/**
* \file    posDetGenerator.h
* \brief   Генератор напряжения контрольных цепей
* \details Интерфейс
*
* \version 1.0.2
* \date    06-11-2019
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef POSDETGENERATOR_H
#define POSDETGENERATOR_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>
#include <stdint.h> 

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация генератора напряжения контрольных цепей.
///
void PosDetGenerator_ctor( void );

//*****************************************************************************
/// \brief Управление работой генератора напряжения контрольных цепей.
/// \note Вызывается из главного цикла с периодом 1 мс.
///
void PosDetGenerator_run( void );

//*****************************************************************************
/// \brief Прерывание.
/// \note Вызывается из прерывания с периодом 62,5 мкс.
///
void PosDetGenerator_interrupt( void );

//*****************************************************************************
/// \brief Включение/выключение генератора напряжения контрольных цепей.
/// \param state - требуемое состояние генератора (true (включить), false (выключить)).
///
void PosDetGenerator_turnOn( bool state );

//*****************************************************************************
/// \brief Проверка состояния генератора напряжения контрольных цепей.
/// \retval true  - включен;
/// \retval false - выключен.
///
bool PosDetGenerator_isEnable( void );

//*****************************************************************************
/// \brief Контроль напряжения обратной связи генератора контрольного напряжения 
///
void PosDetGenerator_checkUfb( void );

/// \brief Функция возвращает состояние генератора напряжения контрольных цепей.
/// \retval 1 - генератор неисправен.
/// \retval 0 - генератор исправен.
///
uint8_t PosDetGenerator_isGeneratorFail( void );

//*****************************************************************************
/// \brief Установка уровня генератора напряжения контрольных цепей.
/// \param val - уровень генератора, полученный из приказа от управляющей системы
///
void PosDetGenerator_setLevel ( uint8_t val );

//*****************************************************************************
/// \brief Получить уровень генератора напряжения контрольных цепей.
/// \retval levelUgen - уровень генератора напряжения контрольных цепей.
///
uint8_t PosDetGenerator_getLevel ( void );

//*****************************************************************************
/// \brief Получить состояние готовности генератора напряжения контрольных цепей к выдаче достоверных данных.
/// \retval 1 - данные достоверны.
/// \retval 0 - данные недостоверны.
///
uint8_t PosDetGenerator_isReadyForUse( void );

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   26-12-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*    Базовая версия.
*
* Версия 1.0.2
* Дата   06-11-2019
* Автор  Кругликов В.П.
* 
* Изменения:
*    Добавлены прототипы функций
*    PosDetGenerator_isGeneratorFail
*    PosDetGenerator_setLevel
*    PosDetGenerator_getLevel
*/
