/**
* \file    positionDetFiveEC.h
* \brief   Определение положения c модулем реле 5-ЭЦ
* \details Интерфейс
*
* \version 1.0.1
* \date    28-12-2017
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef POSITIONDETFIVEEC_H
#define POSITIONDETFIVEEC_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "positionDetTypes.h"
#include "posDetGenerator.h"

//*****************************************************************************
// Определение глобальных типизированных констант
//*****************************************************************************
extern const ArrayPositionDet fiveWireECPosDet;        // Переменная структуры интерфейса.

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация.
///
void FiveWireECPosDet_ctor( void );

//*****************************************************************************
/// \brief Управление работой.
/// \note Вызывается из главного цикла с периодом 1 мс.
///
void FiveWireECPosDet_run( void );

//*****************************************************************************
/// \brief Включение/выключение определения положения стрелки.
/// \param on - управление определением положения стрелки (true (включить), false (выключить)).
///
void FiveWireECPosDet_turnOn( bool on );

//*****************************************************************************
/// \brief Проверка состояния модуля.
/// \retval true  - включен;
/// \retval false - выключен.
///
bool FiveWireECPosDet_isEnable( void );

//*****************************************************************************
/// \brief Получает установленное положение.
/// \return Установленное положение.
///
PositionDet_State FiveWireECPosDet_getPosition( void );

//*****************************************************************************
/// \brief Получает запрос на установку позиции контроля положения.
/// \return Требуемая позиция контроля положения.
///
PositionDet_State FiveWireECPosDet_getRequestPosDet( void );

//*****************************************************************************
/// \brief Передает установленную позицию контроля.
/// \param pos - установленная позиция контроля.
///
void FiveWireECPosDet_setPosDet( PositionDet_State pos );

#endif 

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   28-12-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*    Базовая версия.
*/
