/**
* \file    positionDetNineWire.c
* \brief   \copybrief positionDetNineWire.h
*
* \version 1.0.2
* \date    23-04-2020
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "positionDetNineWire.h"
#include "InterChannel.h"
#include "OverloadDet.h"
#include "ProtectionState_codes.h"
#include "asserts.h"
#include "AnalogMeasurement.h"


//*****************************************************************************
// Локальные константы, определенные через макросы
//*****************************************************************************
#define RMS_HIGH_40V 830     ///< Пороговое значение напряжения с бесконтактного датчика (верхнее значение).
#define RMS_LOW_12V  260     ///< Пороговое значение напряжения с бесконтактного датчика (нижнее значение).

//*****************************************************************************
//  Определение типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Структура состояния.
///
typedef struct
{
    uint8_t ctrl   :1;        ///< Включение модуля.
    uint8_t unused :7;        ///< Неиспользуемые биты.
} PosDetNineWire_flags;

//*****************************************************************************
/// \brief Объединение флагов состояния с \a uint8_t.
///
typedef union
{
    PosDetNineWire_flags str;         ///< Флаги состояния.
} uPosDetNineWire_flags;

//*****************************************************************************
/// \brief Структура результатов измерения.
///
typedef struct
{
    uint16_t ur1rms;    ///< Среднеквадратическое значение R1.
    uint16_t ur2rms;    ///< Среднеквадратическое значение R2.
} MeasurResult;

//*****************************************************************************
// Определение локальных типизированных констант
//*****************************************************************************

//*****************************************************************************
/// \brief Переменная структуры интерфейса.
/// 
const ArrayPositionDet nineWirePosDet =
{
    NineWirePosDet_ctor,
    NineWirePosDet_run,
    NineWirePosDet_turnOn,
    NineWirePosDet_isEnable,
    NineWirePosDet_getPosition,
    NineWirePosDet_getRequestPosDet,
    NineWirePosDet_setPosDet
};

//*****************************************************************************
// Определение локальных переменных
//*****************************************************************************
static uPosDetNineWire_flags flags;               ///< Флаги состояния.
static PositionDet_State     resultPosDet;        ///< Результат определения положения.
static MeasurResult          measur;              ///< Результат измерения.

//*****************************************************************************
// Прототипы локальных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Определение положения по результатам измерения.
/// \param data - результаты измерения.
/// \return Положение.
///
static PositionDet_State posDetermin( MeasurResult *data );

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация
void NineWirePosDet_ctor( void )
{
    // Включить определение положения 
    flags.str.ctrl = 1;
}

//*****************************************************************************
// Управление работой
void NineWirePosDet_run( void )
{
    if( flags.str.ctrl )
    { // Включено
        // Запись измеренных значений
        if ( PosDetGenerator_isReadyForUse( ) )
        {
            measur.ur1rms = InterChannel_getData( eICId_U_R1rms );
            measur.ur2rms = InterChannel_getData( eICId_U_R2rms );
            resultPosDet = posDetermin( &measur );
        }
        else
            resultPosDet = eDetNon;
    }
    else 
        resultPosDet = eDetNon;
}

//*****************************************************************************
// Включение/выключение
void NineWirePosDet_turnOn( bool on )
{
    flags.str.ctrl = on;
    if( flags.str.ctrl )
    { //Включить
        measur.ur1rms = 0;
        measur.ur2rms = 0;
    }
    else
    { //Выключить
        resultPosDet = eDetNon;
    }
}

//*****************************************************************************
// Проверка состояния модуля
bool NineWirePosDet_isEnable( void )
{
    return flags.str.ctrl;
}

//*****************************************************************************
// Получает установленное положение
PositionDet_State NineWirePosDet_getPosition( void )
{
    return resultPosDet;
}

//*****************************************************************************
// Получает запрос на установку позиции контроля положения
PositionDet_State NineWirePosDet_getRequestPosDet( void )
{
    return eDetNon;
}

//*****************************************************************************
// Передает установленную позицию контроля
void NineWirePosDet_setPosDet( PositionDet_State pos )
{

}

//*****************************************************************************
// Реализация локальных функций
//*****************************************************************************

//*****************************************************************************
// Определение положения по результатам измерения
PositionDet_State posDetermin( MeasurResult *data )
{
    if( data->ur1rms > RMS_HIGH_40V &&
        data->ur2rms < RMS_LOW_12V ) 
        return eDetMinus;               //"Положение минус"
    if( data->ur2rms > RMS_HIGH_40V &&
        data->ur1rms < RMS_LOW_12V ) 
        return eDetPlus;                //"Положение плюс"
    if( data->ur2rms > RMS_HIGH_40V && 
        data->ur1rms > RMS_HIGH_40V )   //Неопределённое состояние (ложный контроль)   
        return eDetUndefinedState;
    return eDetNon;                     //Положение "Потеря контроля"
}

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   28-12-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*
* Версия 1.0.2
* Дата   23-04-2020
* Автор  Кругликов В.П.
*
* Изменения:
*     Положение стрелки определяется только на активном приборе, иначе - потеря контроля
*/
