/**
* \file    positionDetTypes.h
* \brief   Прототипы функций определения положения.
*
* \version 1.0.1
* \date    28-12-2017
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef POSITIONDETTYPES_H
#define POSITIONDETTYPES_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "positionDet.h"

//*****************************************************************************
// Определение типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Прототип функции инициализации.
///
typedef void( *pfPosDetCtor )( void );

//*****************************************************************************
/// \brief Прототип функции контроля работы.
///
typedef void( *pfPosDetRun )( void );

//*****************************************************************************
/// \brief Прототип функции включения/выключения определения положения.
/// \param on - управление определением положения стрелки (true (включить), false (выключить)).
///
typedef void( *pfPosDetTurnOn )( bool on );

//*****************************************************************************
/// \brief Прототип функции проверки состояния.
///
typedef bool( *pfPosDetIsEnable )( void );

//*****************************************************************************
/// \brief Прототип функции возвращения результата определения положения.
///
typedef PositionDet_State( *pfPosDetGetPosition )( void );

//*****************************************************************************
/// \brief Прототип функции запроса на установку позиции контроля положения.
///
typedef PositionDet_State( *pfPosDetGetReqPosDet )( void );

//*****************************************************************************
/// \brief Прототип функции передачи установленной позиции контроля.
/// \param pos - установленная позиция контроля положения стрелки. 
///
typedef void( *pfPosDetSetPosDet )( PositionDet_State pos );

//*****************************************************************************
/// \brief Структура внутреннего интерфейса модуля.
///
typedef struct ArrayPositionDet 
{
    pfPosDetCtor         ctor;                ///< Инициализация.
    pfPosDetRun          run;                 ///< Управление работой.
    pfPosDetTurnOn       turnOn;              ///< Включение/выключение определения положения.
    pfPosDetIsEnable     isEnable;            ///< Проверка состояния.
    pfPosDetGetPosition  getPos;              ///< Возвращение результата.
    pfPosDetGetReqPosDet getReqPosDet;        ///< Запрос на установку позиции контроля.
    pfPosDetSetPosDet    setPosDet;           ///< Передача установленной позиции контроля.
} ArrayPositionDet;

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   28-12-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
