/**
* \file    positionDetNineWire.h
* \brief   Определение положения c модулем реле 9-ти проводным
* \details Интерфейс
*
* \version 1.0.1
* \date    28-12-2017
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef POSITIONDETNINEWIRE_H
#define POSITIONDETNINEWIRE_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "positionDetTypes.h"
#include "posDetGenerator.h"

//*****************************************************************************
// Определение глобальных типизированных констант
//*****************************************************************************
extern const ArrayPositionDet nineWirePosDet;        // Переменная структуры интерфейса.

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
void NineWirePosDet_ctor( void );        ///< Инициализация.

//*****************************************************************************
/// \brief Управление работой.
/// \note Вызывается из главного цикла с периодом 1 мс.
///
void NineWirePosDet_run( void );

//*****************************************************************************
/// \brief Включение/выключение определение положения стрелки.
/// \param on - требуемое состояние определения положения стрелки (true (включить), false (выключить)).
///
void NineWirePosDet_turnOn( bool on );

//*****************************************************************************
/// \brief Проверка состояния модуля.
/// \retval true  - включен;
/// \retval false - выключен.
///
bool NineWirePosDet_isEnable( void );

//*****************************************************************************
/// \brief Получает установленное положение стрелки.
/// \return Установленное положение стрелки.
///
PositionDet_State NineWirePosDet_getPosition( void );

//*****************************************************************************
/// \brief Получает запрос на установку позиции контроля положения стрелки.
/// \return Требуемая позиция контроля положения стрелки.
///
PositionDet_State NineWirePosDet_getRequestPosDet( void );

//*****************************************************************************
/// \brief Передает установленную позицию контроля стрелки.
/// \param pos - установленная позиция контроля положения стрелки.
///
void NineWirePosDet_setPosDet( PositionDet_State pos );

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   28-12-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
