/**
* \file    positionDet.h
* \brief   Определение положения стрелки
* \details Интерфейс
*
* \version 1.0.1
* \date    26-12-2017
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef POSITIONDET_H
#define POSITIONDET_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>
#include <stdint.h>
#include "DeviceAddress.h"

//*****************************************************************************
// Объявление типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Контроль положения.
///
typedef enum
{
    eDetNon         = 0,    ///< "Потеря контроля"
    eDetMinus,              ///< "Положение минус"
    eDetPlus,               ///< "Положение плюс"
    eDetUndefinedState      ///< неопределённое состояние
} PositionDet_State;

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация определения положения стрелки.
/// \param relayType - тип модуля реле.
///
void PositionDet_ctor( RelayModuleType relayType );

//*****************************************************************************
/// \brief Управление работой.
/// \note Вызывается из главного цикла с периодом 1 мс.
///
void PositionDet_run( void );

//*****************************************************************************
/// \brief Включение/выключение определения положения.
/// \param on - установка определения положения стрелки (true (включить), false (выключить).
///
void PositionDet_turnOn( bool on );

//*****************************************************************************
/// \brief Проверка состояния модуля.
/// \retval true  - включен;
/// \retval false - выключен.
///
bool PositionDet_isEnable( void );

//*****************************************************************************
/// \brief Получает текущее положение стрелки.
/// \return Установленное положение.
///
PositionDet_State PositionDet_getPosition( void );

//*****************************************************************************
/// \brief Получает запрос на установку позиции контроля положения.
/// \return Требуемую позицию контроля положения.
///
PositionDet_State PositionDet_getRequestPositionDet( void );

//*****************************************************************************
/// \brief Передает установленную позицию контроля.
/// \param pos - установленная позиция контроля.
///
void PositionDet_setPosDet( PositionDet_State pos );

#endif

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Дата   26-12-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
