/**
* \file    DigitalFilter.c
* \brief   \copybrief DigitalFilter.h
*
* \version 1.0.1
* \date    23-04-2018
* \author  Агулов М.А.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <string.h>
#include "AnalogInput.h"
#include "ProtectionState_codes.h"
#include "asserts_ex.h"
#include "DigitalFilter.h"

//*****************************************************************************
// Локальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
/// \brief Число сдвигов аккумулятора для приведения результата фильтрации к выходному формату.
///
#define ADDR_SHIFT_NUM_62_5HZ       4

//*****************************************************************************
// Объявление локальных типизированных констант
//*****************************************************************************

//*****************************************************************************
/// \brief Коэффициенты Вn-фильтра.
///
//   Тип фильтра - полосовой Кайзера
//   Частота дискретизации (Fs):    1000 Гц
//   Центральная частота фильтра:   62.5 Гц
//   Полоса пропускного фильтра:    0.36 Гц
//   Частота заграждения нижняя:    54.025 Гц
//   Частота пропускания нижняя:    62.32 Гц
//   Частота пропускания верхняя:   62.68 Гц
//   Частота заграждения верхняя:   70.975 Гц
//   Максимальное отклонение АЧХ в полосе пропускания: 3 дБ
//   Минимальное подавление в полосе заграждения: 35 дБ
//   Уровень нормализации: 0 дБ
//   Порядок фильтра: 228

const int16_t __attribute__( ( space( ymemory ), eds ) ) LPF_B_62_5Hz [229] =
{
    0x002a,        // Коэффициент B0
    0x005f,        // Коэффициент B1
    0x0095,        // Коэффициент B2
    0x00b8,        // Коэффициент B3
    0x00b3,        // Коэффициент B4
    0x0077,        // Коэффициент B5
    0x0000,        // Коэффициент B6
    0xff59,        // Коэффициент B7
    0xfe9c,        // Коэффициент B8
    0xfdeb,        // Коэффициент B9
    0xfd73,        // Коэффициент B10
    0xfd5a,        // Коэффициент B11
    0xfdbd,        // Коэффициент B12
    0xfea5,        // Коэффициент B13
    0x0000,        // Коэффициент B14
    0x01a4,        // Коэффициент B15
    0x0350,        // Коэффициент B16
    0x04b6,        // Коэффициент B17
    0x0587,        // Коэффициент B18
    0x0585,        // Коэффициент B19
    0x048e,        // Коэффициент B20
    0x02a6,        // Коэффициент B21
    0x0000,        // Коэффициент B22
    0xfcf6,        // Коэффициент B23
    0xfa03,        // Коэффициент B24
    0xf7aa,        // Коэффициент B25
    0xf669,        // Коэффициент B26
    0xf69a,        // Коэффициент B27
    0xf862,        // Коэффициент B28
    0xfba4,        // Коэффициент B29
    0x0000,        // Коэффициент B30
    0x04da,        // Коэффициент B31
    0x0970,        // Коэффициент B32
    0x0cf6,        // Коэффициент B33
    0x0eba,        // Коэффициент B34
    0x0e44,        // Коэффициент B35
    0x0b6f,        // Коэффициент B36
    0x0679,        // Коэффициент B37
    0x0000,        // Коэффициент B38
    0xf8f1,        // Коэффициент B39
    0xf266,        // Коэффициент B40
    0xed7d,        // Коэффициент B41
    0xeb26,        // Коэффициент B42
    0xebf9,        // Коэффициент B43
    0xf014,        // Коэффициент B44
    0xf70f,        // Коэффициент B45
    0x0000,        // Коэффициент B46
    0x099b,        // Коэффициент B47
    0x125f,        // Коэффициент B48
    0x18d3,        // Коэффициент B49
    0x1bc5,        // Коэффициент B50
    0x1a7f,        // Коэффициент B51
    0x14ed,        // Коэффициент B52
    0x0bae,        // Коэффициент B53
    0x0000,        // Коэффициент B54
    0xf39c,        // Коэффициент B55
    0xe870,        // Коэффициент B56
    0xe058,        // Коэффициент B57
    0xdcca,        // Коэффициент B58
    0xde97,        // Коэффициент B59
    0xe5c1,        // Коэффициент B60
    0xf16e,        // Коэффициент B61
    0x0000,        // Коэффициент B62
    0x0f4d,        // Коэффициент B63
    0x1cf2,        // Коэффициент B64
    0x26b2,        // Коэффициент B65
    0x2ad6,        // Коэффициент B66
    0x2873,        // Коэффициент B67
    0x1fa0,        // Коэффициент B68
    0x1179,        // Коэффициент B69
    0x0000,        // Коэффициент B70
    0xedd1,        // Коэффициент B71
    0xddc0,        // Коэффициент B72
    0xd269,        // Коэффициент B73
    0xcdc1,        // Коэффициент B74
    0xd0c1,        // Коэффициент B75
    0xdb38,        // Коэффициент B76
    0xebc3,        // Коэффициент B77
    0x0000,        // Коэффициент B78
    0x14e4,        // Коэффициент B79
    0x2730,        // Коэффициент B80
    0x33f4,        // Коэффициент B81
    0x3909,        // Коэффициент B82
    0x356b,        // Коэффициент B83
    0x296d,        // Коэффициент B84
    0x16b5,        // Коэффициент B85
    0x0000,        // Коэффициент B86
    0xe8bd,        // Коэффициент B87
    0xd487,        // Коэффициент B88
    0xc694,        // Коэффициент B89
    0xc132,        // Коэффициент B90
    0xc565,        // Коэффициент B91
    0xd2b7,        // Коэффициент B92
    0xe744,        // Коэффициент B93
    0x0000,        // Коэффициент B94
    0x1928,        // Коэффициент B95
    0x2ed9,        // Коэффициент B96
    0x3da9,        // Коэффициент B97
    0x4335,        // Коэффициент B98
    0x3e7f,        // Коэффициент B99
    0x3020,        // Коэффициент B100
    0x1a31,        // Коэффициент B101
    0x0000,        // Коэффициент B102
    0xe58b,        // Коэффициент B103
    0xcee6,        // Коэффициент B104
    0xbf98,        // Коэффициент B105
    0xba0a,        // Коэффициент B106
    0xbf29,        // Коэффициент B107
    0xce3d,        // Коэффициент B108
    0xe502,        // Коэффициент B109
    0x0000,        // Коэффициент B110
    0x1b15,        // Коэффициент B111
    0x3218,        // Коэффициент B112
    0x417e,        // Коэффициент B113
    0x46e7,        // Коэффициент B114
    0x417e,        // Коэффициент B115
    0x3218,        // Коэффициент B116
    0x1b15,        // Коэффициент B117
    0x0000,        // Коэффициент B118
    0xe502,        // Коэффициент B119
    0xce3d,        // Коэффициент B120
    0xbf29,        // Коэффициент B121
    0xba0a,        // Коэффициент B122
    0xbf98,        // Коэффициент B123
    0xcee6,        // Коэффициент B124
    0xe58b,        // Коэффициент B125
    0x0000,        // Коэффициент B126
    0x1a31,        // Коэффициент B127
    0x3020,        // Коэффициент B128
    0x3e7f,        // Коэффициент B129
    0x4335,        // Коэффициент B130
    0x3da9,        // Коэффициент B131
    0x2ed9,        // Коэффициент B132
    0x1928,        // Коэффициент B133
    0x0000,        // Коэффициент B134
    0xe744,        // Коэффициент B135
    0xd2b7,        // Коэффициент B136
    0xc565,        // Коэффициент B137
    0xc132,        // Коэффициент B138
    0xc694,        // Коэффициент B139
    0xd487,        // Коэффициент B140
    0xe8bd,        // Коэффициент B141
    0x0000,        // Коэффициент B142
    0x16b5,        // Коэффициент B143
    0x296d,        // Коэффициент B144
    0x356b,        // Коэффициент B145
    0x3909,        // Коэффициент B146
    0x33f4,        // Коэффициент B147
    0x2730,        // Коэффициент B148
    0x14e4,        // Коэффициент B149
    0x0000,        // Коэффициент B150
    0xebc3,        // Коэффициент B151
    0xdb38,        // Коэффициент B152
    0xd0c1,        // Коэффициент B153
    0xcdc1,        // Коэффициент B154
    0xd269,        // Коэффициент B155
    0xddc0,        // Коэффициент B156
    0xedd1,        // Коэффициент B157
    0x0000,        // Коэффициент B158
    0x1179,        // Коэффициент B159
    0x1fa0,        // Коэффициент B160
    0x2873,        // Коэффициент B161
    0x2ad6,        // Коэффициент B162
    0x26b2,        // Коэффициент B163
    0x1cf2,        // Коэффициент B164
    0x0f4d,        // Коэффициент B165
    0x0000,        // Коэффициент B166
    0xf16e,        // Коэффициент B167
    0xe5c1,        // Коэффициент B168
    0xde97,        // Коэффициент B169
    0xdcca,        // Коэффициент B170
    0xe058,        // Коэффициент B171
    0xe870,        // Коэффициент B172
    0xf39c,        // Коэффициент B173
    0x0000,        // Коэффициент B174
    0x0bae,        // Коэффициент B175
    0x14ed,        // Коэффициент B176
    0x1a7f,        // Коэффициент B177
    0x1bc5,        // Коэффициент B178
    0x18d3,        // Коэффициент B179
    0x125f,        // Коэффициент B180
    0x099b,        // Коэффициент B181
    0x0000,        // Коэффициент B182
    0xf70f,        // Коэффициент B183
    0xf014,        // Коэффициент B184
    0xebf9,        // Коэффициент B185
    0xeb26,        // Коэффициент B186
    0xed7d,        // Коэффициент B187
    0xf266,        // Коэффициент B188
    0xf8f1,        // Коэффициент B189
    0x0000,        // Коэффициент B190
    0x0679,        // Коэффициент B191
    0x0b6f,        // Коэффициент B192
    0x0e44,        // Коэффициент B193
    0x0eba,        // Коэффициент B194
    0x0cf6,        // Коэффициент B195
    0x0970,        // Коэффициент B196
    0x04da,        // Коэффициент B197
    0x0000,        // Коэффициент B198
    0xfba4,        // Коэффициент B199
    0xf862,        // Коэффициент B200
    0xf69a,        // Коэффициент B201
    0xf669,        // Коэффициент B202
    0xf7aa,        // Коэффициент B203
    0xfa03,        // Коэффициент B204
    0xfcf6,        // Коэффициент B205
    0x0000,        // Коэффициент B206
    0x02a6,        // Коэффициент B207
    0x048e,        // Коэффициент B208
    0x0585,        // Коэффициент B209
    0x0587,        // Коэффициент B210
    0x04b6,        // Коэффициент B211
    0x0350,        // Коэффициент B212
    0x01a4,        // Коэффициент B213
    0x0000,        // Коэффициент B214
    0xfea5,        // Коэффициент B215
    0xfdbd,        // Коэффициент B216
    0xfd5a,        // Коэффициент B217
    0xfd73,        // Коэффициент B218
    0xfdeb,        // Коэффициент B219
    0xfe9c,        // Коэффициент B220
    0xff59,        // Коэффициент B221
    0x0000,        // Коэффициент B222
    0x0077,        // Коэффициент B223
    0x00b3,        // Коэффициент B224
    0x00b8,        // Коэффициент B225
    0x0095,        // Коэффициент B226
    0x005f,        // Коэффициент B227
    0x002a         // Коэффициент B228
};

//*****************************************************************************
// Объявление локальных переменных
//*****************************************************************************

//*****************************************************************************
// Структура состояния цифрового фильтра. Должна обязательно располагаться в xmemory, т.к. линия задержки
// фильтра может находиться только в xmemory.
/// \brief Массив структур состояния цифрового фильтра.
///
DigitalFilterStruct __attribute__( ( space( xmemory ) ) ) DigitalFilter[eDigitalFilterCount];

//*****************************************************************************
// Прототипы локальных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Функция вычисления КИХ-фильтра.
/// \param FilterCoeffStartAddress - указатель на стартовый адрес B-коэффициентов фильтра;
/// \param FilterDelayPtr - указатель на ячейку, содержащую указатель текущей позиции в линии задержки;
/// \param FilterCoeffLen - количество B-коэффициентов фильтра;
/// \param SampleCount - количество отсчетов в массиве \a InputSamples;
/// \param FilterDelayStartAddress - указатель на адрес 1-го отсчета в линии задержки (кольцевой буфер);
/// \param InputSamples - указатель на входные данные;
/// \param AccShift - число сдвигов аккумулятора для приведения результата к формату \a int16_t.
///
void SignalFilter( const int16_t       *FilterCoeffStartAddress,
                         int16_t       *FilterDelayPtr,
                         uint16_t      FilterCoeffLen,
                         uint16_t      SampleCount,
                         int16_t       *FilterDelayStartAddress,
                         int16_t       *InputSamples,
                         uint16_t      AccShift );

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Настройка цифрового фильтра на заданную АЧХ
void DigitalFilter_setFreq( DigFilterID filterId, DigitalFilterFreq freqId )
{
    ASSERT_EX_ID( eGrPS_AnalogInput, ePS_AinErrorDfId,                          // Контроль на валидность идентификатора фильтра
                  filterId < eDigitalFilterCount,
                  filterId, freqId, 0, 0 );
    
    // Инициализация параметров фильтра (с номером filterId) на выбранную АЧХ (freqId)
    switch( freqId )
    {
        case eDfFreq62_5Hz:
            DigitalFilter[filterId].DelayPtr = DigitalFilter[filterId].Delay;
            DigitalFilter[filterId].Coeffs = LPF_B_62_5Hz;
            DigitalFilter[filterId].FilterBnum = sizeof( LPF_B_62_5Hz ) / sizeof( LPF_B_62_5Hz[0] );
            DigitalFilter[filterId].AccShift = ADDR_SHIFT_NUM_62_5HZ;
            break;
    }
    
    // Очистка линии задержки цифрового фильтра
    memset( DigitalFilter[filterId].Delay, 0, sizeof( DigitalFilter[filterId].Delay ) ); 
}

//*****************************************************************************
// Фильтрация данных
void DigitalFilter_run( DigFilterID filterId, int16_t *Samples, uint16_t SampleCount )
{
    ASSERT_EX_ID( eGrPS_AnalogInput, ePS_AinErrorDfId,                          // Контроль валидности идентификатора фильтра
                  filterId < eDigitalFilterCount,
                  filterId, 0, 0, 0 );
    
    SignalFilter( DigitalFilter[filterId].Coeffs,                               // [W0] - стартовый адрес B-коэффициентов фильтра
                  ( int16_t * ) & DigitalFilter[filterId].DelayPtr,             // [W1] - адрес ячейки ОЗУ, содержащую адрес текущей позиции в линии задержки
                  DigitalFilter[filterId].FilterBnum,                           // [W2] - количество B-коэффициентов фильтра
                  SampleCount,                                                  // [W3] - количество отсчетов в массиве InputSamples
                  DigitalFilter[filterId].Delay,                                // [W4] - указатель на 1-ый отсчет в линии задержки (начало кольцевого буфера)
                  ( int16_t * )Samples,                                         // [W5] - указатель на входные данные
                  DigitalFilter[filterId].AccShift );                           // [W6] - число сдвигов аккумулятора для приведения результата к формату int16_t
}

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   23-04-2018
* Автор  Агулов М.А.
* 
* Изменения:
*     Базовая версия.
*/
