/**
* \file    DigitalFilter.h
* \brief   Модуль цифрового фильтра 
* \details Интерфейс
*
* \version 1.0.1
* \date    23-04-2018
* \author  Агулов М.А.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef DIGITALFILTER_H
#define DIGITALFILTER_H

//*****************************************************************************
// Определение типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Структура состояния цифрового фильтра.
///
typedef struct
{
    int16_t       Delay[256];        ///< Линия задержки цифрового фильтра.
    const int16_t *Coeffs;           ///< Указатель на коэффициенты фильтра (X-область памяти).
    int16_t       *DelayPtr;         ///< Указатель на текущий отсчет в линии задержки.
    uint16_t      FilterBnum;        ///< Количество коэффициентов фильтра.
    int16_t       AccShift;          ///< Число сдвигов аккумулятора для приведения результата к формату \a int_16.
} DigitalFilterStruct;

//*****************************************************************************
/// \brief Список доступных частот пропускания.
///
typedef enum DigitalFilterFreq_tag 
{
    eDfFreq62_5Hz = 0         ///< 62,5 Гц
} DigitalFilterFreq;

//*****************************************************************************
/// \brief Список идентификаторов цифровых фильтров.
///
typedef enum 
{
    eDigitalFilterOff   = -1,    ///< идентификатор отключающий фильтр
    eDigitalFilterGEN,           ///< идентификатор цифрового фильтра выходного сигнала контрольного генератора
    eDigitalFilterR1,            ///< идентификатор цифрового фильтра сигнала датчика положения R1
    eDigitalFilterR2,            ///< идентификатор цифрового фильтра сигнала датчика положения R2
    eDigitalFilterCount          ///< количество используемых фильтров
} DigFilterID; 

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Настройка цифрового фильтра.
/// \details Настраивает фильтр на заданную АЧХ.
/// \details Обнуляет значения в линии задержки, поэтому вызывать ее  
/// необходимо только при смене АЧХ фильтра.
/// \note Если требуется изменить АЧХ 
/// фильтра в процессе работы, функция должна быть обязательно вызвана перед 1-ым вызовом 
/// #DigitalFilter_run.
/// \note При вызове функции с некорректным \a filterId или \a freqId, функция
/// приведет к переходу в ЗС с кодами #ePS_AinErrorDfId и
/// #ePS_AinErrorDfFreq группы отказов #eGrPS_AnalogInput. 
/// \param filterId - идентификатор фильтра;
/// \param freqId - идентификатор АЧХ фильтра.
///
void DigitalFilter_setFreq( DigFilterID filterId, DigitalFilterFreq freqId );

//*****************************************************************************
/// \brief Фильтрация данных.
/// \details Принимает данные, новые значения входного сигнала,
/// которые необходимо пропустить через фильтр.
/// \details Выполняет фильтрацию и возвращает столько же отфильтрованных данных, 
/// сколько было принято для фильтрации. Данные возвращаются в 
/// тот же массив, в котором были входные данные.
/// \note Вызывается из главного цикла с периодом 1 мс.
/// \note При вызове функции с некорректным \a filterId, функция
/// приведет к переходу в ЗС с кодом отказа #ePS_AinErrorDfId
/// группы #eGrPS_AnalogInput. 
/// \param filterId - идентификатор фильтра;
/// \param Samples - указатель на массив отсчётов;
/// \param SampleCount - количество отсчётов.
///
void DigitalFilter_run( DigFilterID filterId, int16_t *Samples, uint16_t SampleCount );

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   23-04-2018
* Автор  Агулов М.А.
* 
* Изменения:
*     Базовая версия.
*/
