/**
* \file    IntegrCtrlGen.c
* \brief   \copybrief IntegrCtrlGen.h 
*
* \version 1.0.1
* \date    02-02-2018
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>
#include "IntegrCtrlGen.h"
#include "shuntShiftGenDrv.h"
#include "asserts_ex.h"
#include "ProtectionState_codes.h"
#include "CheckCallFunctions.h"


//*****************************************************************************
// Локальные константы, определенные через макросы
//***************************************************************************** 

//*****************************************************************************
#define PWM_PERIOD_INT_CTRL_GEN    4208U                          ///< Значение PTPER для 28 кГц ШИМ генератора.
#define MAX_PDC_VALUE              4208U                          ///< Значение PDC (длительности ШИМ), соответствующее 100 %.

//***************************************************************************** 
/// \brief Максимально допустимый уровень сигнала при тестировании контроля целостности (в процентах от #MAX_PDC_VALUE).
///
#define MAX_LEVEL_INT_CTRL   ( 78 * MULTIPLY_VOLTAGE_STEP_INT_CTRL )

//***************************************************************************** 
/// \brief Максимально допустимый уровень сигнала при тестировании корректора (в процентах от #MAX_PDC_VALUE).
///
#define MAX_LEVEL_TEST_CORR  ( 78 * MULTIPLY_VOLTAGE_STEP_TEST_CORR )

//*****************************************************************************
/// \brief Минимально допустимый уровень сигнала (в процентах от #MAX_PDC_VALUE).
///
#define MIN_LEVEL_GEN       0

//*****************************************************************************
#define NUM_TESTING_MODES   2                             ///< Количество режимов тестирования.

//***************************************************************************** 
/// \brief  Размах шкалы уровня формирователя в процентах.
///
#define MAX_SCALE_VALUE_INT_CTRL    ( 100 * MULTIPLY_VOLTAGE_STEP_INT_CTRL ) 

//***************************************************************************** 
/// \brief Размах шкалы уровня формирователя в процентах.
///
#define MAX_SCALE_VALUE_TEST_CORR   ( 100 * MULTIPLY_VOLTAGE_STEP_TEST_CORR )

//*****************************************************************************
// Локальные типизированные константы
//***************************************************************************** 
static const uint8_t NUM_OF_PHASES = 3;    ///< Количество фаз сигнала.

//*****************************************************************************
// Определение типов данных
//***************************************************************************** 

//***************************************************************************** 
/// \brief Значения автомата состояний функции #IntegrCtrlGen_run.
///
typedef enum
{
    eSwitchedOff = 0,        ///< выключен
    eSwitchedOn,             ///< включен
} IntDetGen;

//***************************************************************************** 
/// \brief Размах шкалы сигнала (при тестировании фаз и при тестировании корректора).
///
const uint16_t IntegrCtrlGen_maxScales[NUM_TESTING_MODES] =
{
    MAX_SCALE_VALUE_INT_CTRL,
    MAX_SCALE_VALUE_TEST_CORR
};

//***************************************************************************** 
/// \brief Максимумы сигнала (при тестировании фаз и при тестировании корректора).
///
const uint16_t IntegrCtrlGen_maxLevels[NUM_TESTING_MODES] =
{
    MAX_LEVEL_INT_CTRL, 
    MAX_LEVEL_TEST_CORR
};

//*****************************************************************************
// Определение локальных переменных
//*****************************************************************************

//*****************************************************************************
static uint16_t level;          ///< Уровень генератора в процентах.

//*****************************************************************************
static Phase phase;        ///< Текущая фаза 3-фазного сигнала.

//*****************************************************************************
static bool ctrl;          ///< Разрешение/запрет работы.


static uint8_t  stepCnt;        ///< Значение автомата состояний \a IntDetGen.
//*****************************************************************************
static int16_t valueArr[3];        ///< Массив значений длительности ШИМа.

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация генератора
void IntegrCtrlGen_ctor( void )
{
    ShuntShiftGenDrv_off( ); // Отключение ШИМ, назначение выводов как IO Ports
    ctrl = 0;                // Запрет работы генератора 
    level = 0;               // Установить начальный уровень = 0
    stepCnt = eSwitchedOff;  // Начальная инициализация автомата состояний в положении выкл
}

//*****************************************************************************
// Управление работой формирователя сигнала контроля целостности обмоток
void IntegrCtrlGen_run( void )
{
    uint8_t counter;
    static uint8_t timeCnt;

    if( timeCnt ) timeCnt--;
    switch( stepCnt )
    {
        case eSwitchedOff: //Формирователь выключен, ожидание включения, инициализация длительностей ШИМа
            if( ctrl )
            {
                for( counter = 0; counter < NUM_OF_PHASES; counter++ ) valueArr [counter] = 0;
                ShuntShiftGenDrv_on( PWM_PERIOD_INT_CTRL_GEN, valueArr );
                stepCnt = eSwitchedOn;
            }
            break;
        case eSwitchedOn: //Формирователь включен, ожидание выключения, обновление длительностей ШИМа 
            if( !ctrl )
            {
                ShuntShiftGenDrv_off( );
                stepCnt = eSwitchedOff;
            }
            else 
                ShuntShiftGenDrv_setValues( valueArr );
            break;
        default: //Ошибка автомата состояний
            ERROR_ID( eGrPS_IntegrCtrl, ePS_IntegrCtrlGenStepCntError );
            stepCnt = eSwitchedOff;
    }
    MARKED_CALL_FUNCTION;
}

//*****************************************************************************
// Включение генератора контроля целостности обмоток
void IntegrCtrlGen_turnOn( void )
{
    ctrl = true;
}

//*****************************************************************************
// Установка параметров генератора
void IntegrCtrlGen_setParam( Phase phVal, uint16_t lvlVal, IntDetTypeTesting type )
{
    phase = phVal;
    if( phVal == eNone )
    {
        level = MIN_LEVEL_GEN;
        return;
    }
    if( lvlVal > IntegrCtrlGen_maxLevels[type] ) //Ограничение по максимуму сигнала
        level = IntegrCtrlGen_maxLevels[type];
    else if( lvlVal < MIN_LEVEL_GEN ) //Ограничение по минимуму сигнала
        level = MIN_LEVEL_GEN;
    else
        level = lvlVal;
    valueArr[phase] = __builtin_divsd( __builtin_mulsu( MAX_PDC_VALUE, level ), IntegrCtrlGen_maxScales[type] );
}

//*****************************************************************************
// Отключение формирователя сигнала контроля целостности обмоток
void IntegrCtrlGen_turnOff( void )
{
    ctrl = false;
}

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   02-02-2018
* Автор  Кругликов В.П.
*
* Изменения:
*    Базовая редакция.
*/
