/**
* \file    IntegrCtrl.h
* \brief   Модуль логики контроля целостности обмоток двигателя
* \details Интерфейс
*
* \version 1.0.1
* \date    05-02-2018
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef INTEGRCTRL_H
#define INTEGRCTRL_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>
#include <stdbool.h>
#include "shuntShiftMotor.h"
#include "positionDet.h"

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация модуля контроля целостности обмоток двигателя.
///
void IntegrCtrl_ctor( void );

//*****************************************************************************
/// \brief  Управление работой модуля контроля целостности обмоток.
///
void IntegrCtrl_run( void );

//*****************************************************************************
/// \brief Отключение модуля контроля целостности обмоток.
///
void IntegrCtrl_turnOff( void );

//*****************************************************************************
/// \brief Проверка состояния модуля контроля целостности обмоток.
/// \retval true  - модуль включен;
/// \retval false - модуль выключен.
bool IntegrCtrl_isOn( void );

//*****************************************************************************
/// \brief  Включение модуля контроля целостности обмоток.
/// \param st - признак работы со стендом или с реальной стрелкой;
/// \param direction - направление вращения.
///
void IntegrCtrl_turnOn( bool st, PositionDet_State direction );

//*****************************************************************************
/// \brief Получить значение состояния рабочих цепей.
///
MotorFailure IntegrCtrl_getFailure( void );

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   05-02-2018
* Автор  Кругликов В.П.
*
* Изменения:
*    Базовая редакция.
*/
