/**
* \file    IntegrCtrlGen.h
* \brief   Формирователь сигнала контроля целостности обмоток двигателя
* \details Интерфейс
*
* \version 1.0.1
* \date    02-02-2018
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef INTEGRCTRLGEN_H
#define INTEGRCTRLGEN_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>
#include <stdbool.h>

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
/// \brief Значение множителя для размаха шкалы уровней напряжений контроля целостности обмоток.
///
#define MULTIPLY_VOLTAGE_STEP_INT_CTRL     12U 

//*****************************************************************************
/// \brief Значение множителя для размаха шкалы уровней напряжений контроля корректора.
///
#define MULTIPLY_VOLTAGE_STEP_TEST_CORR    2U 

//*****************************************************************************
// Объявление типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Значения типов тестирования параметров.
/// 
typedef enum
{
    eTestingIntegrCtrl,      ///< тестирование целостности обмоток двигателя
    eTestingCorrector        ///< тестирование корректора коэффициента мощности
}IntDetTypeTesting;

//*****************************************************************************
/// \brief Перечисление фаз сигнала формирователя контроля целостности обмоток.
///
typedef enum 
{
    ePhaseV  = 0,        ///< фаза V
    ePhaseW,             ///< фаза W
    ePhaseU,             ///< фаза U
    eNone                ///< фаза отсутствует
} Phase;

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация генератора.
///
void IntegrCtrlGen_ctor( void );

//*****************************************************************************
/// \brief Управление работой формирователя сигнала контроля целостности обмоток.
///
void IntegrCtrlGen_run( void );

//*****************************************************************************
/// \brief Включение генератора контроля целостности обмоток.
///
void IntegrCtrlGen_turnOn( void );

//*****************************************************************************
/// \brief Отключение формирователя сигнала контроля целостности обмоток.
///
void IntegrCtrlGen_turnOff( void );

//*****************************************************************************
/// \brief Установка параметров генератора.
/// \param phVal - значение фазы сигнала;
/// \param lvlVal - значение уровня сигнала;
/// \param type - тип тестирования в соответствии со значением #IntDetTypeTesting.
/// 
void IntegrCtrlGen_setParam( Phase phVal, uint16_t lvlVal, IntDetTypeTesting type );

#endif

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   02-02-2018
* Автор  Кругликов В.П.
*
* Изменения:
*    Базовая редакция.
*/
