/**
* \file    shuntShiftGen.h
* \brief   Генерация 3-фазной синусоиды с заданной частотой, уровнем и фазировкой
* \details Интерфейс
*
* \version 1.0.1
* \date    30-01-2018
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef SHUNTSHIFTGEN_H
#define SHUNTSHIFTGEN_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>
#include <stdbool.h>

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************
#define QUANTITY_OF_FREQ_SINUS 3         ///< Количество генерируемых частот.
#define MAX_LEVEL_FOR_16HZ     40        ///< Максимальный уровень частоты 16 Гц, %.
#define MAX_LEVEL_FOR_25HZ     60        ///< Максимальный уровень частоты 25 Гц, %.
#define MAX_LEVEL_FOR_50HZ     88        ///< Максимальный уровень частоты 50 Гц, %.
#define MIN_LEVEL_FOR_16HZ     0         ///< Минимальный уровень частоты 16 Гц, %.
#define MIN_LEVEL_FOR_25HZ     0         ///< Минимальный уровень частоты 25 Гц, %
#define MIN_LEVEL_FOR_50HZ     0         ///< Минимальный уровень частоты 50 Гц, %.

//*****************************************************************************
/// \brief Время выхода от 0 до средней точки в мс при старте генератора.
///
#define TIMEOUT_TO_START_GEN    50U

//*****************************************************************************
// Определение типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Частоты огибающей, на которых работает 3-фазный генератор.
///
typedef enum 
{
    eFreq16hz  = 0,    ///< частота 16 Гц
    eFreq25hz,         ///< частота 25 Гц
    eFreq50hz          ///< частота 50 Гц
} Freq;


//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация генератора трёхфазного сигнала.
/// 
void ShuntShiftGen_ctor( void );

//*****************************************************************************
/// \brief Управление работой генератора в основном цикле.
/// 
void ShuntShiftGen_run( void );

//*****************************************************************************
/// \brief Управление работой генератора в прерывании.
/// 
void ShuntShiftGen_interrupt( void );

//*****************************************************************************
/// \brief Отключение генератора.
/// 
void ShuntShiftGen_turnOff( void );

//*****************************************************************************
/// \brief Быстрое отключение генератора при коротком замыкании рабочих цепей.
/// 
void ShuntShiftGen_fastTurnOff( void );

//*****************************************************************************
/// \brief  Получить состояние работы генератора.
/// \retval true  - 3-фазный генератор включен;
/// \retval false - 3-фазный генератор выключен.
///
bool ShuntShiftGen_isOn( void );

//*****************************************************************************
/// \brief Получение уровня генератора.
/// 
uint8_t ShuntShiftGen_getLevel( void );

//*****************************************************************************
/// \brief Включение генератора.
/// \param dir   - направление вращения;
/// \param freq  - частота генератора;
/// \param value - выходное напряжение генератора.
///
void ShuntShiftGen_turnOn( bool dir, Freq freq, uint8_t value );

//*****************************************************************************
/// \brief Установить параметры сигнала (частота и уровень).
/// \param freq  - частота сигнала;
/// \param value - выходное напряжение генератора.
///
void ShuntShiftGen_setParam( Freq freq, uint8_t value );

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   30-01-2018
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
