/**
* \file    shuntShiftGen.c
* \brief   \copybrief shuntShiftGen.h
*
* \version 1.0.1
* \date    30-01-2018
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>
#include "ShuntShiftGen.h"
#include "shuntShiftGenDrv.h"
#include "typeMK.h"
#include "asserts_ex.h"
#include "ProtectionState_codes.h"

//*****************************************************************************
// Локальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
/// \brief Значение PTPER для 28 кГц ШИМ генератора.
///
#define PWM_PERIOD_SHUNT_SHIFT_GEN               4208U   

//*****************************************************************************
/// \brief Размерность таблицы сигнала.  
///
#define NUM_POINTS_OF_SIN_TABLE  sizeof( ShuntShiftGen_sinTable ) / sizeof( ShuntShiftGen_sinTable[0] )    

//*****************************************************************************
/// \brief Минимальное значение длительности ШИМ.
///
#define MIN_PWM_DUTY_VALUE       0    

//*****************************************************************************
/// \brief Максимальное значение длительности ШИМ (PWM_PERIOD_SHUNT_SHIFT_GEN * 0.85).
///
#define MAX_PWM_DUTY_VALUE       PWM_PERIOD_SHUNT_SHIFT_GEN 

//*****************************************************************************
/// \brief Время выхода от средней точки до 0 при останове генератора, мс.
///
#define TIMEOUT_TO_STOP_GEN      50U  

//*****************************************************************************
/// \brief "Середина" сигнала в единицах длительности ШИМа.
///
#define MIDDLE_PWM_DUTY_VALUE    ( MIN_PWM_DUTY_VALUE + MAX_PWM_DUTY_VALUE ) / 2 

//*****************************************************************************
/// \brief Шаг приращения длительности ШИМ при выходе в среднюю точку с нуля.
///
#define STEP_TO_MIDDLE_POINT     MIDDLE_PWM_DUTY_VALUE / TIMEOUT_TO_START_GEN 

//*****************************************************************************
/// \brief Шаг приращения длительности ШИМ при выходе в нуль со средней точки.
///
#define STEP_FROM_MIDDLE_POINT   MIDDLE_PWM_DUTY_VALUE / TIMEOUT_TO_STOP_GEN

//*****************************************************************************
/// \brief Размах шкалы сигнала (100 процентов).
///
#define MAX_SCALE_VALUE          100U

//*****************************************************************************
/// \brief Вращения электромагнитного поля по часовой стрелке.
///
#define CLOCK_WISE               0

//*****************************************************************************
// Объявление типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Структура флагов.
///
typedef struct
{
    uint8_t ctrl          :1;             ///< Включение модуля.
    uint8_t interruptCtrl :1;             ///< Разрешение прерываний.
    uint8_t unused        :6;             ///< Неиспользуемые биты.
} ShuntShiftGen_flags;

//*****************************************************************************
/// \brief Объединение флагов состояния с \a uint8_t.
///
typedef union
{
    ShuntShiftGen_flags str;                ///< Флаги состояния.
    uint8_t             data;               ///< Данные флага состояния. 
} uShuntShiftGen_flags;

//*****************************************************************************
/// \brief Идентификаторы значений автомата состояний функции #ShuntShiftGen_run.
///
typedef enum
{
    eSwitchedOff      = 0,    ///< выключен
    eWaitingForStart,         ///< ожидание включения (выхода на среднюю точку от 0)
    eSwitchedOn,              ///< включен
    eWaitingForStop           ///< ожидание остановки (выхода к 0 от средней точки)
} ShuntShiftGen_states;

//*****************************************************************************
// Объявление локальных типизированных констант
//*****************************************************************************

//*****************************************************************************
/// \brief Таблица синусоидального сигнала с 3-ей гармоникой.
///
const int16_t ShuntShiftGen_sinTable[] =
{
    0, 71, 143, 214, 285, 425, 495, 564, 631, 699, 765, 830, 894, 956, 1018, 1078, 1136, 1193, 1249, 1303, 1355,
    1406, 1455, 1502, 1547, 1591, 1632, 1672, 1710, 1746, 1780, 1812, 1842, 1871, 1897, 1922, 1945, 1966,  1985,
    2003, 2019, 2033, 2046, 2058, 2068, 2076, 2083, 2089, 2094, 2098, 2100, 2102, 2103, 2103, 2102, 2100,  2098,
    2095, 2092, 2088, 2084, 2080, 2076, 2071, 2067, 2062, 2058, 2053, 2049, 2045, 2041, 2038, 2034, 2032,  2029,
    2027, 2025, 2024, 2024, 2023, 2024, 2024, 2025, 2027, 2029, 2032, 2034, 2038, 2041, 2045, 2049, 2053,  2058,
    2062, 2067, 2071, 2076, 2080, 2084, 2088, 2092, 2095, 2098, 2100, 2102, 2103, 2103, 2102, 2100, 2098,  2094,
    2089, 2083, 2076, 2068, 2058, 2046, 2033, 2019, 2003, 1985, 1966, 1945, 1922, 1897, 1871, 1842, 1812,  1780,
    1746, 1710, 1672, 1632, 1591, 1547, 1502, 1455, 1406, 1355, 1303, 1249, 1193, 1136, 1078, 1018,  956,   894,
     830, 765, 699, 631, 564, 495, 425, 355, 285, 214, 143, 71, 0, -71, -143, -214, -285, -355,    -425,   -495,
    -564, -631, -699, -765, -830, -894, -956, -1018, -1078, -1136, -1193,   -1249,  -1303, -1355,  -1406, -1455,
    -1502, -1547, -1591, -1632, -1672, -1710, -1746, -1780, -1812, -1842, -1871,   -1897,  -1922,  -1945, -1966,
    -1985, -2003, -2019, -2033, -2046, -2058, -2068, -2076, -2083, -2089, -2094,   -2098,  -2100,  -2102, -2103,
    -2103, -2102, -2100, -2098, -2095, -2092, -2088, -2084, -2080, -2076, -2071,   -2067,  -2062,  -2058, -2053,
    -2049, -2045, -2041, -2038, -2034, -2032, -2029, -2027, -2025, -2024, -2024,   -2023,  -2024,  -2024, -2025,
    -2027, -2029, -2032, -2034, -2038, -2041, -2045, -2049, -2053, -2058, -2062,   -2067,  -2071,  -2076, -2080,
    -2084, -2088, -2092, -2095, -2098, -2100, -2102, -2103, -2103, -2102, -2100,   -2098,  -2094,  -2089, -2083,
    -2076, -2068, -2058, -2046, -2033, -2019, -2003, -1985, -1966, -1945, -1922,   -1897,  -1871,  -1842, -1812,
    -1780, -1746, -1710, -1672, -1632, -1591, -1547, -1502, -1455, -1406, -1355,   -1303,  -1249,  -1193, -1136,
    -1078, -1018, -956, -894, -830, -765, -699, -631, -564, -495,  -425,  -355,    -285,   -214,   -143,  -71
};

//*****************************************************************************
/// \brief Максимумы сигнала (в единицах уровня) для каждой частоты.
///
const uint8_t ShuntShiftGen_maxLevel[QUANTITY_OF_FREQ_SINUS] =
{
    MAX_LEVEL_FOR_16HZ,
    MAX_LEVEL_FOR_25HZ,
    MAX_LEVEL_FOR_50HZ
};

//*****************************************************************************
/// \brief Минимумы сигнала (в единицах уровня) для каждой частоты.
///
const uint8_t ShuntShiftGen_minLevel[QUANTITY_OF_FREQ_SINUS] =
{
    MIN_LEVEL_FOR_16HZ,
    MIN_LEVEL_FOR_25HZ,
    MIN_LEVEL_FOR_50HZ
};

//*****************************************************************************
// Объявление локальных переменных
//*****************************************************************************

//*****************************************************************************
/// \brief Номера отсчётов таблицы значений ШИМ для каждой фазы.
///
static volatile uint16_t sinCnt[NUMBER_OF_PHASES] =
{
    0, 0, 0
};

//*****************************************************************************
static uShuntShiftGen_flags flags;    ///< Флаги состояния.

//*****************************************************************************
/// \brief Уровень выхода генератора 0...85.
/// \note 0 - выключен, 85 - максимальный сигнал
///
static uint8_t level = 0;

//*****************************************************************************                     
static ShuntShiftGen_states stepCnt = eSwitchedOff;    ///< Значение автомата состояний #ShuntShiftGen_states.
static Freq frequency;                                 ///< Значения частот генератора.
static Freq repeat_duty = eFreq50hz;                   ///< Пропуск точек таблицы для разных частот.
static bool direction = CLOCK_WISE;                    ///< Направление вращение двигателя.

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация генератора
void ShuntShiftGen_ctor( void )
{
    ShuntShiftGenDrv_init( );
    flags.data = 0;         // Запрет работы генератора в основном цикле и в прерывании
    level = 0;              // Установить начальный уровень = 0
    stepCnt = eSwitchedOff; // Начальная инициализация автомата состояний в положении выкл
}

//*****************************************************************************
// Управление работой генератора
void ShuntShiftGen_run( void )
{
    static uint16_t cnt; // Счётчик  выхода на среднюю точку от нуля и возврата к 0 от средней точки 
    int16_t valueArr[NUMBER_OF_PHASES]; // Массив значений длительности для всех фаз
    uint8_t i;

    switch( stepCnt )
    {
        case eSwitchedOff: //Ожидание включения
            if( !flags.str.ctrl ) 
                break;
            cnt = 0;
            for( i = 0; i < NUMBER_OF_PHASES; i++ ) valueArr[i] = 0;
            ShuntShiftGenDrv_on( PWM_PERIOD_SHUNT_SHIFT_GEN, valueArr ); //инициализация модуля PWM начальными значениями
            stepCnt = eWaitingForStart;
            break;

        case eWaitingForStart: //Выход с нуля в среднюю точку, переход в рабочее состояние 
            cnt += STEP_TO_MIDDLE_POINT;
            if( cnt < MIDDLE_PWM_DUTY_VALUE )
            {
                for( i = 0; i < NUMBER_OF_PHASES; i++ ) valueArr[i] = cnt;
                ShuntShiftGenDrv_setValues( valueArr );
            }
            else
            {
                //Заполнение массива отсчётов с учётом направления вращения(т.е сдвига фаз)
                sinCnt[0] = direction ? 0 : ( NUM_POINTS_OF_SIN_TABLE - 1 ) / NUMBER_OF_PHASES * 2;
                sinCnt[1] = ( NUM_POINTS_OF_SIN_TABLE - 1 ) / NUMBER_OF_PHASES;
                sinCnt[2] = direction ? ( NUM_POINTS_OF_SIN_TABLE - 1 ) / NUMBER_OF_PHASES * 2 : 0;
                flags.str.interruptCtrl = true;
                stepCnt = eSwitchedOn;
            }
            break;
        case eSwitchedOn: //Ожидание выключения
            if( !flags.str.ctrl )
            {
                cnt = MIDDLE_PWM_DUTY_VALUE;
                flags.str.interruptCtrl = false;
                stepCnt = eWaitingForStop;
            }
            break;
        case eWaitingForStop: //Возврат к нулю из средней точки
            if( cnt > STEP_FROM_MIDDLE_POINT )
            {
                cnt -= STEP_FROM_MIDDLE_POINT;
                for( i = 0; i < NUMBER_OF_PHASES; i++ ) valueArr[i] = cnt;
                ShuntShiftGenDrv_setValues( valueArr );
            }
            else
            {
                //Отключение ШИМ, назначение выводов как IO Ports
                ShuntShiftGenDrv_off( );
                stepCnt = eSwitchedOff;
            }
            break;

        default:
            ERROR_ID( eGrPS_ShuntShift, ePS_ShuntShiftGenStepCntErr );
            stepCnt = 0;
    }
}

//*****************************************************************************
// Управление работой 3-фазного генератора в прерывании
void ShuntShiftGen_interrupt( void )
{
    int16_t valueArr[NUMBER_OF_PHASES];
    uint8_t i;

    if( !flags.str.interruptCtrl ) return;

    //Определение текущих значений ШИМ для всех фаз PDC = Table * level / 100
    for( i = 0; i < NUMBER_OF_PHASES; i++ )
    {
        valueArr[i] = MIDDLE_PWM_DUTY_VALUE +
                __builtin_divsd( __builtin_mulsu( ShuntShiftGen_sinTable[sinCnt[i]], level ), MAX_SCALE_VALUE );
    }
    // Установка текущих значений длительности ШИМ
    //Реализован повтор значений таблицы в зависимости от частоты
    //50 Гц - длительность заполняется каждое прерывание
    //25 Гц - длительность заполняется через прерывание
    //16 Гц - длительность заполняется через 2 прерывания
    if( ShuntShiftGenDrv_setValues( valueArr ) )
    {
        if( repeat_duty > frequency ) repeat_duty--;
        else
        {
            repeat_duty = eFreq50hz;
            for( i = 0; i < NUMBER_OF_PHASES; i++ )
            {
                if( ++sinCnt[i] >= NUM_POINTS_OF_SIN_TABLE ) sinCnt[i] = 0;
            }
        }
    }
}

//*****************************************************************************
// Включение генератора
void ShuntShiftGen_turnOn( bool dir, Freq freq, uint8_t value )
{
    direction = dir;
    ShuntShiftGen_setParam( freq, value );
    flags.str.ctrl = true; //Включить
}

//*****************************************************************************
// Установить параметры сигнала (частота и уровень)
void ShuntShiftGen_setParam( Freq freq, uint8_t value )
{
    frequency = freq;
    if( value > ShuntShiftGen_maxLevel[frequency] ) //Ограничение по максимуму сигнала
        level = ShuntShiftGen_maxLevel[frequency];
    else if( value < ShuntShiftGen_minLevel[frequency] ) //Ограничение по минимуму сигнала
        level = ShuntShiftGen_minLevel[frequency];
    else
        level = value;
}

//*****************************************************************************
// Отключение генератора
void ShuntShiftGen_turnOff( void )
{
    flags.str.ctrl = false;
}

//*****************************************************************************
// Быстрое отключение генератора при КЗ
void ShuntShiftGen_fastTurnOff( void )
{
    flags.str.ctrl = false;
    flags.str.interruptCtrl = false;
    stepCnt = eSwitchedOff;
    ShuntShiftGenDrv_off( );
}

//*****************************************************************************
// Получение уровня генератора
uint8_t ShuntShiftGen_getLevel( void )
{
    return level;
}

//*****************************************************************************
// Получить состояние работы генератора
bool ShuntShiftGen_isOn( void )
{
    return stepCnt != eSwitchedOff;
}

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   30-01-2018
* Автор  Кругликов В.П.
* 
* Изменения:
*    Базовая версия.
*/
