/**
* \file    OverloadDet.h
* \brief   Модуль определения перегрузок по току
* \details Интерфейс
*
* \version 1.0.1
* \date    26-04-2018
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef OVERLOADDET_H
#define OVERLOADDET_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>

//*****************************************************************************
/// \brief Инициализация компонента OverloadDet.h.
///
void OverloadDet_ctor( void );

//*****************************************************************************
/// \brief Управление работой компонента OverloadDet.h.
/// \note Вызывается из главного цикла с периодом 1 мс.
///
void OverloadDet_run( void );

//*****************************************************************************
/// \brief Проверка наличия короткого замыкания в цепях 3-фазного генератора.
/// \retval true  - короткое замыкание есть;
/// \retval false - короткого замыканиян нет.
///
bool OverloadDet_isScThreePhaseGen( void );

//*****************************************************************************
/// \brief Проверка флага КЗ, который идёт в поле статуса при обмене с УС.
/// \retval true - флаг установлен;
/// \retval false - флаг установлен.
///
bool OverloadDet_getScThreePhaseGenTrig( void );

//*****************************************************************************
/// \brief Проверка наличия контрольного замыкания в цепях контрольного генератора.
/// \retval true  - короткое замыкание есть;
/// \retval false - короткого замыканиян нет.
///
bool OverloadDet_isScContrGen( void );

//*****************************************************************************
/// \brief Проверка наличия срабатывания триггера КЗ в цепях контрольного генератора.
/// \retval true - флаг установлен;
/// \retval false - флаг установлен.
///
bool OverloadDet_getScContrGenTrig( void );

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   26-04-2018
* Автор  Кругликов В.П.
* 
* Изменения:
*    Базовая версия.
*/
