/**
* \file    deviceAddress.h
* \brief   Определение адреса и конфигурации прибора
* \details Интерфейс
*
* \version 1.0.1
* \date    27-03-2017
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef DEVICEADDRESS_H
#define DEVICEADDRESS_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>
#include <stdbool.h>

//*****************************************************************************
// Определение типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Возможные типы УС.
///
typedef enum DeviceAddress_sysType_tag 
{
    eEbilock = 0,        ///< МПЦ Ebilock950
    eStrela              ///< МПЦ Стрела 10
} DeviceAddress_sysType;

//*****************************************************************************
/// \brief Тип модуля реле.
///
typedef enum RelayModuleType_tag 
{
    eSevenWire   = 0,        ///< 7-ми проводная
    eFiveWireEc,             ///< 5-ЭЦ
    eNineWire,               ///< 9-ти проводная
    eReserve,                ///< резерв
    eFiveWire,               ///< 5-ти проводная
} RelayModuleType;

//*****************************************************************************
/// \brief Тип электродвигателя.
///
typedef enum MotorType_tag 
{
    eMct025_127v  = 0,        ///< МСТ–0,25 с напряжением 127 В
    eMct025_220v,             ///< МСТ–0,25 с напряжением 220 В
    eMct03_110v,              ///< МСТ–0,3 с напряжением 110 В
    eMct03_190v,              ///< МСТ–0,3 с напряжением 190 В
    eMct06_110v,              ///< МСТ–0,6 с напряжением 110 В
    eMct06_190v,              ///< МСТ–0,6 с напряжением 190 В
    eMotorTypeNum             ///< общее количество типов двигателей
} MotorType;

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация и запуск модуля.
///
void DeviceAddress_ctor( void );

//*****************************************************************************
/// \brief Управление работой.
/// \note Вызывается из главного цикла с периодом 1 мс.
///
void DeviceAddress_run( void );

//*****************************************************************************
/// \brief Получает адрес прибора.
/// \return Значение 16-битного адреса прибора.
///
uint16_t DeviceAddress_getAddress( void );

//*****************************************************************************
/// \brief Получает статус прибора.
/// \retval true  - основной;
/// \retval false - резервный.
///
bool DeviceAddress_isPrimary( void );

//*****************************************************************************
/// \brief Получает тип УС.
/// \return Тип УС.
///
DeviceAddress_sysType DeviceAddress_getSysType( void );

//*****************************************************************************
/// \brief Получает флаг корректности адреса.
/// \retval true  - данные корректны;
/// \retval false - данные некорректны.
///
bool DeviceAddress_isValid( void );

//*****************************************************************************
/// \brief Получает тип модуля реле.
/// \return Тип модуля реле.
///
RelayModuleType DeviceAddress_getRelayModuleType( void );

//*****************************************************************************
/// \brief Получает тип электродвигателя.
/// \return Тип электродвигателя.
///
MotorType DeviceAddress_getMotorType( void );

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   27-03-2017
* Автор  Кругликов В.П.
*
* Изменения:
*    Базовая версия.
*/
