/**
* \file    relayCtrl.h
* \brief   Управление реле и контроль состояния контактов РПВ
* \details Интерфейс
*
* \version 1.0.1
* \date    22-05-2017
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef RELAYCTRL_H
#define RELAYCTRL_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>
#include <stdint.h>
#include "DeviceAddress.h"
#include "positionDet.h"
#include "shuntShift.h"

//*****************************************************************************
// Определение типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Состояния неисправности реле РПВ.
///
typedef enum 
{
    eNormal     = 0,        ///< нормальное состояние
    eNotTurnOn,             ///< не включается
    eNotTurnOff             ///< не выключается
} RelayCtrl_RpvState;

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация и запуск.
/// \param relayType - тип модуля реле.
///
void RelayCtrl_ctor( RelayModuleType relayType );

//*****************************************************************************
/// \brief Управление работой.
/// \note Вызывается из главного цикла с периодом 1 мс.
///
void RelayCtrl_run( void );

//*****************************************************************************
/// \brief Установить направление перевода стрелки.
/// \param shift - направление перевода.
///
void RelayCtrl_setShiftDir( ShiftDirection shift );

//*****************************************************************************
/// \brief Установить контроль положения.
/// \param pos - контролируемое положение.
///
void RelayCtrl_setPosDet( PositionDet_State pos );

//*****************************************************************************
/// \brief Получает установленное направление перевода .
/// \return Направление перевода.
///
ShiftDirection RelayCtrl_getShiftDir( void );

//*****************************************************************************
/// \brief  Получает контролируемое положение.
/// \return Контролируемое положение.
///
PositionDet_State RelayCtrl_getPosDet( void );

//*****************************************************************************
/// \brief Включение/выключение реле РПВ.
/// \param state - требуемое положение реле РПВ (true (включено), false (выключено)).
///
void RelayCtrl_switchRpv( bool state );

//*****************************************************************************
/// \brief Получает состояние исправности реле РПВ.
/// \return Состояние реле РПВ.
///
RelayCtrl_RpvState RelayCtrl_getRpvState( void );


#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   22-05-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
