/**
* \file    relayCtrlTypes.h
* \brief   Прототипы функций управления и контроля модуля реле.
*
* \version 1.0.1
* \date    12-12-2017
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef RELAYCTRLTYPES_H
#define RELAYCTRLTYPES_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "relayCtrl.h"

//*****************************************************************************
// Объявление типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Прототип функций инициализации.
/// 
typedef void( *pfRelCtrlCtor )( void );

//*****************************************************************************
/// \brief Прототип функций контроля работы.
/// 
typedef void( *pfRelCtrlRun )( void );

//*****************************************************************************
/// \brief Прототип функций установки направления перевода.
///
typedef void( *pfRelCtrlSetShiftDir )( ShiftDirection shift );

//*****************************************************************************
/// \brief Прототип функций установки контроля положения.
///
typedef void( *pfRelCtrlSetPosDet )( PositionDet_State pos );

//*****************************************************************************
/// \brief Прототип функций возвращения результата завершения установки.
/// 
typedef bool( *pfRelCtrlIsSwitched )( void );

//*****************************************************************************
/// \brief Прототип функций возвращения состояния направления перевода.
/// 
typedef ShiftDirection( *pfRelCtrlGetShiftDir )( void );

//*****************************************************************************
/// \brief Прототип функций возвращения состояния контроля положения.
///
typedef PositionDet_State( *pfRelCtrlGetPosDet )( void );

//*****************************************************************************
/// \brief Структура внутреннего интерфейса модуля.
///
typedef struct ArrayRelayCtrl_tag 
{
    pfRelCtrlCtor        ctor;               ///< Инициализация.
    pfRelCtrlRun         run;                ///< Управление работой.
    pfRelCtrlSetShiftDir setShiftDir;        ///< Установить направление перевода.
    pfRelCtrlSetPosDet   setPosDet;          ///< Установить контроль положения.
    pfRelCtrlIsSwitched  isSwitched;         ///< Получает завершение установки.
    pfRelCtrlGetShiftDir getShiftDir;        ///< Получает установленное направление перевода.
    pfRelCtrlGetPosDet   getPosDet;          ///< Получает контролируемое положение.
} ArrayRelayCtrl;

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   12-12-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
