/**
* \file    relayCtrlNineWire.h
* \brief   Управление модулем реле 9-ти проводным
* \details Интерфейс
*
* \version 1.0.1
* \date    12-12-2017
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef RELAYCTRLNINEWIRE_H
#define RELAYCTRLNINEWIRE_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "relayCtrlTypes.h"

//*****************************************************************************
// Определение глобальных типизированных констант
//*****************************************************************************
extern const ArrayRelayCtrl nineWireRelCtrl;        // Переменная структуры интерфейса.

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация.
/// 
void NineWireRelCtrl_ctor( void );

//*****************************************************************************
/// \brief Управление работой.
/// \note Вызывается из главного цикла с периодом 1 мс.
///
void NineWireRelCtrl_run( void );

//*****************************************************************************
/// \brief Установить направление перевода.
/// \param shift - направление перевода.
///
void NineWireRelCtrl_setShiftDir( ShiftDirection shift );

//*****************************************************************************
/// \brief Установить контроль положения.
/// \param pos - контролируемое положение.
///
void NineWireRelCtrl_setPosDet( PositionDet_State pos );

//*****************************************************************************
/// \brief Получает завершение установки.
/// \retval true - установка завершена;
/// \retval false - установка не завершена.
///
bool NineWireRelCtrl_isSwitched( void );

//*****************************************************************************
/// \brief Получает установленное направление перевода.
/// \return Направление перевода.
///
ShiftDirection NineWireRelCtrl_getShiftDir( void );

//*****************************************************************************
/// \brief Получает контролируемое положение.
/// \return Контролируемое положение.
///
PositionDet_State NineWireRelCtrl_getPosDet( void );

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   12-12-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
