/**
* \file    relayCtrl.c
* \brief   \copybrief relayCtrl.h
*
* \version 1.0.1
* \date    22-05-2017
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "relayCtrl.h"
#include "relayCtrlDrv.h"
#include "relayCtrlFiveEC.h"
#include "relayCtrlNineWire.h"
#include "BinIn.h"
#include "CheckSupply.h"
#include "ProtectionState_codes.h"
#include "asserts_ex.h"
#include "ActivityManager_dataTypes.h"
#include "CheckCallFunctions.h"

//*****************************************************************************
// Локальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
/// \brief Разница между временем управления и временем контроля.
///
#define CTRL_DIFFERENCE    10U

//*****************************************************************************
#define SWITCH_ON_TO  ( T_O_RELAY_OPERATE - CTRL_DIFFERENCE )        ///< Время включения реле, мс.
#define SWITCH_OFF_TO ( T_O_RELAY_RELEASE - CTRL_DIFFERENCE )        ///< Время отключения реле, мс.
#define RPV_FAULT_TO  5000U                                          ///< Время неисправности реле.

//*****************************************************************************
// Объявление типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Структура состояния.
///
typedef struct
{
    uint8_t ctrl    :1;        ///< Включение модуля.
    uint8_t rpvCtrl :1;        ///< Управление реле РПВ.
    uint8_t unused  :6;        ///< Неиспользуемые биты.
} RelayCtrl_flags;

//*****************************************************************************
/// \brief Объединение флагов состояния с \a uint8_t.
///
typedef union
{
    RelayCtrl_flags str;         ///< Флаги состояния.
    uint8_t         data;        ///< Данные флага состояния.
} uRelayCtrl_flags;

//*****************************************************************************
/// \brief Состояние реле РПВ.
///
typedef enum
{
    eCheckOff = 0,        ///< состояние реле выключено
    eCheckOn              ///< состояние реле включено
} CheckRpvState;

//*****************************************************************************
// Объявление локальных типизированных констант
//*****************************************************************************
static const ArrayRelayCtrl *ptrRelCtrl;        ///< Указатель на переменную структуры интерфейса.

//*****************************************************************************
// Объявление локальных переменных
//*****************************************************************************
static uRelayCtrl_flags   flags;                   ///< Флаги состояния.
static RelayCtrl_RpvState rpvState;                ///< Состояние неисправности реле РПВ.
static uint16_t           switch220vCnt;           ///< Счетчик времени переключения питания 220 В.
static CheckRpvState      stateCnt;                ///< Счетчик состояния.
static uint8_t            switchTimeoutCnt;        ///< Счетчик тайм-аута переключения, мс.
static uint16_t           faultTimeoutCnt;         ///< Счетчик тайм-аута неисправности, мс.

//*****************************************************************************
// Прототипы локальных функций
//*****************************************************************************

//*****************************************************************************
void checkRpv( void );        ///< Проверка реле РПВ.

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация и запуск.
void RelayCtrl_ctor( RelayModuleType relayType )
{
    RelayCtrlDrv_ctor( ); // Обесточить все драйверы 
    switch( relayType )
    {
        case eFiveWireEc:
            ptrRelCtrl = &fiveWireECRelCtrl;
            break;
        case eNineWire:
            ptrRelCtrl = &nineWireRelCtrl;
            break;
        default:
            ERROR_ID( eGrPS_RelayCtrl, ePS_RelayCtrlStepCnt1error );
    }
    ptrRelCtrl->ctor( ); //Инициализировать соответствующий модуль реле

    flags.data = 0;     // Обнулить флаги состояния
    switch220vCnt = 0;  // Обнулить счетчик времени переключения питания 220 В
    flags.str.ctrl = 1; // Включить модуль
}

//*****************************************************************************
// Управление работой
void RelayCtrl_run( void )
{
    if( flags.str.ctrl == 0 ) return; // Модуль не включен

    if( switch220vCnt ) switch220vCnt--; // Декремент счетчика времени переключения питания 220 В
    ptrRelCtrl->run( ); // Управление соответствующим модулем
      // Проверка состояния контактов реле РПВ
    if( DeviceAddress_isPrimary( ) && // Основной прибор
        CheckSupply_is24vOn( ) )
    { // Питание 24 В в норме
        checkRpv( );
    }
    RelayCtrlDrv_switchTermoShunt( CheckSupply_is220vOn( ) );
    MARKED_CALL_FUNCTION;
}

//*****************************************************************************
// Установить направление перевода.
void RelayCtrl_setShiftDir( ShiftDirection shift )
{
    ptrRelCtrl->setShiftDir( shift );
}

//*****************************************************************************
// Установить контроль положения.
void RelayCtrl_setPosDet( PositionDet_State pos )
{
    ptrRelCtrl->setPosDet( pos );
}


//*****************************************************************************
// Получает установленное направление перевода.
ShiftDirection RelayCtrl_getShiftDir( void )
{
    return ptrRelCtrl->getShiftDir( );
}

//*****************************************************************************
// Получает контролируемое положение.
PositionDet_State RelayCtrl_getPosDet( void )
{
    return ptrRelCtrl->getPosDet( );
}

//*****************************************************************************
// Включение/выключение реле РПВ
void RelayCtrl_switchRpv( bool state )
{
    RelayCtrlDrv_switchRpv( state );
    flags.str.rpvCtrl = state;
}

//*****************************************************************************
// Получает состояние исправности реле РПВ
RelayCtrl_RpvState RelayCtrl_getRpvState( void )
{
    return rpvState;
}

//*****************************************************************************
// Реализация локальных функций
//*****************************************************************************

//*****************************************************************************
// Проверка реле РПВ.
void checkRpv( void )
{

    //Декремент счетчика тайм-аута неисправности
    if( faultTimeoutCnt != 0 )
    {
        faultTimeoutCnt--;
        return;
    }
    else rpvState = eNormal; //Тайм-аут неисправности истек
    //Декремент счетчика тайм-аута переключения
    if( switchTimeoutCnt != 0 ) switchTimeoutCnt--;
    switch( stateCnt )
    {
        case eCheckOff: //Выключено
            if( flags.str.rpvCtrl )
            { //Включили
                switchTimeoutCnt = SWITCH_ON_TO; //Взвести тайм-аут включения
                stateCnt = eCheckOn;
                break;
            }
            if( switchTimeoutCnt ) break; //Тайм-аут выключения не истек
            //Проверка разомкнутых выходных контактов
            if( BinIn_isRpvOnMe( ) )
            { //Ошибка, контакты замкнуты
                rpvState = eNotTurnOff; //Контакты не размыкаются
                faultTimeoutCnt = RPV_FAULT_TO; //Установить тайм-аут неисправности
                break;
            }
            break;
        case eCheckOn: //Включено
            if( flags.str.rpvCtrl == 0 )
            { //Выключили
                switchTimeoutCnt = SWITCH_OFF_TO; //Взвести тайм-аут выключения
                stateCnt = eCheckOff;
                break;
            }
            if( switchTimeoutCnt ) break; //Тайм-аут включения не истек
            //Проверка замкнутых выходных контактов
            if( !BinIn_isRpvOnMe( ) )
            { //Ошибка, контакты разомкнуты
                rpvState = eNotTurnOn; //Контакты не замыкаются
                faultTimeoutCnt = RPV_FAULT_TO; //Установить тайм-аут неисправности
                break;
            }
            break;
        default:
            ERROR_ID( eGrPS_RelayCtrl, ePS_RelayCtrlStepCnt2error );
    }
}

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   22-05-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
