/**
* \file    relayCtrlNineWire.c
* \brief   \copybrief relayCtrlNineWire.h
*
* \version 1.0.1
* \date    12-12-2017
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "relayCtrlNineWire.h"

//*****************************************************************************
// Объявление локальных типизированных констант
//*****************************************************************************

//*****************************************************************************
/// \brief Переменная структуры интерфейса.
///
const ArrayRelayCtrl nineWireRelCtrl =
{
    NineWireRelCtrl_ctor,
    NineWireRelCtrl_run,
    NineWireRelCtrl_setShiftDir,
    NineWireRelCtrl_setPosDet,
    NineWireRelCtrl_isSwitched,
    NineWireRelCtrl_getShiftDir,
    NineWireRelCtrl_getPosDet
};

//*****************************************************************************
// Объявление локальных переменных
//*****************************************************************************
static          ShiftDirection    direct;           ///< Направление перевода.
static          PositionDet_State position;         ///< Контроль положения.
static uint16_t                   switchCnt;        ///< Счетчик времени переключения. 

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация  
void NineWireRelCtrl_ctor( void )
{
    switchCnt = 0; // Сбросить счетчик переключения
    direct = eShiftStop; // Направление перевода - останов
    position = eDetNon; // Контроль положения - отключено
}

//*****************************************************************************
// Управление работой
void NineWireRelCtrl_run( void )
{

}

//*****************************************************************************
// Установить направление перевода
void NineWireRelCtrl_setShiftDir( ShiftDirection shift )
{
    direct = shift;
}

//*****************************************************************************
// Установить контроль положения
void NineWireRelCtrl_setPosDet( PositionDet_State pos )
{
    position = pos;
}

//*****************************************************************************
// Получает завершение установки
bool NineWireRelCtrl_isSwitched( void )
{
    return switchCnt == 0;
}

//*****************************************************************************
// Получает установленное направление перевода
ShiftDirection NineWireRelCtrl_getShiftDir( void )
{
    return direct;
}

//*****************************************************************************
// Получает контролируемое положение
PositionDet_State NineWireRelCtrl_getPosDet( void )
{
    return position;
}

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   12-12-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
