/**
* \file    relayCtrlFiveEC.h
* \brief   Управление модулем реле 5-ЭЦ
* \details Интерфейс
*
* \version 1.0.1
* \date    12-12-2017
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef RELAYCTRLFIVEEC_H
#define RELAYCTRLFIVEEC_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "relayCtrlTypes.h"

//*****************************************************************************
// Определение глобальных переменных 
//*****************************************************************************
extern const ArrayRelayCtrl fiveWireECRelCtrl;        // Переменная структуры интерфейса

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация.
/// 
void FiveWireECRelCtrl_ctor( void );

//*****************************************************************************
/// \brief Управление работой.
/// \note Вызывается из главного цикла с периодом 1 мс.
///
void FiveWireECRelCtrl_run( void );

//*****************************************************************************
/// \brief Установить направление перевода.
/// \param shift - направление перевода.
///
void FiveWireECRelCtrl_setShiftDir( ShiftDirection shift );

//*****************************************************************************
/// \brief Установить контроль положения.
/// \param pos - контролируемое положение.
///
void FiveWireECRelCtrl_setPosDet( PositionDet_State pos );

//*****************************************************************************
/// \brief Получает завершение установки.
/// \retval true  - установка завершена;
/// \retval false - установка не завершена.
///
bool FiveWireECRelCtrl_isSwitched( void );

//*****************************************************************************
/// \brief Получает установленное направление перевода.
/// \return Направление перевода.
///
ShiftDirection FiveWireECRelCtrl_getShiftDir( void );

//*****************************************************************************
/// \brief Получает контролируемое положение.
/// \return Контролируемое положение.
///
PositionDet_State FiveWireECRelCtrl_getPosDet( void );

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   12-12-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
