/**
* \file    HystFltr.c
* \brief   \copybrief HystFltr.h
*
* \version 1.0.1
* \date    11-04-2017
* \author  Байдаченко В.В.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "HystFltr.h"

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация фильтруемой цифровой линии в начальное состояние
void HystFltr_ctor( digInpHystFilt_type *h, uint16_t enHyst, uint16_t disHyst )
{
    h->inPrv   = false;
    h->inCnt   = 0;
    h->enHyst  = enHyst;
    h->disHyst = disHyst;
}

//*****************************************************************************
// Фильтрация цифрового сигнала
bool HystFltr_run( digInpHystFilt_type *h, bool inAct )
{
    //Check input
    if( inAct != h->inPrv )
    {
        h->inCnt++;
        //Hysteresis implementation
        if( ( ( inAct == true ) && ( h->inCnt > h->enHyst ) ) || ( ( inAct == false ) && ( h->inCnt > h->disHyst ) ) )
        {
            h->inPrv = inAct;
            h->inCnt = 0;
        }
    }
    else
    {
        h->inCnt = 0;
    }
    return h->inPrv;
}

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   11-04-2017
* Автор  Байдаченко В.В.
*
* Изменения:
*    Базовая редакция.
*/
