/**
* \file    HystFltr.h
* \brief   Фильтрация цифровых входов с гистерезисом
* \details Интерфейс
*
* \version 1.0.1
* \date    11-04-2017
* \author  Байдаченко В.В.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef HYSTFILTR_H
#define HYSTFILTR_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>
#include <stdbool.h>

//*****************************************************************************
// Определение типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Структура объекта фильтруемой цифровой линии.
///
typedef struct 
{
    uint16_t inCnt;          ///< Счетчик нового состояния.
    uint16_t enHyst;         ///< Порог гистерезиса на включение.
    uint16_t disHyst;        ///< Порог гистерезиса на выключение.
    bool     inPrv;          ///< Состояние входа при предыдущем измерении.
} digInpHystFilt_type;

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация фильтруемой цифровой линии в начальное состояние.
/// \param h - указатель на объект фильтруемой линии;
/// \param enHyst - порог гистерезиса на включение;
/// \param disHyst - порог гистерезиса на выключение.
///
void HystFltr_ctor( digInpHystFilt_type *h, uint16_t enHyst, uint16_t disHyst );

//*****************************************************************************
/// \brief Фильтрация цифрового сигнала.
/// \param h - указатель на объект фильтруемой линии;
/// \param inAct - актуальное состояние линии.
/// \return Фильтрованное состояние линии.
///
bool HystFltr_run( digInpHystFilt_type *h, bool inAct );

#endif

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   11-04-2017
* Автор  Байдаченко В.В.
*
* Изменения:
*    Базовая редакция.
*/
