/**
* \file    Sheduler.c
* \brief   \copybrief Sheduler.h
*
* \version 1.0.1
* \date    28-09-2017
* \author  Мирошниченко А.А.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "States.h"

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация планировщика
void Sheduler_ctor( void )
{
    Fsm_start( &StateTop );
}

//*****************************************************************************
// Работа планировщика
void Sheduler_run( void )
{
    Fsm_run( &StateTop );
}

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   28-09-2017
* Автор  Мирошниченко А.А.
*
* Изменения:
*    Базовая редакция.
*/
