/**
* \file    Sheduler.h
* \brief   Планировщик заданий
* \details Интерфейс
*
* \version 1.0.1
* \date    28-09-2017
* \author  Мирошниченко А.А.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef SHEDULER_H
#define SHEDULER_H

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация планировщика.
///
void Sheduler_ctor( void );

//*****************************************************************************
/// \brief Работа планировщика.
///
void Sheduler_run( void );

#endif

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   28-09-2017
* Автор  Мирошниченко А.А.
*
* Изменения:
*    Базовая редакция.
*/
