/**
* \file    StateWorking.c
* \brief   Рабочее состояние.
*
* \version 1.0.1
* \date    28-09-2017
* \author  Мирошниченко А.А.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "Main.h"
#include "States.h"

//*****************************************************************************
// Объявление локальных переменных
//*****************************************************************************

//*****************************************************************************
static Fsm StateWorking_fsm;        ///< Дочерние состояния для рабочего состояния.

//*****************************************************************************
// Прототипы локальных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Обработка входа в рабочее состояние.
///
static void StateWorking_onEntry( void );

//*****************************************************************************
/// \brief Обработка выхода из рабочего состояния.
///
static void StateWorking_onExit( void );

//*****************************************************************************
/// \brief Обработка рабочего состояния.
///
static bool StateWorking_onRun( void );

//*****************************************************************************
// Реализация локальных функций
//*****************************************************************************

//*****************************************************************************
// Обработка входа в рабочее состояние
static void StateWorking_onEntry( void )
{
    ActivityManager_setState( activityManager, true );
}

//*****************************************************************************
// Обработка выхода из рабочего состояния
static void StateWorking_onExit( void )
{
    ActivityManager_setState( activityManager, false );
}

//*****************************************************************************
// Обработка рабочего состояния
static bool StateWorking_onRun( void )
{
    return true;
}

//*****************************************************************************
// Объявление локальных типизированных констант
//*****************************************************************************

//*****************************************************************************
/// \brief Определение константы состояния автомата "Рабочее состояние".
///
const FsmState StateWorking =
{
    StateWorking_onEntry, StateWorking_onExit, StateWorking_onRun,
    &StateTop, &StateMain, &StateWorking_fsm, &StatePassive, eStateWorkingId
};

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   28-09-2017
* Автор  Мирошниченко А.А.
*
* Изменения:
*    Базовая редакция.
*/
