/**
* \file    StatePassive.c
* \brief   Пассивное состояние.
*
* \version 1.0.1
* \date    28-09-2017
* \author  Мирошниченко А.А.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "Main.h"
#include "ControlSystem.h"
#include "States.h"

//*****************************************************************************
// Прототипы локальных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Обработка входа в пассивное состояние.
///
static void StatePassive_onEntry( void );

//*****************************************************************************
/// \brief Обработка выхода из пассивного состояния.
///
static void StatePassive_onExit( void );

//*****************************************************************************
/// \brief Обработка пассивного состояния.
/// \note При получении активности происходит переход в активное состояние.
/// \note При невыполнении условий рабочего режима происходит переход в безопасное пассивное состояние.
///
static bool StatePassive_onRun( void );

//*****************************************************************************
// Реализация локальных функций
//*****************************************************************************

//*****************************************************************************
// Обработка входа в пассивное состояние
static void StatePassive_onEntry( void )
{

}

//*****************************************************************************
// Обработка выхода из пассивного состояния
static void StatePassive_onExit( void )
{

}

//*****************************************************************************
// Обработка пассивного состояния
static bool StatePassive_onRun( void )
{

    if( ActivityManager_isActive( activityManager ) )
    {
        Fsm_transit( &StateActive );
        return false;
    }
    if( !ControlSystem_workCondition( ) )
    {
        Fsm_transit( &StateSafePassive );
        return false;
    }

    return true;
}

//*****************************************************************************
// Определение локальных типизированных констант
//*****************************************************************************

//*****************************************************************************
/// \brief Определение константы состояния автомата "Пассивное состояние".
///
const FsmState StatePassive =
{
    StatePassive_onEntry, StatePassive_onExit, StatePassive_onRun,
    &StateTop, &StateWorking, 0, 0
};

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   28-09-2017
* Автор  Мирошниченко А.А.
*
* Изменения:
*    Базовая редакция.
*/
