/**
* \file    StateInitial.c
* \brief   Состояние инициализации.
*
* \version 1.0.1
* \date    28-09-2017
* \author  Мирошниченко А.А., Кругликов В.П.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "Main.h"
#include "States.h"
#include "DebugTools.h"
#include "DeviceAddress.h"
#include "relayCtrl.h"
#include "relayCtrlDrv.h"  // !!!временно

//*****************************************************************************
// Прототипы локальных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Обработка входа в состояние инициализации.
/// \note По входу выполняется включение индикации состояния инициализации.
///
static void StateInitial_onEntry( void );

//*****************************************************************************
/// \brief Обработка выхода из состояния инициализации.
/// \note По входу выполняется выключение всех индикаторов.
///
static void StateInitial_onExit( void );

//*****************************************************************************
/// \brief Обработка событий и проверка переходов для состояния инициализации.
/// \note Если установлен корректный адрес устройства, происходит переход в состояние основной работы.
/// \note Если адрес не удается считать более #TIME_INIT_ADDRESS мс, включается индикация некорректного
/// состояния перемычек адреса до тех пор, пока прибор не будет переведен в ЗС.
///
static bool StateInitial_onRun( void );

//*****************************************************************************
// Реализация локальных функций
//*****************************************************************************

//*****************************************************************************
// Обработка входа в состояние инициализации
static void StateInitial_onEntry( void )
{
    Indication_on( &ledRs1 );
    Indication_on( &ledRs2 );
    Indication_on( &ledPlusPos );
    Indication_on( &ledMinusPos );
    Indication_on( &ledLossCtrl );
}

//*****************************************************************************
// Обработка выхода из состояния инициализации
static void StateInitial_onExit( void )
{
    Indication_off( &ledRs1 );
    Indication_off( &ledRs2 );
    Indication_off( &ledPlusPos );
    Indication_off( &ledMinusPos );
    Indication_off( &ledLossCtrl );
}

//*****************************************************************************
// Обработка событий и проверка переходов для состояния инициализации
static bool StateInitial_onRun( void )
{
    static uint16_t timeCounter = TIME_INIT_ADDRESS; // Установка таймаута ожидания корректного адреса
    static bool notCorrect = false;

    if( timeCounter ) 
        timeCounter--; // Декремент счетчика времени
    if( DeviceAddress_isValid( ) )
    { // Получен корректный адрес
        // Реле не включены
        RelayCtrl_ctor( DeviceAddress_getRelayModuleType( ) ); // debug после отладки включить весь блок
        // Корректный адрес получен, реле переключились
        Fsm_transit( &StateMain ); // Переход в StateMain
        return false;
    }
    else
    { // Корректный адрес еще не получен
        if( timeCounter == 0 && !notCorrect )
        { //Таймаут завершился
            notCorrect = true;
            // Включение индикации отсутствия корректного адреса
            Indication_blink( &ledRs1, LED_INCORRECT_ADDRESS_BLINK_ON, LED_INCORRECT_ADDRESS_BLINK_OFF, eIndPhNormal ); 
            Indication_blink( &ledRs2, LED_INCORRECT_ADDRESS_BLINK_ON, LED_INCORRECT_ADDRESS_BLINK_OFF, eIndPhInvert );
            Indication_off( &ledPlusPos );
            Indication_off( &ledMinusPos );
            Indication_off( &ledLossCtrl );
        }
    }
    return true;
}

//*****************************************************************************
// Объявление локальных типизированных констант
//*****************************************************************************

//*****************************************************************************
/// \brief Определение константы состояния автомата "Состояние инициализации".
///
const FsmState StateInitial =
{
    StateInitial_onEntry, StateInitial_onExit, StateInitial_onRun,
    &StateTop, &StateTop, 0, 0, eStateInitialId
};

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   28-09-2017
* Автор  Мирошниченко А.А., Кругликов В.П.
*
* Изменения:
*    Базовая редакция.
*/
