/**
* \file    States.h
* \brief   Объявления состояний ДКА.
*
* \version 1.0.1
* \date    28-09-2017
* \author  Мирошниченко А.А.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef STATES_H
#define STATES_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "Fsm.h"

//*****************************************************************************
// Определение глобальных типизированных констант
//*****************************************************************************

//*****************************************************************************
extern const FsmState StateTop,                // Корневое состояние ДКА.
                      StateInitial,            // Состояние инициализации.
                      StateMain,               // Состояние основной работы.
                      StateSafePassive,        // Безопасное пассивное состояние.
                      StateSafeActive,         // Безопасное активное состояние.
                      StateWorking,            // Рабочее состояние.
                      StatePassive,            // Пассивное состояние.
                      StateActive;             // Активное состояние.

#endif

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   28-09-2017
* Автор  Мирошниченко А.А.
*
* Изменения:
*    Базовая редакция.
*/
