/**
* \file    StateSafeActive.c
* \brief   Безопасное активное состояние.
*
* \version 1.0.1
* \date    28-09-2017
* \author  Мирошниченко А.А.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "Main.h"
#include "ControlSystem.h"
#include "States.h"

//*****************************************************************************
// Прототипы локальных функций
//*****************************************************************************    

//*****************************************************************************
/// \brief Обработка безопасного активного состояния.
/// \note При потере активности происходит переход в безопасное пассивное состояние.
/// \note При выполнении условий рабочего режима происходит переход в рабочее активное состояние.
///
static bool StateSafeActive_onRun( void );

//*****************************************************************************
// Реализация локальных функций
//*****************************************************************************

//*****************************************************************************
// Обработка безопасного активного состояния
static bool StateSafeActive_onRun( void )
{
    if( !ActivityManager_isActive( activityManager ) )
    {
        Fsm_transit( &StateSafePassive );
        return false;
    }
    if( ControlSystem_workCondition( ) )
    {
        Fsm_transit( &StateActive );
        return false;
    }

    return true;
}

//*****************************************************************************
// Определение локальных типизированных констант
//*****************************************************************************

//*****************************************************************************
/// \brief Определение константы состояния автомата "Безопасное активное состояние".
///
const FsmState StateSafeActive =
{
    0, 0, StateSafeActive_onRun,
    &StateTop, &StateMain, 0, 0, eStateSafeActiveId
};

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   28-09-2017
* Автор  Мирошниченко А.А.
*
* Изменения:
*    Базовая редакция.
*/
