/**
* \file    StateSafePassive.c
* \brief   Безопасное пассивное состояние.
*
* \version 1.0.1
* \date    28-09-2017
* \author  Мирошниченко А.А.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "Main.h"
#include "ControlSystem.h"
#include "States.h"

//*****************************************************************************
// Прототипы локальных функций
//***************************************************************************** 

//***************************************************************************** 
/// \brief Обработка безопасного пассивного состояния.
/// \note При получении активности происходит переход в безопасное активное состояние.
/// \note При выполнении условий рабочего режима происходит переход в рабочее пассивное состояние.
///
static bool StateSafePassive_onRun( void );

//*****************************************************************************
// Реализация локальных функций
//*****************************************************************************

//*****************************************************************************
// Обработка безопасного пассивного состояния
static bool StateSafePassive_onRun( void )
{
    if( ActivityManager_isActive( activityManager ) )
    {
        Fsm_transit( &StateSafeActive );
        return false;
    }
    if( ControlSystem_workCondition( ) )
    {
        Fsm_transit( &StatePassive );
        return false;
    }
    return true;
}

//*****************************************************************************
// Объявление локальных типизированных констант
//*****************************************************************************

//*****************************************************************************
/// \brief Определение константы состояния автомата "Безопасное пассивное состояние".
///
const FsmState StateSafePassive =
{
    0, 0, StateSafePassive_onRun,
    &StateTop, &StateMain, 0, 0, eStateSafePassiveId
};

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   28-09-2017
* Автор  Мирошниченко А.А.
*
* Изменения:
*    Базовая редакция.
*/
