/**
* \file    StateActive.c
* \brief   Активное состояние.
*
* \version 1.0.1
* \date    28-09-2017
* \author  Мирошниченко А.А.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "Main.h"
#include "States.h"
#include "ControlSystem.h"

//*****************************************************************************
// Прототипы локальных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Обработка входа в активное состояние.
///
static void StateActive_onEntry( void );

//*****************************************************************************
/// \brief Обработка выхода из активного состояния.
///
static void StateActive_onExit( void );

//*****************************************************************************
/// \brief Обработка активного состояния.
/// \note При потере активности происходит переход в пассивное состояние.
/// \note При невыполнении условий рабочего режима происходит переход в безопасное активное состояние.
///
static bool StateActive_onRun( void );

//*****************************************************************************
// Реализация локальных функций
//*****************************************************************************

//*****************************************************************************
// Обработка входа в активное состояние
static void StateActive_onEntry( void )
{
    //Разрешить работу генератора
}

//*****************************************************************************
// Обработка выхода из активного состояния
static void StateActive_onExit( void )
{
    //Запретить работу генератора
}

//*****************************************************************************
// Обработка активного состояния
static bool StateActive_onRun( void )
{
    if( !ActivityManager_isActive( activityManager ) )
    {
        Fsm_transit( &StatePassive );
        return false;
    }
    if( !ControlSystem_workCondition( ) )
    {
        Fsm_transit( &StateSafeActive );
        return false;
    }
    return true;
}

//*****************************************************************************
// Объявление локальных типизированных констант
//*****************************************************************************

//*****************************************************************************
/// \brief Определение константы состояния автомата "Активное состояние".
///
const FsmState StateActive =
{
    StateActive_onEntry, StateActive_onExit, StateActive_onRun,
    &StateTop, &StateWorking, 0, 0, eStateWorkingActiveId
};

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   28-09-2017
* Автор  Мирошниченко А.А.
*
* Изменения:
*    Базовая редакция.
*/
