/**
* \file    StateTop.c
* \brief   Корневое состояние ДКА.
*
* \version 1.0.1
* \date    28-09-2017
* \author  Мирошниченко А.А.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "InterChannel.h"
#include "Eeprom.h"
#include "Main.h"
#include "BinIn.h"
#include "DeviceAddress.h"
#include "States.h"
#include "CheckSupply.h"
#include "AnalogMeasurement.h"
#include "OverloadDet.h"
#include "ControlMK.h"
#include "asserts_ex.h"
#include "CheckCallFunctions.h"

//*****************************************************************************
// Объявление локальных переменных
//*****************************************************************************

//*****************************************************************************
static Fsm fsm;        ///< Дочерние состояния для корневого состояния ДКА.

//*****************************************************************************
// Прототипы локальных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Обработка корневого состояния ДКА.
/// \note Вызываются методы \a run для всех компонентов, не требующих дополнительной инициализации
/// в основном цикле работы с периодом 1 мс.
///
static bool StateTop_onRun( void );

//*****************************************************************************
// Реализация локальных функций
//*****************************************************************************

//*****************************************************************************
// Обработка корневого состояния ДКА.
static bool StateTop_onRun( void )
{
    ControlMK_run( );
    InterChannel_run( );
    Rs422_run( rs422 );
    AnalogMeasurement_run( );
    Eeprom_run( );
    BinIn_run( );
    DeviceAddress_run( );
    Indication_run( &ledRs1 );
    Indication_run( &ledRs2 );
    Indication_run( &ledPlusPos );
    Indication_run( &ledMinusPos );
    Indication_run( &ledLossCtrl );
    CheckSupply_run( );
    OverloadDet_run( );
    return true;
}

//*****************************************************************************
// Объявление локальных типизированных констант
//*****************************************************************************

//*****************************************************************************
/// \brief Определение константы состояния автомата "Корневое состояние ДКА".
///
const FsmState StateTop =
{
    0, 0, StateTop_onRun, &StateTop, 0, &fsm, &StateInitial, eStateTopId
};

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   28-09-2017
* Автор  Мирошниченко А.А.
*
* Изменения:
*    Базовая редакция.
*/
