/**
* \file    crc16_version.h
* \brief   Подсчет CRC16 для сообщения о номере версии и даты сборки ПО
* \details Интерфейс
*
* \version 1.0.1
* \date    05-03-2021
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef CRC16_VERSION_H
#define CRC16_VERSION_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Подсчет \a CRC.
/// \param buf     – указатель на массив данных;
/// \param size   – длина в байтах массива данных.
/// \return \a CRC массива данных
uint16_t crc16_version( uint8_t * buf, uint16_t len );

#endif

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Дата   05-03-2021
* Автор  Третьяков В.Ж.
* 
* Изменения:
*    Базовая версия.
*/
