/**
* \file    MessageVersion.h
* \brief   Формирование сообщения о версии и дате ЗМ, о заводском номере прибора.
* \details Интерфейс
* 
* \version 1.0.1
* \date    05-03-2021
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef MESSAGEVERSION_H
#define MESSAGEVERSION_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Формирование сообщения о версии и дате.
/// 
void MessageVersion_ctor( void );

//*****************************************************************************
/// \brief Получить текущий байт сообщения о версии и дате ЗМ, о заводском номере прибора.
/// 
uint8_t MessageVersion_get( void );

#endif

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   05-03-2021
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
