/**
* \file    Rs422_crc8.h
* \brief   Вычисление контрольной суммы принятого пакета данных.
* \details Интерфейс
*
* \version 1.0.1
* \date    11-05-2018
* \author  Агулов М.А.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef RS422_CRC8_H
#define RS422_CRC8_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Вычисление контрольной суммы.
/// \param crc  - начальное значение CRC8;
/// \param data - указатель на массив данных;
/// \param len  - длина массива данных.
/// \return Значение контрольной суммы.
/// \note В качестве алгоритма вычисления контрольной суммы
/// используется CRC8, с начальным значением crc и полиномом \f$x^8 + x^7 + x^2 + 1\f$.
///
uint8_t crc8_update( uint8_t crc, const uint8_t *data, uint8_t len );

#endif 

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   11-05-2018
* Автор  Агулов М.А.
* 
* Изменения:
*     Базовая версия.
*/
