/**
* \file    Rs422_lineExch.h
* \brief   Организация обмена по линии RS-422
* \details Интерфейс
*
* \version 1.0.1
* \date    22-05-2017
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef RS422_LINEEXCH_H
#define RS422_LINEEXCH_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "Rs422_dataTypes.h"

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
// Определение тайм-аутов
#define TIME_OUT_1TELE           48        ///< Время передачи 1-ой телеграммы - 3 мс.  
#define TIME_OUT_2TELE           69        ///< Время передачи 2-ой телеграммы - 4,2 мс.
#define TIME_OUT_RESET_SYNC      20        ///< Время ожидания начальной синхронизации, мс. 
#define TIME_OUT_SYNC_TELE       3         ///< Время синхронизации принятой телеграммы, мс.
#define TIME_OUT_TR_CONTR_MASTER 5         ///< Время контроля передачи телеграммы для Master, мс.
#define TIME_OUT_TR_CONTR_SLAVE  7         ///< Время контроля передачи телеграммы для Slave, мс.
#define TIME_OUT_SYNC_FINISH     5         ///< Время ожидания завершающей синхронизации, мс.

//*****************************************************************************
/// \brief Время контроля передачи после приема короткой телеграммы для Master, мс.
///
#define TIME_OUT_TR_CONTR_SHORT_MASTER 7 

//*****************************************************************************
/// \brief Время контроля передачи после приема короткой телеграммы для Slave, мс.
///
#define TIME_OUT_TR_CONTR_SHORT_SLAVE  10

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация параметров линий связи RS-422.
/// \param lineStr - указатель на структуру, описывающую состояние параметров линии.
///
void Rs422_lineCtor( CommunicationRS422 *lineStr );

//*****************************************************************************
/// \brief Управление приемом и передачей телеграмм по линии связи RS-422.
/// \param lineStr  - указатель на структуру, описывающую состояние параметров линии;
/// \param totalStr - указатель на структуру, описывающую общие параметры.
/// \note Вызывается с периодом 1 мс.
///
void Rs422_lineRun( CommunicationRS422 *lineStr, StateRS422 *totalStr );

//*****************************************************************************
/// \brief  Прием и передача данных по линии связи RS-422.
/// \param lineStr  - указатель на структуру, описывающую состояние параметров линии;
/// \note Вызывается из прерывания с периодом 62,5 мкс.
///
void Rs422_lineInterrupt( CommunicationRS422 *lineStr );

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   22-05-2017
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
