/**
* \file    Eeprom.c
* \brief   \copybrief Eeprom.h
*
* \version 2.0.1
* \date    08-01-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "EepromDrv.h"
#include "Eeprom.h"
#include "CheckCallFunctions.h"

//*****************************************************************************
// Объявление типов данных
//*****************************************************************************

//*****************************************************************************
extern struct EepromDrvTag eepromDrv;        // Объекты работы с \a EEPROM

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация модуля EEPROM
void Eeprom_ctor( void )
{
    EepromDrv_ctor( &eepromDrv, eEeExist, eI2C_module1,
                    eEeProtectionWaite, eProcSyncEqual, eICId_Eeprom );
}

//*****************************************************************************
// Рабочий цикл работы с \a EEPROM
void Eeprom_run( void )
{
    EepromDrv_run( &eepromDrv );
    MARKED_CALL_FUNCTION;
}

//*****************************************************************************
// Запись в \a EEPROM 16-битного значения
void Eeprom_write( uint16_t addressCell, uint16_t data )
{
    EepromDrv_write( &eepromDrv, addressCell, data );
}

//*****************************************************************************
// Запись в \a EEPROM 16-битного значения
void Eeprom_write_start( uint16_t addressCell, uint16_t data )
{
    EepromDrv_write_start( &eepromDrv, addressCell, data );
}


//*****************************************************************************
// Чтение из \a EEPROM 16-битного значения
uint16_t Eeprom_read( uint16_t addressCell )
{
    return EepromDrv_read( &eepromDrv, addressCell );
}

//*****************************************************************************
// Готовность \a EEPROM к чтению или записи данных, предыдущая операция завершена
bool Eeprom_isReady( void )
{
    return EepromDrv_isReady( &eepromDrv );
}

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   15-12-2016
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая редакция.
* 
* Версия 2.0.1
* Дата   08-01-2017
* Автор  Третьяков В.Ж.
* 
* Изменения:
*    Изменения под новую схему на dsPIC33.
*/
