/**
* \file    Eeprom.h
* \brief   Работа с внешним EEPROM 
* \details Интерфейс
*
* \version 2.0.1
* \date    10-02-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef EEPROM_H
#define EEPROM_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>
#include <stdbool.h>

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
#define SIZE_EEDATA 4096            ///< Размер области памяти \a EEPROM в байтах.

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация модуля EEPROM.
///
void Eeprom_ctor( void );

//*****************************************************************************
/// \brief Рабочий цикл работы с \a EEPROM.
///
void Eeprom_run( void );

//*****************************************************************************
/// \brief Чтение из \a EEPROM 16-битного значения.
/// \param addressCell – адрес ячейки \a EEPROM.
/// \return Прочитанное значение.
///
uint16_t Eeprom_read( uint16_t addressCell );

//*****************************************************************************
/// \brief Запись в ячейку \a EEPROM 16-битного значения.
/// \param addressCell – адрес ячейки \a EEPROM;
/// \param data – значение для записи.
///
void Eeprom_write( uint16_t addressCell, uint16_t data );

//*****************************************************************************
/// \brief Готовность \a EEPROM к чтению или записи данных. 
/// \details Предыдущая операция завершена.
/// \retval true  - устройство готово;
/// \retval false - устройство не готово.
///
bool Eeprom_isReady( void );

#endif 

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая редакция.
* 
* Версия 2.0.1
* Дата   10-02-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Изменения под новую схему на dsPIC33.
*/
