/**
* \file    CheckSupply.c
* \brief   \copybrief CheckSupply.h
*
* \version 1.0.2
* \date    11-09-2018
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "CheckSupply.h"
#include "HystFltr.h"
#include "BinIn.h"
#include "CheckCallFunctions.h"

//*****************************************************************************
// Локальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
/// \brief Задержка определения состояния напряжения питания 220 В по его включению, мс.
///
#define SUPPLY_220V_EN  600 


//*****************************************************************************
/// \brief Задержка определения состояния напряжения питания 220 В по его выключению, мс.
///
#define SUPPLY_220V_DIS 10


//*****************************************************************************
/// \brief Задержка определения состояния напряжения питания 24 В по его включению, мс.
///
#define SUPPLY_24V_EN   500

//*****************************************************************************
/// \brief Задержка определения состояния напряжения питания 24 В по его выключению, мс.
///
#define SUPPLY_24V_DIS  250

//*****************************************************************************
//  Объявление типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Флаги модуля.
///
typedef struct
{
    uint8_t ctrl       :1;        ///< Включение модуля.
    uint8_t supply220v :1;        ///< Состояние напряжения питания 220 В.
    uint8_t supply24v  :1;        ///< Состояние напряжения питания 24 В.
    uint8_t unused     :5;        ///< Неиспользуемые.
} CheckSupply_flags;

//*****************************************************************************
/// \brief Объединение флагов с \a uint8_t.
///
typedef union
{
    CheckSupply_flags str;         ///< Флаги модуля.
    uint8_t           data;        ///< Данные флага.
} uCheckSupply_flags;

//*****************************************************************************
// Объявление локальных переменных
//*****************************************************************************

//*****************************************************************************
digInpHystFilt_type checkSupply_220v;        ///< Фильтр с гистерезисом состояния питания 220 В.
digInpHystFilt_type checkSupply_24v;         ///< Фильтр с гистерезисом состояния питания 24 В.
uCheckSupply_flags  flags;                   ///< Флаги модуля.

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация и запуск
void CheckSupply_ctor( void )
{
    //Инициализация фильтра с гистерезисом для напряжения питания 220 В
    HystFltr_ctor( &checkSupply_220v, SUPPLY_220V_EN, SUPPLY_220V_DIS );
    //Инициализация фильтра с гистерезисом для напряжения питания 24 В 
    HystFltr_ctor( &checkSupply_24v, SUPPLY_24V_EN, SUPPLY_24V_DIS );
    flags.data = 0;        // Инициализация флагов
    flags.str.ctrl = true; // Включение модуля
}

//*****************************************************************************
// Управление работой
void CheckSupply_run( void )
{
    if( flags.str.ctrl )
    {
        //Запись состояния фильтра для питания 220 В
        flags.str.supply220v = HystFltr_run( &checkSupply_220v, BinIn_is220vOk( ) );
        //Запись состояния фильтра для питания 24 В
        flags.str.supply24v = HystFltr_run( &checkSupply_24v, BinIn_is24vOk( ) );
    }
    MARKED_CALL_FUNCTION;
}

//*****************************************************************************
// Возвращает состояние напряжения питания 220 В
bool CheckSupply_is220vOn( void )
{
    return flags.str.supply220v;
}

//*****************************************************************************
// Возвращает состояние питания 24 В
bool CheckSupply_is24vOn( void )
{
    return flags.str.supply24v;
}

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   11-05-2018
* Автор  Агулов М.А.
* 
* Изменения:
*     Базовая версия.
* 
* Версия 1.0.2
* Дата   11-09-2018
* Автор  Кругликов В.П.
* 
* Изменения:
*     Удалены функции    
*     CheckSupply_isInst220vOn( )
*     CheckSupply_isInst24vOn( )
*/
