/**
* \file    CheckSupply.h
* \brief   Проверка состояния внешних источников питания 
* \details Интерфейс
*
* \version 1.0.1
* \date    11-05-2018
* \author  Агулов М.А.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef CHECKSUPPLY_H
#define CHECKSUPPLY_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация и запуск.
///
void CheckSupply_ctor( void );

//*****************************************************************************
/// \brief Управление работой.
/// \note Вызывается из главного цикла с периодом 1 мс.
///
void CheckSupply_run( void );

//*****************************************************************************
/// \brief Возвращает состояние питания 220 В.
/// \retval true  - норма;
/// \retval false - авария.
///
bool CheckSupply_is220vOn( void );

//*****************************************************************************
/// \brief Возвращает состояние питания 24 В.
/// \retval true  - норма;
/// \retval false - авария.
///
bool CheckSupply_is24vOn( void );

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   11-05-2018
* Автор  Агулов М.А.
* 
* Изменения:
*     Базовая версия.
*/
