/**
* \file    LedFailure.c
* \brief   \copybrief LedFailure.h
*
* \version 1.0.1
* \date    20-03-2018
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "typeMK.h"
#include "ConfigMK.h"
#include "LedFailure.h"
    
//*****************************************************************************
// Прототипы локальных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Проверка времени для перехода к следующей фазе индикации.
/// \param time - время, до которого считает счётчик;
/// \param counter - указатель на счётчик времени;
/// \param stateDK - состояние светодиода "Отказ" (включен или выключен).
///
static bool checkTime( const uint16_t time, uint16_t* counter, const bool stateDK );

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация управления светодиодом "Отказ" (исходное состояние - выключен)
void LedFailure_ctor( void )
{
    _LATB12  = 1;
    _TRISB12 = 0;
}

//*****************************************************************************
// Установка состояния светодиода "Отказ"
void LedFailure_set( bool state )
{
    _TRISB12 = state;
    if( !state ) _LATB12 = 1;
}

//*****************************************************************************
static bool checkTime( const uint16_t time, uint16_t* counter, const bool stateDK )
{
    LedFailure_set( stateDK );
    if( (*counter)++ >=  time )
    {
        *counter = 0;
        return true;
    }
    else 
        return false;
}

//*****************************************************************************
// Мигание светодиодом "Отказ".
void LedFailure_blink( const uint16_t timeOn, const uint16_t timeOff )
{
    
    typedef enum 
    {
        eOn,
        eOff
    } PhaseInd;

    static PhaseInd phaseInd = eOn;
    static uint16_t cnt;
    
    switch( phaseInd )
    {
        case eOn:  
            if( checkTime( timeOn, &cnt, true ) )
                phaseInd = eOff;
                break;
        case eOff:  
            if( checkTime( timeOff, &cnt, false ) )
                phaseInd = eOn;
            break; 
    }
}

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   20-03-2018
* Автор  Кругликов В.П.
*
* Изменения:
*    Базовая редакция.
*/
