/**
* \file    LedFailure.h
* \brief   Управление светодиодом "Отказ"
* \details Интерфейс
*
* \version 1.0.1
* \date    17-11-2016
* \author  Мирошниченко А.А.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef LEDFAILURE_H
#define LEDFAILURE_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация управления светодиодом "Отказ".
///
void LedFailure_ctor( void );

//*****************************************************************************
/// \brief Установка состояния светодиода "Отказ".
/// \param state - состояние работы светодиода (true (включен), false (выключен)).
///
void LedFailure_set( bool state );

//*****************************************************************************
/// \brief Мигание светодиодом "Отказ".
/// \param timeOn - время, в течение которого индикатор включен, в мс;
/// \param timeOff - время, в течение которого индикатор выключен, в мс.
///
void LedFailure_blink( const uint16_t timeOn, const uint16_t timeOff );

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   17-11-2016
* Автор  Мирошниченко А.А.
*
* Изменения:
*    Базовая редакция.
*/
