/**
* \file    AnalogInputId.h
* \brief   Идентификаторы входных аналоговых сигналов.
*
* \version 1.0.1
* \date    05-10-2018
* \author  Агулов М.А.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef ANALOGINPUTID_H
#define ANALOGINPUTID_H

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

////*****************************************************************************
#define AVERAGE_WINDOW_SIZE     128        ///< Количество отсчетов для расчёта среднеквадратического значения.
#define AnalogInputDrvQueueSize 3          ///< Размер очереди отсчетов с АЦП.

//*****************************************************************************
/// \brief Список аналоговых параметров.
///
typedef enum AnalogInputChannels_tag
{
    eAinchKREF = 0,      ///< половина опорного напряжения соседнего контроллера
    eAinchK3V3 = 1,      ///< половина напряжения питания соседнего контроллера
    eAinchREF  = 2,      ///< напряжение тестирования АЦП
    eAinchGEN  = 3,      ///< напряжение контрольного генератора
    eAinchR1   = 4,      ///< напряжение датчика положения стрелки R1
    eAinchR2   = 5,      ///< напряжение датчика положения стрелки R2
    eAinchIV   = 6,      ///< ток двигателя, фаза V
    eAinchIU   = 7,      ///< ток двигателя, фаза U
    eAinchIW   = 8,      ///< ток двигателя, фаза W
    eAinchUV   = 9,      ///< напряжение фазы V
    eAinchUU   = 10,     ///< напряжение фазы U
    eAinchUW   = 11,     ///< напряжение фазы W
    eAinChCount          ///< количество входных аналоговых сигналов
} AnalogInputChannels;

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   05-10-2018
* Автор  Агулов М.А.
*
* Изменения:
*    Базовая версия.
*/
