/**
* \file    asserts.c
* \brief   \copybrief asserts.h
* \details Обработка исключений, возникших при проведении проверки 
*          управляемых утверждений (assert).
*
* \version 1.0.1
* \date    14-03-2016
* \author  Годунок А.Н.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "asserts.h"
#include "ModeProtection.h"
#include "BlackBox.h"

//*****************************************************************************
// Локальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
///// \brief Получить код отказа, используя тип отказа и идентификатор.
/////
//#define SET_CODE_ID( group_, id_ )   ( ( ( group_ ) << 8 ) + ( ( id_ ) & 0x00FF ) )             

//*****************************************************************************
///// \brief Получить тип отказа, используя код отказа.
///// \param code_ - код отказа.
///// \return Тип отказа.
/////
//#define GET_GROUP_FROM_CODE( code_ ) ( ( ( code_ ) >> 8 ) & 0x00FF )

#ifndef DEBUG_EXCEPTION            // Вызов функции перехода в ЗС

//*****************************************************************************
// Прототипы локальных функций
//*****************************************************************************

//*****************************************************************************
// Обработка исключений
void sysAssertException( char const * const file,
                         int16_t line,
                         int16_t group,
                         int16_t id )
{
    BlackBox_saveASSERT( file, line );
    ModeProtection_run( SET_CODE_ID( group, id ) );
}

#else          // вызов отладочной функции обработки исключений

    #include "unity.h"

    //******************************************************************************
    /// \brief Код отказа, который ожидается в системе. 
    /// \note При уходе в отказ с таким кодом тест не fail-ится.
    ///
    uint16_t exceptionExpectedErrorCode = 0;
    
    //******************************************************************************
    /// \brief Признак отказа с ожидаемым кодом. 
    /// \note При срабатывании отказа с кодом, отличным от ожидаемого, 
    /// флаг сбрасывается.
    ///
    bool exceptionErrorCodeIsExpected = false;
    
    //*****************************************************************************
    // Реализация локальных функций
    //*****************************************************************************
    
    //*****************************************************************************
    // Обработка исключений
    void sysAssertException( char const * const file,
                             int16_t line,
                             int16_t group,
                             int16_t id )
    {
        if( exceptionExpectedErrorCode != SET_CODE_ID( group, id ) )
        {
    
            exceptionErrorCodeIsExpected = false;
    
            char str[250];
    
            sprintf( str, "'ASSERT: %s, %i, type = %i, error = %i'", file, line, group, id );
    
            TEST_FAIL_MESSAGE( str );
    
        }
        else
        {
    
            exceptionErrorCodeIsExpected = true;
    
        }
    }
    
#endif

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Дата   14-03-2016
* Автор  Годунок А.Н.
* 
* Изменения:
*    Базовая версия.
*/
