/**
* \file    defCompil.h
* \brief   Определение условий компиляции.
*
* \version 1.0.1
* \date    13-01-2016
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef DEFCOMPIL_H
#define DEFCOMPIL_H

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
/// \brief Выдача содержимого \a EEPROM в \a CAN при инициализации.
///
#define DEBUG_BLACK_BOX_READ_INIC 

//*****************************************************************************
/// \brief Выдача содержимого \a EEPROM в \a CAN при переходе в ЗС.
///
#define DEBUG_BLACK_BOX_READ_PS    

//*****************************************************************************
//#define IGNORE_CONTROL_MK 
//#define IGNORE_PROTECTION_STATE
//#define IGNORE_CHECK_PROTECTION_STATE    ///< Отключить переход в ЗС (комментируется при компиляции на build-машине).
//#define IGNORE_TIME_BEGIN_SYNC           ///< Бесконечное ожидание нач. синхронизации для работы отладчика.
#define FLASH_CHECK_ENABLE                 ///< Разрешение проверки контрольной суммы ПЗУ 
#define INTERCHANNEL_DEBUG_MODE_ON     1                               ///< Включение отладочного режима.
#define INTERCHANNEL_DEBUG_MODE_OFF    0                               ///< Выключение отладочного режима.
#define INTERCHANNEL_DEBUG_MODE        INTERCHANNEL_DEBUG_MODE_ON      ///< Состояние отладочного режима.
//#define INTERCHANNEL_DEBUG_MODE      INTERCHANNEL_DEBUG_MODE_OFF     ///< Состояние отладочного режима.

//*****************************************************************************
/// \brief Индекс массива, в который пишутся траcсируемые параметры.
///
#define INTERCHANNEL_DEBUG_TRACING_ARRAY 6

//*****************************************************************************
#define INTERCHANNEL_DEBUG_TRACING_PARAM eICId_BinInPin         ///< Трассируемый параметр.

//*****************************************************************************
/// \brief Разрешение индикации КЗ миганием светодиода "Отказ".
///
#define IND_SHORT_CIRCUIT

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   13-01-2016
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
