/**
* \file    defCompil.h
* \brief   Определение условий компиляции.
*
* \version 1.0.3
* \date    15-03-2021
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef DEFCOMPIL_H
#define DEFCOMPIL_H

#include "InterChannelId.h"


//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
/// \brief Выдача содержимого \a EEPROM в \a CAN при инициализации.
///
#define DEBUG_BLACK_BOX_READ_INIC 

//*****************************************************************************
/// \brief Выдача содержимого \a EEPROM в \a CAN при переходе в ЗС.
///
#define DEBUG_BLACK_BOX_READ_PS    

//*****************************************************************************
//#define IGNORE_CONTROL_MK                     ///< Отключить проверку МК (для отладки)
//#define IGNORE_PROTECTION_STATE               ///< Отключить переход в 3С (для отладки)
//#define IGNORE_CHECK_PROTECTION_STATE         ///< Отключить переход в ЗС при запуске прибора (комментируется при компиляции на build-машине).
//#define IGNORE_TIME_BEGIN_SYNC                ///< Бесконечное ожидание начальной синхронизации (для нормальной работы отладчика)
#define IGNORE_CHECK_FLASH                    ///< Отключить проверку контрольной суммы FLASH-памяти (для отладки)

#define INTERCHANNEL_DEBUG_MODE_ON     1                               ///< Включение отладочного режима.
#define INTERCHANNEL_DEBUG_MODE_OFF    0                               ///< Выключение отладочного режима.
#define INTERCHANNEL_DEBUG_MODE        INTERCHANNEL_DEBUG_MODE_ON      ///< Состояние отладочного режима.
//#define INTERCHANNEL_DEBUG_MODE      INTERCHANNEL_DEBUG_MODE_OFF     ///< Состояние отладочного режима.

//*****************************************************************************
/// \brief Индекс массива, в который пишутся трассируемые параметры.
///
#define INTERCHANNEL_DEBUG_TRACING_ARRAY 6

//*****************************************************************************
#define INTERCHANNEL_DEBUG_TRACING_PARAM eICId_Rs422Sync_Rs1         ///< Трассируемый параметр.

//*****************************************************************************
/// \brief Разрешение индикации КЗ миганием светодиода "Отказ".
///
#define IND_SHORT_CIRCUIT


//*****************************************************************************
///// \brief Формировать в поле аларма номер версии и дату сборки ПО.
/////
#define RS422_ALARM_OUT_VERSION

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   13-01-2016
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
* 
* Версия 1.0.2
* Дата   15-03-2021
* Автор  Агулов М.А
*
* Изменения:
* 	Изменены макросы IGNORE_... для единообразного описания опций для отладки.
* 
* Версия 1.0.3
* Дата   15-03-2021
* Автор  Кругликов В.П.
* 
* Изменения:
* 	Добавлен RS422_ALARM_OUT_VERSION для реализации с передачей в поле аларма статуса номера версии и даты сборки ПО
*/
