/**
* \file    InterChannelId.h
* \brief   Идентификаторы параметров межпроцессорного обмена.
*
* \version 1.0.2
* \date    11-11-2019
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef INTERCHANNELID_H
#define INTERCHANNELID_H

//#define TECHNOLOGICAL_SOFTWARE

//*****************************************************************************
// Объявление типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Идентификаторы параметров, синхронизируемых МКО.
/// \details Данные идентификаторы являются системными параметрами, доступными для
/// всех модулей. В случае необходимости передачи нового параметра, его
/// идентификатор необходимо добавить в это перечисление. Добавлять этот
/// параметр необходимо до значения #eInterChannelIdCount.
/// \details Идентификатор параметра со значением больше чем значение
/// #eInterChannelIdCount будет считаться ошибочным и приведет к уходу в ЗС.
/// \details Параметры имеют приоритет при синхронизации с помощью системы
/// МКО. Максимальный приоритет имеет параметр со
/// значением #eInterChannelIdCount - 1, минимальный - со
/// значением #eInterChannelIdBegin + 1.
///

typedef enum
{
    //*****************************************************************************
    /// \brief идентификатор 1-го параметра (имя может быть переопределено)
    ///
    eInterChannelIdBegin = 0,
    /* 0x01 */ eICId_BlackBox,                      ///< данные черного ящика ( \a EEPROM)
    /* 0x02 */ eICId_ProtStateCode,                 ///< код ЗОт
    /* 0x03 */ eICId_IV_value,                      ///< мгновенное значение тока фазы V
    /* 0x04 */ eICId_IU_value,                      ///< мгновенное значение тока фазы U
    /* 0x05 */ eICId_IW_value,                      ///< мгновенное значение тока фазы W
    /* 0x06 */ eICId_Eeprom,                        ///< данные \a EEPROM
    /* 0x07 */ eICId_ControlMK,                     ///< обобщенные результаты проверок МК
    /* 0x08 */ eICId_ControlMK_Flash,               ///< текущая контрольная сумма ПЗУ
    /* 0x09 */ eICId_ControlMK_CF,                  ///< количество вызванных функций
    /* 0x0A */ eICId_U_GENrms,                      ///< выходное напряжение контрольного генератора (среднеквадратическое значение)
    /* 0x0B */ eICId_U_R1bias,                      ///< смещение напряжения датчика R1 контрольного сигнала
    /* 0x0C */ eICId_U_R1rms,                       ///< напряжение датчика R1 контрольного сигнала (среднеквадратическое значение)
    /* 0x0D */ eICId_U_R2bias,                      ///< смещение напряжения датчика R2 контрольного сигнала
    /* 0x0E */ eICId_U_R2rms,                       ///< напряжение датчика R2 контрольного сигнала (среднеквадратическое значение)
    /* 0x0F */ eICId_IV_rms,                        ///< среднеквадратическое значение тока фазы V
    /* 0x10 */ eICId_IU_rms,                        ///< среднеквадратическое значение тока фазы U
    /* 0x11 */ eICId_IW_rms,                        ///< среднеквадратическое значение тока фазы W 
    /* 0x12 */ eICId_BinInPin,                      ///< дискретные входы датчиков 24 В и 220 В, состояние реле РПВ
    /* 0x13 */ eICId_BinIn,                         ///< дискретные входы, считываемые через дешифратор 
    /* 0x14 */ eICId_BlockExchM,                    ///< межблочный обмен, контрольная сумма (свой МК)
    /* 0x15 */ eICId_BlockExchS,                    ///< межблочный обмен, контрольная сумма (соседний МК)
    /* 0x16 */ eICId_Rs422Sync_Rs1,                 ///< RS-422 синхронизация 1-ый канал
    /* 0x17 */ eICId_Rs422Sync_Rs2,                 ///< RS-422 синхронизация 2-ый канал
    /* 0x18 */ eICId_OverloadDetScContrGen,         ///< перегрузка в цепи контрольного генератора (выход логического датчика)
    /* 0x19 */ eICId_OverloadDetScThreePhaseGen,    ///< перегрузка в цепях управления двигателем (выход логического датчика) 
    /* 0x1A */ eICId_IntegrCtrlScAndBreak,          ///< передача значения обрывов и КЗ фаз во время тестирования целостности обмоток
    /* 0x1B */ eICId_ShuntShiftMotor_failure,       ///< состояние рабочих цепей при переводе стрелки 
#ifdef TECHNOLOGICAL_SOFTWARE
    /* 0x1C */ eICId_UU_rms,                         ///< напряжение фазы U (среднеквадратическое значение)
    /* 0x1D */ eICId_UV_rms,                         ///< напряжение фазы V (среднеквадратическое значение)
    /* 0x1E */ eICId_UW_rms,                         ///< напряжение фазы W (среднеквадратическое значение)
    /* 0x1F */ eICIdKREF,                            ///< опорное напряжение АЦП
    /* 0x20 */ eICIdK3V3,                            ///< напряжение питания МК 
    /* 0x21 */ eICId_NeighborConnectionState         ///< состояние обмена с соседним прибором
#endif
    eInterChannelIdCount                            ///< количество синхронизируемых параметров
     
} InterChannelId;



#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   03-04-2018
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*
* Версия 1.0.2
* Дата   11-11-2019
* Автор  Кругликов В.П.
* 
* Изменения:
* Некоторые параметры вынесены для технологической версии ПО
* с использованием препроцессора
*/
