/**
* \file   nameHex.h
* \brief  Имя прибора.
*
* \version 1.0.1
* \date    15-03-2021
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef NAMEHEX_H
#define NAMEHEX_H

//*****************************************************************************
// Объявление глобальных переменных
//*****************************************************************************

//*****************************************************************************
const char* acNameHex = "ОКПС-Е-К";       ///< Определение имени прибора для формирования имени загрузочного модуля.

//*****************************************************************************
unsigned short iDdevice = 0x0401;    ///< Определение идентификатора прибора.

#endif
//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   15-03-2021
* Автор  Кругликов В.П.
*
* Изменения:
*    Базовая версия.
*/
