/**
* \file   nameHex.h
* \brief  Имя прибора.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef NAMEHEX_H
#define NAMEHEX_H

//*****************************************************************************
// Определение глобальных переменных
//*****************************************************************************

//*****************************************************************************
const char* acNameHex = "ОКПС-Е-К";       ///< Определение имени прибора для формирования имени загрузочного модуля.

//*****************************************************************************
unsigned short iDdevice = 0x0401;    ///< Определение идентификатора прибора.

#endif
