/**
* \file    DebugTools.h
* \brief   Средства отладки прибора 
* \details Интерфейс
*
* \version 1.0.1
* \date    18-04-2018
* \author  Агулов М.А., Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef DEBUGTOOLS_H
#define DEBUGTOOLS_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>
#include "IOports.h"

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
//#define ENABLE_DEBUG_PINS      ///< Включает отладочные пины.
#define ENABLE_DEBUG_SPI         ///< Включает отладочный \a SPI.
//#define SPI_TEST               ///< Включает тест шины \a SPI (передача чисел от 0 до 99).
//#define    DEBUG_VERSION       ///< Включает сообщения warning при компиляции о режиме работы DebugTools.

#define INI_TEST3           INIC_PORT_OUT( B, 0, eIO_openDrainOff )        ///< Инициализация пина TEST3.
#define INI_TEST4           INIC_PORT_OUT( B, 1, eIO_openDrainOff )        ///< Инициализация пина TEST4.
#define TOGGLE_PIN_TEST3    __builtin_btg((uint16_t *)&LATB, 0)            ///< Инверсия пина TEST3.
#define TOGGLE_PIN_TEST4    __builtin_btg((uint16_t *)&LATB, 1)            ///< Инверсия пина TEST4.

//*****************************************************************************
// Макросы типа функция
//*****************************************************************************

//*****************************************************************************
/// \brief Управление пином TEST3.
///
#define TEST3( x )          _LATB0 = ( x )

//*****************************************************************************
/// \brief Управление пином TEST4.
///
#define TEST4( x )          _LATB1 = ( x )

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация модуля DebugTools.h
///
void DebugTools_ctor( void );

//*****************************************************************************
// Макроопределения, управляющие компиляцией
//*****************************************************************************

//*****************************************************************************
#ifdef ENABLE_DEBUG_PINS
    //*** Макросы для работы с тестовыми пинами МК в режиме отладки ***
    
    //*****************************************************************************
    // Глобальные константы, определенные через макросы
    //*****************************************************************************
	
	//*****************************************************************************
    /// \brief Инициализация тестовой ножки порта ввода-вывода LATF1.
    ///
    #define INI_TEST0        INIC_PORT_OUT( F, 1, eIO_openDrainOff )
    
    //*****************************************************************************
    /// \brief Инициализация тестовой ножки порта ввода-вывода LATG1.
    ///
    #define INI_TEST1        INIC_PORT_OUT( G, 1, eIO_openDrainOff )
    
    //*****************************************************************************
    /// \brief Инициализация тестовой ножки порта ввода-вывода LATB10.
    ///
    #define INI_TEST2        INIC_PORT_OUT( B, 10, eIO_openDrainOff )
    
    //*****************************************************************************
    #define TOGGLE_PIN_TEST0 __builtin_btg((uint16_t *)&LATF, 1)     ///< Инверсия пина TEST0.
    #define TOGGLE_PIN_TEST1 __builtin_btg((uint16_t *)&LATG, 1)     ///< Инверсия пина TEST1.
    #define TOGGLE_PIN_TEST2 __builtin_btg((uint16_t *)&LATB, 10)    ///< Инверсия пина TEST2.
    
    //*****************************************************************************
    // Макросы типа функция
    //*****************************************************************************
    
    //*****************************************************************************
    #define TEST1( x )       _LATG1  = ( x )        ///< Установка пина TEST1.
    #define TEST0( x )       _LATF1  = ( x )        ///< Установка пина TEST0.
    #define TEST2( x )       _LATB10 = ( x )        ///< Установка пина TEST2.
    
    #ifdef DEBUG_VERSION
        #warning "Project compiled with ENABLE_DEBUG_PINS directive"
    #endif
#endif

//*****************************************************************************
#ifdef ENABLE_DEBUG_SPI

    //*****************************************************************************
    // Макросы типа функция
    //*****************************************************************************
    
    //*****************************************************************************
    /// \brief Макроопределение для работы с тестовым портом \a SPI.
    ///
    #define EN_SPI( x )  _LATB10 = ( x );
    
    //*****************************************************************************
    // Прототипы интерфейсных функций
    //*****************************************************************************
    
    //*****************************************************************************
    /// \brief Передача по \a SPI слова данных.
    /// \param data - передаваемые данные.
    ///
    void DebugTools_trWordSPI( const uint16_t data );
    
    //*****************************************************************************
    /// \brief Передача по \a SPI массива данных \a data с размерностью \a size.
    /// \param data - указатель на массив данных;
    /// \param size - размер массива данных.
    /// 
    void DebugTools_trBuffSPI( const uint16_t *data, const uint8_t size );
    
    //*****************************************************************************
    /// \brief Тест отладочного интерфейса \a SPI (выдача чисел от 0 до 99).
    /// 
    void DebugTools_testSPI( void );
    
    #ifdef DEBUG_VERSION
        #warning "Project compiled with ENABLE_DEBUG_SPI directive"
    #endif
#endif

#endif

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   18-04-2018
* Автор  Агулов М.А., Кругликов В.П.
*
* Изменения: 
*    Базовая версия.
*/
