/**
* \file    DebugTools.c
* \brief   \copybrief DebugTools.h
*
* \version 1.0.1
* \date    11-04-2018
* \author  Агулов М.А., Кругликов В.П.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "DebugTools.h"
#include "TypeMK.h"
#include <libpic30.h>

//*****************************************************************************
// Макроопределения, управляющие компиляцией
//*****************************************************************************

//*****************************************************************************
#ifdef ENABLE_DEBUG_SPI

//*****************************************************************************
// Прототипы локальных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Настройка порта \a SPI для работы в режиме отладки.
///
static void DebugTools_initSPI( void );

//*****************************************************************************
/// \brief Формирование строба.
///
static void DebugTools_setStrobeSPI( void );

#endif

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация модуля DebugTools
void DebugTools_ctor( void )
{
    INI_TEST3;
    INI_TEST4;
#ifdef ENABLE_DEBUG_SPI
    DebugTools_initSPI( );
#endif
#ifdef ENABLE_DEBUG_PINS
    INI_TEST0;
    INI_TEST1;
    INI_TEST2;
#endif
}

#ifdef ENABLE_DEBUG_SPI
//*****************************************************************************
// Реализация локальных функций
//*****************************************************************************

//*****************************************************************************
// Формирование строба
static void DebugTools_setStrobeSPI( void )
{
    EN_SPI( 1 );
    __delay32( 10 ); //задержка 10* (1/Fcy)
    EN_SPI( 0 );
}

//*****************************************************************************
// Передача по SPI слова данных
void DebugTools_trWordSPI( const uint16_t data )
{
    DebugTools_setStrobeSPI( );
    SPI2BUF = data;
    __delay32( 420 ); //задержка 3us;
}

//*****************************************************************************
// Передача по SPI массива данных data с размерностью size
void DebugTools_trBuffSPI( const uint16_t *data, const uint8_t size )
{
    DebugTools_setStrobeSPI( );
    for( uint8_t count = 0; count < size; count++ )
    {
        SPI2BUF = data[count];
        __delay32( 420 ); //задержка 3us;
    }
}

//*****************************************************************************
// Настройка порта SPI для работы в режиме отладки
static void DebugTools_initSPI( void )
{
    _TRISB10 = 0;
    RPOR9bits.RP97R = 8;        // Источник данных для пина (SDO)
    RPOR10bits.RP113R = 9;      // Источник данных для пина (SCK)
    SPI2CON1bits.DISSCK = 0;    // Internal serial clock is enabled
    SPI2CON1bits.PPRE = 0b10;      
    SPI2CON1bits.SPRE = 0b101;  
    SPI2CON1bits.MSTEN = 1;
    SPI2CON1bits.CKP = 0;
    SPI2CON1bits.SSEN = 0;
    SPI2CON1bits.CKE = 0;
    SPI2CON1bits.SMP = 0;
    SPI2CON1bits.MODE16 = 1;
    SPI2CON1bits.DISSDO = 0;
    SPI2CON2bits.SPIFSD = 0;
    SPI2CON2bits.FRMEN = 0;
    SPI2CON2bits.SPIBEN = 1;
    SPI2STATbits.SPIEN = 1;
    EN_SPI( 1 );
}

//*****************************************************************************
// Тест отладочного интерфейса SPI (выдача чисел от 0 до 99)
void DebugTools_testSPI( void )
{
    for( uint8_t i = 0; i < 100; i++ ) //Тест работоспособности SPI (выдача чисел от 0 до 99)
        DebugTools_trWordSPI( i );
}

#endif

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   11-04-2018
* Автор  Агулов М.А., Кругликов В.П.
*
* Изменения: 
*    Базовая версия.
*/
