/**
* \file    Tracing.h
* \brief   Трассировка даных прибора 
* \version 1.0.2
* \date    05-03-2020
* \author  Третьяков В.Ж., Агулов М.А.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef TRACING_H
#define TRACING_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "Eeprom.h"

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
#define TRACING_BUF_QTY      7U                                                 ///< Количество буферов трассировки.
#define TRACING_BUF_SIZE   256U                                                 ///< Размер буфера трассировки.

// Проверка максимального размеро буферов трассировки
#if (ADDRESS_EEPROM_TRACING_START + TRACING_BUF_QTY * TRACING_BUF_SIZE * 2) >= SIZE_EEDATA
    #error "The tracing buffers is too large"
#endif

// Проверка на кратность размера буфера трассировки числу 16-ть
#if (TRACING_BUF_SIZE & 0x000F) != 0                                            
    #error "The size of tracing buffer must be multiple 16"
#endif

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация модуля.
///
void Tracing_ctor( void );

//*****************************************************************************
/// \brief Сохранение буферов трассировки в \a EEPROM.
///
void Tracing_saveBlackBox( void );

//*****************************************************************************
/// \brief Запись данных в буфер трассировки.
/// \param data - данные;
/// \param numberArray - номер буфера трассировки 0...( TRACING_BUF_QTY-1 ).
///
void Tracing_parameter( uint16_t data, uint16_t numberArray );

//*****************************************************************************
/// \brief Запись данных в буфер трассировки с идентификатором.
/// \param data - данные;
/// \param id - идентификатор данных;
/// \param numberArray - номер буфера трассировки 0...( TRACING_BUF_QTY-1 ).
///
void Tracing_parameterId( uint16_t data, uint16_t id, uint16_t numberArray );

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   24-03-2016
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*  
* Версия 1.0.2
* Дата   05-03-2020
* Автор  Агулов М.А.
* Увеличено количество буферов до семи. Введён контроль размеров буфера
*
*/
