/**
* \file    Tracing.c
* \brief   \copybrief Tracing.h
* 
* \version 1.0.2
* \date    05-03-2020
* \author  Агулов М.А.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "addressVarEeprom.h"
#include "Eeprom.h"
#include "Tracing.h"

//*****************************************************************************
// Объявление локальных переменных
//*****************************************************************************

//*****************************************************************************
static uint16_t aTracingBuf[TRACING_BUF_QTY][TRACING_BUF_SIZE];    ///< Буфер трассировки.
static uint16_t aTracingBufIdx[TRACING_BUF_QTY];                   ///< Массив индексов буферов трассировки.

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация переменных модуля
void Tracing_ctor( void )
{
    for( uint16_t i = 0; i < TRACING_BUF_QTY; i++ ) 
        aTracingBufIdx[i] = 0;
}

//*****************************************************************************
// Запись параметра в буфер трассировки
void Tracing_parameter( uint16_t data, uint16_t numberArray )
{
    if( numberArray < TRACING_BUF_QTY )
    {
        (aTracingBufIdx[numberArray] < TRACING_BUF_SIZE) ? : (aTracingBufIdx[numberArray] = 0);     // Проверка индекса буфера трассировки на выход за границы

        aTracingBuf[numberArray][aTracingBufIdx[numberArray]++] = data;                          // Запись параметра в буфер трассировки
    }
}

//*****************************************************************************
// Трассировка параметра с идентификатором
void Tracing_parameterId( uint16_t data, uint16_t id, uint16_t numberArray )
{
    Tracing_parameter( id,   numberArray );                                     // Запись в буфер трассировки идентификатора данных
    Tracing_parameter( data, numberArray );                                     // Запись в буфер трассировки данных
}

//*****************************************************************************
// Сохранение данных трассировки в EEPROM
void Tracing_saveBlackBox( void )
{
    uint16_t adr = ADDRESS_EEPROM_TRACING_START;                                // Начальный адрес буферов трассировки в EEPROM

    Eeprom_write( ADDRESS_EEPROM_STRUCT_TRACING, ADDRESS_EEPROM_TRACING_START );// Сохранение в EEPROM начального адреса буферов трассировки
    Eeprom_write( ADDRESS_EEPROM_STRUCT_TRACING + 2, TRACING_BUF_QTY );         // Сохранение в EEPROM количества буферов трассировки
    Eeprom_write( ADDRESS_EEPROM_STRUCT_TRACING + 4, TRACING_BUF_SIZE );        // Сохранение в EEPROM размера буфера трассировки
    
    for( uint16_t i = 0; i < TRACING_BUF_QTY; i++ )
    {
        for( uint16_t j = 0; j < TRACING_BUF_SIZE; j++ )
        {
            if ( aTracingBufIdx[i] >= TRACING_BUF_SIZE ) 
                aTracingBufIdx[i] = 0; 
            
            Eeprom_write( adr, aTracingBuf[i][aTracingBufIdx[i]++] );             // Сохранение в EEPROM значения буфера трассировки
            adr += 2;
        }
    }
}

//*****************************************************************************
/*
* Пояснения:
*    Трассировка параметров проводится в оперативную память.
*    При переходе прибора в ЗС данные трассировки
*    сохраняются в EEPROM.
*/

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Дата   24-03-2016
* Автор  Третьяков В.Ж.
* 
* Изменения:
*    Базовая версия.
* 
* Версия 1.0.2
* Дата   05-03-2020
* Автор  Агулов М.А.
* 
* Изменения:
*   Увеличено количество буферов до семи.
*/
