/**
* \file    Adc_regsPIC33.h
* \brief   Регистры модуля Adc.
*
* \version 2.0.1
* \date    24-03-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef ADC_REGSPIC33_H
#define ADC_REGSPIC33_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "typeMK.h"

//*****************************************************************************
// Определение типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Структура портов модуля AdcDriver_PIC33.h.
///
typedef struct 
{
    unsigned short BUF0,        ///< Регистр результатов измерений ADCxBUF0.
                   BUF1,        ///< Регистр результатов измерений ADCxBUF1.
                   BUF2,        ///< Регистр результатов измерений ADCxBUF2.
                   BUF3,        ///< Регистр результатов измерений ADCxBUF3.
                   BUF4,        ///< Регистр результатов измерений ADCxBUF4.
                   BUF5,        ///< Регистр результатов измерений ADCxBUF5.
                   BUF6,        ///< Регистр результатов измерений ADCxBUF6.
                   BUF7,        ///< Регистр результатов измерений ADCxBUF7.
                   BUF8,        ///< Регистр результатов измерений ADCxBUF8.
                   BUF9,        ///< Регистр результатов измерений ADCxBUF9.
                   BUFA,        ///< Регистр результатов измерений ADCxBUFA.
                   BUFB,        ///< Регистр результатов измерений ADCxBUFB.
                   BUFC,        ///< Регистр результатов измерений ADCxBUFC.
                   BUFD,        ///< Регистр результатов измерений ADCxBUFD.
                   BUFE,        ///< Регистр результатов измерений ADCxBUFE.
                   BUFF;        ///< Регистр результатов измерений ADCxBUFF.
    
    /// \brief Регистр контроля и управления ADCxCON1.
    ///
    union 
    {
        unsigned short CON1;              ///< Регистр ADCxCON1 в формате unsigned short.
        AD1CON1BITS    CON1bits;          ///< Регистр ADCxCON1 в формате для битового доступа.
    };
    
    /// \brief Регистр контроля и управления ADCxCON2.
    ///
    union 
    {
        unsigned short CON2;              ///< Регистр ADCxCON2 в формате unsigned short.
        AD1CON2BITS    CON2bits;          ///< Регистр ADCxCON2 в формате для битового доступа.
    };
    
    /// \brief Регистр контроля и управления ADCxCON3.
    ///
    union 
    {
        unsigned short CON3;              ///< Регистр ADCxCON3 в формате unsigned short.
        AD1CON3BITS    CON3bits;          ///< Регистр ADCxCON3 в формате для битового доступа.
    };
    
    /// \brief Регистры результатов измерений ADCxCHS123.
    ///
    union 
    {
        unsigned short CHS123;              ///< Регистр ADCxCHS123 в формате unsigned short.
        AD1CHS123BITS  CHS123bits;          ///< Регистр ADCxCHS123 в формате для битового доступа.
    };
    
    /// \brief Регистры результатов измерений ADCxCHS0.
    ///
    union 
    {
        unsigned short CHS0;              ///< Регистр ADCxCHS0 в формате unsigned short.
        AD1CHS0BITS    CHS0bits;          ///< Регистр ADCxCHS0 в формате для битового доступа.
    };
    unsigned short aUnUse[2];             ///< Неиспользуемые элементы.
    
    unsigned short CSSH,        ///< Регистр выбора входов для сканирования ADxCSSH.
                   CSSL;        ///< Регистр выбора входов для сканирования ADxCSSL.
    
    /// \brief Регистр контроля и управления ADCxCON4.
    ///
    union 
    {
        unsigned short CON4;              ///< Регистр CxCTRL1 в формате unsigned short.
        AD1CON4BITS CON4bits;             ///< Регистр CxCTRL1 в формате для битового доступа.
    };
} Adc_regsPIC33;

//*****************************************************************************
// Определение глобальных переменных
//*****************************************************************************

//*****************************************************************************
extern volatile Adc_regsPIC33 adc1_regsPIC33 __attribute__((sfr(0x0300)));        ///< Блок регистров АЦП, модуль 1.
extern volatile Adc_regsPIC33 adc2_regsPIC33 __attribute__((sfr(0x0340)));        ///< Блок регистров АЦП, модуль 2.

#endif

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*
* Версия 2.0.1
* Дата   24-03-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Изменения под новую схему на dsPIC33.
*/
