/**
* \file    Adc_Inic1.h
* \brief   Макроопределения для инициализации аппаратного модуля МК ADC1.
*
* \version 1.0.1
* \date    28-03-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef ADC_INIC1_H
#define ADC_INIC1_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "typeMK.h"

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация регистра ADCON1 аппаратного модуля МК ADC1 
/// 12-битный канал, результат - безнаковое целое в формате 0000 dddd dddd dddd, 
/// по внутреннему счётчику заканчивается сэмплирование и стартует преобразование.
///
#define INIC_ADC1_ADCON1 0x24E0

//*****************************************************************************
/// \brief Инициализация регистра ADCON2 модуля ADC1 
/// VrefH = Внешний Vref+, VrefL = AVss, сканирование входов во время сэмплирования.
///
#define INIC_ADC1_ADCON2 0x2400 

//*****************************************************************************
/// \brief Инициализация регистра ADCON3 аппаратного модуля МК ADC1
/// Тактирование от системного такта,
/// Tad = 17*15 = 255 нс (min - 117.8), Tsamlpe = 15*Tad (min - 3).
///
#define INIC_ADC1_ADCON3 0x0F0F        

//*****************************************************************************
/// \brief Инициализация регистра ADCON4 аппаратного модуля МК ADC1 
/// Результаты преобразования хранить в ADC1BUF0...ADC1BUFF без использования DMA
/// 
#define INIC_ADC1_ADCON4 0x0000  

/*
 * -------------------------------------------------------------------------------------
 * | Канал | Порт | Пин | Сигнал | Имя сигнала  |    Назначение сигнала
 * |-------+------+-----+--------+--------------+----------------------------------------------------
 * |  AN0  | RA0  |  22 | R1     | eAinchR1     | Сигнал датчика положения положения R1
 * |  AN1  | RA1  |  23 | R2     | eAinchR2     | Сигнал датчика положения положения R2
 * |  AN4  | RB2  |  26 | K3V3   | eAinchK3V3   | Контроль напряжения питания процессора
 * |  AN5  | RB3  |  27 | VREF   | eAinchUREF   | Контроль работоспособности АЦП подачей на вход напряжения UREF 
 * |  AN6  | RB4  |  29 | КREF   | eAinchKREF   | Контроль опорного напряжения смежного контроллера
 * |  AN9  | RA11 |  21 | GEN    | eAinchGEN    | Контроль напряжения генератора определения положения 62,5 Гц
 * |
 * |  AN16 | RG9  |  14 | I-V    | eAinchIV     | Сигнал датчика тока двигателя фазы V
 * |  AN17 | RG8  |  12 | I-U    | eAinchIU     | Сигнал датчика тока двигателя фазы U
 * |  AN18 | RG7  |  11 | I-W    | eAinchIW     | Сигнал датчика тока двигателя фазы W
 * |
 * |  AN21 | RE8  |  18 | U-W    | eAinchUW     | Сигнал датчика напряжения двигателя фазы W
 * |  AN20 | RE9  |  19 | U-U    | eAinchUU     | Сигнал датчика напряжения двигателя фазы U
 * |  AN10 | RA12 |  20 | U-V    | eAinchUV     | Сигнал датчика напряжения двигателя фазы V
 * ----------------------------------------------------------------------------------------
 */

#define INIC_ADC1_ADCSSH 0b0000000000110111UL        ///< Регистр выбора сканируемого входа (ANx).

//*****************************************************************************
/// \brief Регистр выбора сканируемого входа ( ANx ): AN6-iIzmTestBufRegADC, AN5-iIzmIkontrALS,
/// AN4-IIzmOverload, AN1-iIzmU_ALSkontr, AN11-iIzmMK5V, AN7-iIzmKREF.
/// 
#define INIC_ADC1_ADCSSL 0b0000011001110011UL

//*****************************************************************************
// Макросы типа функция
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация портов ввода-вывода для АЦП.
///
#define INIC_ADC1_PIN       \
do                          \
{                           \
    ANSELAbits.ANSA0  = 1;  \
    ANSELAbits.ANSA1  = 1;  \
    ANSELAbits.ANSA11 = 1;  \
    ANSELAbits.ANSA12 = 1;  \
    ANSELBbits.ANSB2  = 1;  \
    ANSELBbits.ANSB3  = 1;  \
    ANSELFbits.ANSF9  = 1;  \
    ANSELEbits.ANSE8  = 1;  \
    ANSELEbits.ANSE9  = 1;  \
    ANSELGbits.ANSG7  = 1;  \
    ANSELGbits.ANSG8  = 1;  \
    ANSELGbits.ANSG9  = 1;  \
} while( 0 )

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   28-03-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
