/**
* \file    AdcDriver_PIC33.h
* \brief   Модуль работы с АЦП, МК dsPIC33
* \details Интерфейс
*
* \version 1.0.2
* \date    15-03-2021
* \author  Агулов М.А.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef ADCDRIVER_PIC33_H
#define ADCDRIVER_PIC33_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>

//*****************************************************************************
// Объявление типов данных
//*****************************************************************************


//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************


//*****************************************************************************
/// \brief Инициализация модуля АЦП и совместно работающий с ним модуль DMA 
///
void AdcDrv_ctor( );

//*****************************************************************************
/// \brief Запрос наличия измеренных значений.
/// \retval true  - АЦП закончил измерения, данные преобразования могут быть 
///                 скопированы из буфера DMA;
/// \retval false - АЦП не закончил измерения.
///
bool AdcDrv_isReady( );

//*****************************************************************************
/// \brief Запустить АЦП.
///
void AdcDrv_Start( );

//*****************************************************************************
/// \brief Остановить АЦП.
///
void AdcDrv_Stop( );

#endif // ADCDRIVER_PIC33_H

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   28-03-2017
* Автор  Третьяков В.Ж.
* 
* Изменения:
*    Базовая версия.
* 
* Версия 1.0.2
* Дата   15-03-2021
* Автор  Агулов М.А.
* 
* Изменения:
*   Изменения были сделаны для работы АЦП с DMA
*/
