/**
* \file    AdcDriver_PIC33.h
* \brief   Модуль работы с АЦП, МК dsPIC33
* \details Интерфейс
*
* \version 1.0.1
* \date    28-03-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef ADCDRIVER_PIC33_H
#define ADCDRIVER_PIC33_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>
#include <stdbool.h>

//*****************************************************************************
// Определение типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Номер модуля АЦП.
///
typedef enum AdcNumber_tag 
{
    eAdc1     = 0,        ///< модуль МК АЦП 1
    eAdcCount             ///< количество доступных модулей АЦП
} AdcNumber;

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Обработка завершения конвертации АЦП, модуль 1.
///
void AdcDriver_interruptAdc1( void );

//*****************************************************************************
/// \brief Инициализация модуля АЦП.
/// \param number - номер модуля АЦП.
///
void AdcDriver_ctor( AdcNumber number );

//*****************************************************************************
/// \brief Чтение измеренных значений.
/// \note Данный метод должен вызываться только когда #AdcDriver_isReady
/// возвращает true.
/// \param number - номер модуля АЦП;
/// \param array  - указатель на массив данных;
/// \param size   - длина массива.
/// \return Количество измеренных значений.
/// 
uint8_t AdcDriver_get( AdcNumber number, uint16_t *array, uint8_t size );

//*****************************************************************************
/// \brief Запрос наличия измеренных значений.
/// \param number - номер модуля АЦП.
/// \retval true  - есть измеренные значения;
/// \retval false - нет измеренных значений.
///
bool AdcDriver_isReady( AdcNumber number );

//*****************************************************************************
/// \brief Запустить измерения набора параметров.
/// \param number - номер модуля АЦП.
///
void AdcDriver_start( AdcNumber number );

#endif 

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   28-03-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
