/**
* \file    checkRegistersDrv.h
* \brief   Проверка основных регистров, используемых при работе МК
* \details Интерфейс
*
* \version 2.0.1
* \date    15-06-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef CHECKREGISTERSDRV_H
#define CHECKREGISTERSDRV_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Проверка основных регистров, используемых при работе.
/// \details Проверяется исправность регистров модулей главного таймера, АЦП, \a CAN, системы прерываний.
/// \retval true  - все в порядке;
/// \retval false - обнаружена неисправность.
///
bool checkRegistersDrv( void );

#endif

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*
* Версия 2.0.1
* Дата   15-06-2017
* Автор  Третьяков В.Ж. 
*
* Изменения:
*    Изменения под новую схему на dsPIC33.
*/
