/**
* \file    ConfigurationMK.h
* \brief   Конфигурация МК.
*
* \version 1.0.1
* \date    19-01-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef CONFIGURATIONMK_H
#define CONFIGURATIONMK_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "typeMK.h"

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
// Конфигурация МК
///
// FICD
#pragma config ICS     = NONE
#pragma config JTAGEN  = OFF           // JTAG запрещен.

// FPOR
#pragma config WDTWIN  = WIN25         // Выбор окна сторожевого таймера равным 25 % от его периода.
#pragma config BOREN   = ON            // Разрешен контроль питания МК.
#pragma config ALTI2C1 = OFF           // Альтернативные пины I2C1 (ASDA1/ASCL1) отключены.
#pragma config ALTI2C2 = OFF           // Альтернативные пины I2C2 (ASDA2/ASCL2) отключены.

// FWDT
#pragma config WDTPRE  = PR32          // Выбор предделителя на 1 мс.
#pragma config WDTPOST = PS1024        // Выбор делителя на 1024. Итого 1024 мс. 
#pragma config PLLKEN  = ON            // Ожидание корректности частоты PLL источника и затем переключение на него.
#pragma config WINDIS  = OFF           // Режим окна для сторожевого таймера выключен.
#pragma config FWDTEN  = OFF           // Разрешение сторожевого таймера из программы.

// FOSC
#pragma config POSCMD  = EC            // Внешний тактовый генератор.
#pragma config OSCIOFNC= OFF           // На OSC2 частота не выдаётся.
#pragma config IOL1WAY = OFF           // Реконфигурация пинов разрещена.
#pragma config FCKSM   = CSECMD        // Переключение тактового генератора разрешено

// FOSCSEL
#pragma config FNOSC   = FRC           // По сбросу процессор начинает работать от FRC-генератора.
#pragma config PWMLOCK = OFF           // ШИМ регистры можно записать без разрешающей последовательности.
#pragma config IESO    = OFF           // Старт работы с выбранным осциллятором, переход на другой осциллятор запрещен.

// FGS
#pragma config GWRP    = OFF           // Выключена защита памяти.
#pragma config GCP     = OFF           // Выключена защита памяти.

#endif

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Дата   19-01-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
