/**
* \file    dsPIC33_rs422.h
* \brief   Драйвер модуля RS-422 для МК dsPIC33 
* \details Интерфейс
* \details Модуль содержит функции, необходимые для инициализации 
*          интерфейса UART и организации обмена по интерфейсу RS-422.
*
* \version 1.0.1
* \date    14-05-2018
* \author  Агулов М.А.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef DSPIC33_RS422_H
#define DSPIC33_RS422_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>
#include "typeMK.h"

//*****************************************************************************
// Прототипы интерфейсных функций 
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация регистров UART1 и пина DE1.
///
void init_L1( void );

//*****************************************************************************
/// \brief Инициализация регистров UART2 и пина DE2.
///
void init_L2( void );

//*****************************************************************************
/// \brief Управление приемом/передачей данных по RS-422, линия 1.
/// \param dir - направление обмена: 0 - прием, 1 - передача.
///
void dirL1( bool dir );

//*****************************************************************************
/// \brief Прием байта данных по RS-422 UART1.
/// \param data - указатель на переменную, в которую запишется принятый байт.
/// \retval true  - прием был;
/// \retval false - приема не было.
///
bool RxByte_L1( uint8_t *data );

//*****************************************************************************
/// \brief Передача байта данных по RS-422 UART1.
/// \param data - байт для передачи.
/// \retval true  - байт записан в буфер \a UART для передачи;
/// \retval false - нет готовности передатчика.
///
bool TxByte_L1( uint8_t data );

//*****************************************************************************
/// \brief Определение окончания передачи по RS-422 UART1.
/// \retval true  - передача закончена;
/// \retval false - передача не закончена.
///
bool isTxCompl_L1( void );

//*****************************************************************************
/// \brief Управление приемом/передачей данных по RS-422 UART2.
/// \param dir - направление обмена: 0 - прием, 1 - передача.
///
void dirL2( bool dir );

//*****************************************************************************
/// \brief Прием байта данных по RS-422 UART2.
/// \param data - указатель на переменную, в которую запишется принятый байт.
/// \retval true  - прием был;
/// \retval false - приема не было.
///
bool RxByte_L2( uint8_t *data );

//*****************************************************************************
/// \brief Передача байта данных по RS-422 UART2.
/// \param data - байт для передачи.
/// \retval true  - байт записан в буфер \a UART для передачи;
/// \retval false - нет готовности передатчика.
///
bool TxByte_L2( uint8_t data );

//*****************************************************************************
/// \brief Определение окончания передачи по RS-422 UART2.
/// \retval true  - передача закончена;
/// \retval false - передача не закончена.
///
bool isTxCompl_L2( void );

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   14-05-2018
* Автор  Агулов М.А.
*
* Изменения:
*    Базовая версия.
*/
