/**
* \file    EcanAck_Pins.h
* \brief   Порты ввода-вывода модуля "Драйвер ECAN с подтверждением приема по дискретным линиям".
* \details Модуль используется для определения макроопределений, необходимых для работы драйвера
* ECAN с подтверждением приема по дискретным линиям.
*
* \version 2.0.1
* \date    10-03-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef ECANACK_PINS_H
#define ECANACK_PINS_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "IOports.h"

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
/// \brief Инвертировать уровень на линии подтверждения приема.
///
#define ECAN_ACK_TOGGLE_LEVEL TOGGLEBIT( LATD,  14 )

/// \brief Проверка высокого уровня на линии подтверждения приема.
///
#define ECAN_ACK_CHECK_HIGH   ( PORTDbits.RD15 == 1 )

//*****************************************************************************
// Макросы типа функция
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация портов ввода-вывода для линий подтверждения приема по дискретным линиям.
///
#define ECAN_ACK_INIC_PORTS                       \
    do                                            \
    {                                             \
        INIC_PORT_IN( D, 15, eIO_pullDown );      \
        INIC_PORT_OUT( D, 14, eIO_openDrainOff ); \
    } while( 0 )

#endif

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
* 
* Версия 2.0.1
* Дата   10-03-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Изменения под новую схему на dsPIC33.
*/
