/**
* \file    ECAN1_PinRemap.h
* \brief   Настройка пинов на работу с ECAN1.
*
* \version 1.0.1
* \date    17-03-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef ECAN1_PINREMAP_H
#define ECAN1_PINREMAP_H

//*****************************************************************************
// Макросы типа функция
//*****************************************************************************

//*****************************************************************************
/// \brief Настройка пинов на работу с ECAN1.
///
#define ECAN1_PIN_REMAP                                             \
do                                                                  \
{                                                                   \
    TRISDbits.TRISD6  = 0;             /* CAN1 Tx pin directions */ \
    TRISDbits.TRISD5  = 1;             /* CAN1 Rx pin directions */ \
    RPOR8bits.RP70R   = _RPOUT_C1TX;   /* CAN1 Tx pin remap. */     \
    RPINR26bits.C1RXR = 69;            /* CAN1 Rx pin remap. */     \
} while( 0 )

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   17-03-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
