/**
* \file    ECAN2_PinRemap.h
* \brief   Настройка пинов на работу с ECAN2.
*
* \version 1.0.1
* \date    17-03-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef ECAN2_PINREMAP_H
#define ECAN2_PINREMAP_H

//*****************************************************************************
// Макросы типа функция
//*****************************************************************************

//*****************************************************************************
/// \brief Настройка пинов на работу с ECAN2.
///
#define ECAN2_PIN_REMAP                                             \
do                                                                  \
{                                                                   \
    _TRISB4 = 0;                      /* ECAN2 Tx pin directions */ \
    _TRISA8 = 1;                      /* ECAN2 Rx pin directions */ \
    RPOR1bits.RP36R   = _RPOUT_C2TX;  /* ECAN2 Tx pin remap. */     \
    RPINR26bits.C2RXR = 0b0011000;    /* ECAN2 Rx pin remap. */     \
} while( 0 )

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   17-03-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
