/**
* \file    posDetGen_drv.c
* \brief   \copybrief posDetGen_drv.h
*
* \version 1.0.2
* \date    11-11-2019
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "typeMK.h"
#include "posDetGen_drv.h"
#include "ConfigMK.h"

//*****************************************************************************
// Прототипы локальных функций
//*****************************************************************************

//*****************************************************************************
static void OffSw( void );        ///< Выключение всех ключей 3-фазного моста.

//*****************************************************************************
// Реализация локальных функций
//*****************************************************************************

//*****************************************************************************
// Выключение всех ключей 3-фазного моста
static void OffSw( void )
{
    //В выключенном состоянии генератора включены нижние ключи
    _LATB14 = 0;
    _LATB15 = 0;
}

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация модуля ШИМ
void PosDetGenDrv_init( void )
{
    if( ConfigMK_isSlave( ) )
    {
        PTCONbits.PTEN     = 0;          // Включение модуля ШИМ
        IOCON1bits.PMOD    = 0;          // Включить комплементарный режим работы ключей
        IOCON1bits.PENL    = 1;          // Нижний ключ контролируется модулем PWM
        IOCON1bits.PENH    = 1;          // Верхний ключ контролируется модулем PWM
        IOCON2bits.PENL    = 0;          // Нижний ключ контролируется модулем PWM
        IOCON2bits.PENH    = 0;          // Верхний ключ контролируется модулем PWM
        IOCON3bits.PENL    = 0;          // Нижний ключ контролируется модулем PWM
        IOCON3bits.PENH    = 0;          // Верхний ключ контролируется модулем PWM
        IOCON4bits.PENL    = 0;          // Нижний ключ контролируется модулем PWM
        IOCON4bits.PENH    = 0;          // Верхний ключ контролируется модулем PWM
        IOCON5bits.PENL    = 0;          // Нижний ключ контролируется модулем PWM
        IOCON5bits.PENH    = 0;          // Верхний ключ контролируется модулем PWM
        IOCON6bits.PENL    = 0;          // Нижний ключ контролируется модулем PWM
        IOCON6bits.PENH    = 0;          // Верхний ключ контролируется модулем PWM
        PTCONbits.SEVTPS   = 1;          // Postscaler 1:2
        PWMCON1bits.DTC    = 2;          // Запретить мёртвое время 
        DTR1               = 0;          // Deadtime setting 
        ALTDTR1            = 0;          // Deadtime setting 
        PHASE1             = 0;          // No phase shift 
        PWMCON1bits.CAM    = 0;          // Разрешить выравнивание по краю ШИМ    
        FCLCON1bits.FLTMOD = 3;
        _TRISA7            = 1;
        _TRISB14           = 0;
        _TRISB15           = 0;
        OffSw( );
        PTCONbits.PTEN     = 1; //Включение модуля ШИМ
    }
}

//*****************************************************************************
// Включение модуля ШИМ
void PosDetGenDrv_setEnable( uint16_t period, uint16_t iniValue )
{
    //PWM измерительного генератора расположен на Slave
    if( ConfigMK_isSlave( ) )
    { // Slave  
        PTPER = period; // заносим значение в PTPER
        //Установка начального значения
        PDC1 = iniValue;
        //Сброс флага
        IFS5bits.PWM1IF = 0;
        PTCONbits.PTEN = 1; //Включение модуля ШИМ 
    }
}

//*****************************************************************************
// Выключение модуля ШИМ
void PosDetGenDrv_setDisable( void )
{
    //PWM измерительного генератора расположен у Slave
    if( ConfigMK_isSlave( ) )
    { // Slave
        PTCONbits.PTEN = 0; //Отключение модуля ШИМ
        OffSw( ); // Оптроны выключены
    }
}

//*****************************************************************************
// Установка значения ШИМ
bool PosDetGenDrv_setValue( const int16_t value )
{
    //PWM измерительного генератора расположен у Slave
    if( ConfigMK_isSlave( ) )
    {
        //Установка текущего значения
        PDC1 = value;
        //Сброс флага
        IFS5bits.PWM1IF = 0;
        return true;
    }
    return false;
}

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   26-03-2018
* Автор  Кругликов В.П.
*
* Изменения:
*    Базовая версия.
*
* Версия 1.0.2
* Дата   11-11-2019
* Автор  Кругликов В.П.
* 
* Изменения:
* Тип параметра функции PosDetGenDrv_setValue 
* изменён на беззнаковый
*/
