/**
* \file    posDetGen_drv.h
* \brief   Драйвер генератора напряжения контрольных цепей
* \details Интерфейс
*
* \version 1.0.2
* \date    11-11-2019
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef POSDETGEN_DRV_H
#define POSDETGEN_DRV_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>
#include <stdbool.h>

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Включение модуля ШИМ.
/// \param period   - период;
/// \param iniValue - начальное значение.
///
void PosDetGenDrv_setEnable( uint16_t period, uint16_t iniValue );

//*****************************************************************************
/// \brief Выключение модуля ШИМ.
///
void PosDetGenDrv_setDisable( void );

//*****************************************************************************
/// \brief Установка значения ШИМ.
/// \param value - значение ШИМ.
///
bool PosDetGenDrv_setValue( const int16_t value );

//*****************************************************************************
/// \brief Инициализация модуля ШИМ.
///
void PosDetGenDrv_init( void );

#endif

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   16-01-2018
* Автор  Кругликов В.П.
*
* Изменения:
*    Базовая версия.
*
* Версия 1.0.2
* Дата   11-11-2019
* Автор  Кругликов В.П.
* 
* Изменения:
* Тип параметра функции PosDetGenDrv_setValue 
* изменён на беззнаковый
*/
