/**
* \file    relayCtrlDrv.c
* \brief   \copybrief relayCtrlDrv.h
*
* \version 1.0.1
* \date    29-03-2018
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "typeMK.h"
#include "relayCtrlDrv.h"
#include "ConfigMK.h"


//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация портов управления 
void RelayCtrlDrv_ctor( void )
{
    //Реле РПВ
    _TRISC7 = 0;
    _LATC7 = 1;
    //Подключение приемника к Лин1, Лин2 (К5 модуль 5-ЭЦ)
    _TRISD13 = 0;
    _LATD13 = 1;
    //Подключение приемника к Лин3, Лин4 (К6 модуль 5-ЭЦ)
    _TRISD12 = 0;
    _LATD12 = 1;
    //Включение-выключение генератора контрольного напряжения  
    _TRISC8 = 0;
    _LATC8 = 1;

    if( ConfigMK_isSlave( ) ) // Slave
    {
        //Замыкание терморезистора
        _TRISG13 = 0;
        _LATG13 = 1;
    }
}

//*****************************************************************************
// Переключение реле РПВ (К1...К4 модуль 5-ЭЦ)
void RelayCtrlDrv_switchRpv( bool state )
{
    _LATC7 = !state;
}

//*****************************************************************************
// Подключение приемника к L1, L2 (К5 модуль 5-ЭЦ)
void RelayCtrlDrv_switchReceiverL1L2( bool state )
{
    _LATD13 = !state;
}

//*****************************************************************************
// Подключение приемника к L3, L4 (К6 модуль 5-ЭЦ)
void RelayCtrlDrv_switchReceiverL3L4( bool state )
{
    _LATD12 = !state;
}

//*****************************************************************************
// Включить/выключить фазы А и В (пятипроводный режим).
void RelayCtrlDrv_switchPhasesAB( bool level )
{

}

//*****************************************************************************
// Замыкание терморезистора (работает только в Slave).
void RelayCtrlDrv_switchTermoShunt( bool state )
{
        if( ConfigMK_isSlave( ) )  _LATG13 = !state;
}

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   29-03-2018
* Автор  Кругликов В.П.
*
* Изменения:
*    Базовая версия.
*/
