/**
* \file    relayCtrlDrv.h
* \brief   Драйвер управления реле, находящихся на модуле реле
* \details Интерфейс
* \details Управление реле РПВ,также реле плавного пуска 220 В, реле смены направления, 
* \details реле управления фазами в пятипроводной схеме контроля положения стрелки. 
* \version 1.0.1
* \date    29-03-2018
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef RELAYCTRLDRV_H
#define RELAYCTRLDRV_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация портов управления.
///
void RelayCtrlDrv_ctor( void );

//*****************************************************************************
/// \brief Переключение реле РПВ (К1...К4 модуль 5-ЭЦ).
/// \param state - состояние реле (true (включено), false (выключено)).
///
void RelayCtrlDrv_switchRpv( bool state );

//*****************************************************************************
/// \brief Подключение приемника к L1, L2 (К5 модуль 5-ЭЦ).
/// \param state - состояние приемника (true (включен), false (выключен)).
///
void RelayCtrlDrv_switchReceiverL1L2( bool state );

//*****************************************************************************
/// \brief Подключение приемника к L3, L4 (К6 модуль 5-ЭЦ).
/// \param state - состояние приемника (true (включен), false (выключен)).
///
void RelayCtrlDrv_switchReceiverL3L4( bool state );

//*****************************************************************************
/// \brief Замыкание терморезистора.
/// \details Работает в Slave.
/// \param state - состояние терморезистора (true (включен), false (выключен)).
///
void RelayCtrlDrv_switchTermoShunt( bool state );

//*****************************************************************************
/// \brief Включить/выключить фазы А и В (пятипроводный режим).
/// \param level - состояние фаз (true (включены), false (выключены)).
///
void RelayCtrlDrv_switchPhasesAB( bool level );

#endif

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   29-03-2018
* Автор  Кругликов В.П.
*
* Изменения:
*    Базовая версия.
*/
