/**
* \file    shuntShiftGenDrv.h
* \brief   Драйвер генератора трёхфазного напряжения рабочих цепей;
* \details Интерфейс
*
* \version 1.0.1
* \date    12-10-2018
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef SHUNTSHIFTGENDRV_H
#define SHUNTSHIFTGENDRV_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
#define NUMBER_OF_PHASES        3U        ///< Количество фаз.

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Отключение, назначение выводов как IO Ports.
///
void ShuntShiftGenDrv_off( void );

//*****************************************************************************
/// \brief Включение, установка периода и начальных значений.
/// \param period - период ШИМ;
/// \param iniValueArr - указатель на начальное значение ШИМ.
/// \retval true  - значения успешно записаны в регистры;
/// \retval false - значения не записаны в регистры.
///
bool ShuntShiftGenDrv_on( uint16_t period, const int16_t *iniValueArr );

//*****************************************************************************
/// \brief Установка текущего значения ШИМ.
/// \param valueArr - указатель на текущее значение ШИМ.
/// \retval true  - значение успешно записано в регистр;
/// \retval false - значение не записано в регистр.
///
bool ShuntShiftGenDrv_setValues( const int16_t *valueArr );

//*****************************************************************************
/// \brief Инициализация модуля PWM и выходов управления транзисторными ключами.
/// 
void ShuntShiftGenDrv_init( void );        

#endif 

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   12-10-2018
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
