/**
* \file    shuntShiftGenDrv.c
* \brief   \copybrief shuntShiftGenDrv.h
*
* \version 1.0.1
* \date    12-10-2018
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>
#include "typeMK.h"
#include "shuntShiftGenDrv.h"
#include "ConfigMK.h"

//*****************************************************************************
// Прототипы локальных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Выключение всех ключей 3-фазного моста.
///
static void OffSw( void );

//*****************************************************************************
/// \brief Установка длительностей в периоде ШИМ.
/// \param value - указатель на значение ШИМ.
///
static void SetPDC( const int16_t *value );

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация 3-фазного генератора
void ShuntShiftGenDrv_init( void )
{
    if( ConfigMK_isMaster( ) )
    {
        //Настройка выводов 3-фазного ШИМа
        PTCONbits.PTEN     = 0;
        PTCONbits.SEVTPS   = 1;        // Postscaler 1:2
        IOCON1bits.PENL    = 0;        // Нижний ключ контролируется модулем PWM
        IOCON1bits.PENH    = 0;        // Верхний ключ контролируется модулем PWM
        IOCON2bits.PENL    = 0;        // Нижний ключ контролируется модулем PWM
        IOCON2bits.PENH    = 0;        // Верхний ключ контролируется модулем PWM
        IOCON3bits.PENL    = 0;        // Нижний ключ контролируется модулем PWM
        IOCON3bits.PENH    = 0;        // Верхний ключ контролируется модулем PWM
        IOCON4bits.PMOD    = 1;        // For Redundant Output mode
        IOCON4bits.PENL    = 1;        // Нижний ключ контролируется модулем PWM
        IOCON4bits.PENH    = 0;        // Верхний ключ контролируется как GPIO
        IOCON5bits.PMOD    = 1;        // For Redundant Output mode
        IOCON5bits.PENL    = 1;        // нижний ключ контролируется модулем PWM
        IOCON5bits.PENH    = 0;        // Верхний ключ контролируется как GPIO
        IOCON6bits.PMOD    = 1;        // For Redundant Output mode
        IOCON6bits.PENL    = 1;        // Нижний ключ контролируется модулем PWM
        IOCON6bits.PENH    = 0;        // Верхний ключ контролируется как GPIO
        PWMCON4bits.DTC    = 2;        // Запрет мёртвого времени модуля PWM4
        PWMCON5bits.DTC    = 2;        // Запрет мёртвого времени модуля PWM5
        PWMCON6bits.DTC    = 2;        // Запрет мёртвого времени модуля PWM6
        DTR4               = 0;        // Deadtime setting
        ALTDTR4            = 0;        // Deadtime setting
        DTR5               = 0;        // Deadtime setting
        ALTDTR5            = 0;        // Deadtime setting
        DTR6               = 0;        // Deadtime setting
        ALTDTR6            = 0;        // Deadtime setting
        PHASE4             = 0;        // No phase shift
        PHASE5             = 0;        // No phase shift
        PHASE6             = 0;        // No phase shift
        PWMCON4bits.CAM    = 0;        // Разрешить выравнивание по краю ШИМ
        FCLCON4bits.FLTMOD = 3;        
        PWMCON5bits.CAM    = 0;        // Разрешить выравнивание по краю ШИМ
        FCLCON5bits.FLTMOD = 3;        
        PWMCON6bits.CAM    = 0;        // Разрешить выравнивание по краю ШИМ
        FCLCON6bits.FLTMOD = 3;        
        // Пины портов с ключами - на выход
        _TRISA7            = 0;
        _TRISD1            = 0;
        _TRISD3            = 0;
        OffSw( );
    }
}

//*****************************************************************************
// Отключение, назначение выводов как IO Ports
void ShuntShiftGenDrv_off( void )
{
    //3-фазный PWM расположен у Master 
    if( ConfigMK_isMaster( ) ) 
    {
        PTCONbits.PTEN = 0; //Отключение модуля ШИМ
        OffSw( );
    }
}

//*****************************************************************************
// Включение, установка периода и начальных значений 
bool ShuntShiftGenDrv_on( uint16_t period, const int16_t *iniValueArr )
{
    if( ConfigMK_isMaster( ) ) //Выход из функции, если МК - Slave
    {    
        //Определение служебных регистров для Master
        PTPER = period; // Заносим значение в PTPER
        SetPDC( iniValueArr ); //Установка начальных значений
        PTCONbits.PTEN = 1; //Включение модуля PWM
        return true;
    }
    return false;
}

//*****************************************************************************
// Установка текущих значений
bool ShuntShiftGenDrv_setValues( const int16_t *valueArr )
{
    //Выход из функции, если МК - Slave
    if( ConfigMK_isMaster( ) )
    {
        SetPDC( valueArr ); //Установка текущих значений 
        return true;
    }
    return false;
}

//*****************************************************************************
// Реализация локальных функций
//*****************************************************************************

//*****************************************************************************
// Выключение всех ключей 3-фазного моста
static void OffSw( void )
{
    //В выключенном состоянии генератора включены нижние ключи
    _LATA7 = 0;
    _LATD1 = 0;
    _LATD3 = 0;
}

//*****************************************************************************
// Установка длительностей в периоде ШИМ
static void SetPDC( const int16_t *value )
{
    PDC4 = value[0];
    PDC5 = value[1];
    PDC6 = value[2];
}

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   12-10-2018
* Автор  Кругликов В.П.
* 
* Изменения:
*     Базовая версия.
*/
