/**
* \file    turnOffdsPIC33.h
* \brief   Отключение периферии МК dsPIC33
* \details Интерфейс
*
* \version 1.0.1
* \date    08-01-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef TURNOFFDSPIC33_H
#define TURNOFFDSPIC33_H

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Отключение периферии МК.
///
void turnOffMK( void );        

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   08-01-2017
* Автор  Третьяков В.Ж. 
* 
* Изменения:
*    Базовая версия.
*/
