/**
* \file    typeMK.h
* \brief   Определение типа МК.
*
* \version 2.0.1
* \date    19-01-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <p33EP512GM710.h>

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Автор  Третьяков В.Ж. 
* 
* Изменения:
*    Базовая версия.
*  
* Версия 2.0.1
* Дата   19-01-2017
* Автор  Третьяков В.Ж. 
*
* Изменения:
*    Изменения под новую схему на dsPIC33.
*/