/**
* \file    UartPinRemap.h
* \brief   Настройка пинов на работу с UART
*
* \version 1.0.1
* \date    19-07-2019
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef UARTPINREMAP_h
#define UARTPINREMAP_h

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <xc.h>

//*****************************************************************************
// Макросы типа функция
//*****************************************************************************

//*****************************************************************************
/// \brief Настройка пинов на работу с UART1.
///
#define UART1_PIN_REMAP do {\
    _TRISE1 = 0;                      /* UART1 Tx pin directions */\
    _TRISC3 = 1;                      /* UART1 Rx pin directions */\
    _ODCE1 = 1;                       /* Пин типа "открытый коллектор" */\
    ANSELCbits.ANSC3 = 0;             /* Пин используется как цифровой */\
    RPOR9bits.RP81R = _RPOUT_U1TX;    /* Источник данных для пина */\
    RPINR18bits.U1RXR = 51;           /* С какого пина брать данные для UART */\
    ANSELCbits.ANSC3  = 0;             /* Пин используется как цифровой */\
} while (0)

//*****************************************************************************
/// \brief Настройка пинов на работу с UART2.
///
#define UART2_PIN_REMAP do {\
    _TRISB4 = 0;                      /* UART2 Tx pin directions */\
    _TRISA9 = 1;                      /* UART2 Rx pin directions */\
    _ODCB4 = 1;                       /* Пин типа "открытый коллектор" */ \
    ANSELAbits.ANSA9 = 0;             /* Пин используется как цифровой */\
    RPOR1bits.RP36R = _RPOUT_U2TX;    /* Источник данных для пина */\
    RPINR19bits.U2RXR = 25;           /* С какого пина брать данные для UART */\
} while (0)

//*****************************************************************************
/// \brief Настройка пинов на работу с UART3.
///
#define UART3_PIN_REMAP 

//*****************************************************************************
/// \brief Настройка пинов на работу с UART4.
///
#define UART4_PIN_REMAP 

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   19-07-2019
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
