/**
* \file    WorkWithBits.h
* \brief   Макросы для работы с битами.
*
* \version 2.0.1
* \date    22-02-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef WORKWITHBITS_H
#define WORKWITHBITS_H

//*****************************************************************************
// Макросы типа функция
//*****************************************************************************

//*****************************************************************************
/// \brief Установить указанный бит в единицу.
/// 
#define SETBIT( x, y )         ( ( x ) |= ( 1 << ( y ) ) )

//*****************************************************************************
/// \brief Установить указанный бит в ноль.
/// 
#define CLEARBIT( x, y )       ( ( x ) &= ( ~( 1 << ( y ) ) ) )

//*****************************************************************************
/// \brief Инвертировать указанный бит.
/// 
#define TOGGLEBIT( x, y )      ( ( x ) ^= ( 1 << ( y ) ) )

//*****************************************************************************
/// \brief Выделить указанный бит для проверки.
/// 
#define CHECKBIT( x, y )       ( ( x ) & ( 1 << ( y ) ) )

//*****************************************************************************
/// \brief Установить бит регистра порта ввода/вывода.
/// \details Преобразование в \a REGbits.REGnBit = data (0, 1).
/// \param REG  - имя регистра;
/// \param nBit - номер бита в регистре;
/// \param data - значение, в которое устанавливается бит регистра.
/// \note Применять к регистрам  TRISx, LATx, ODCx, CNPUx, CNPDx.
/// \note Не применять к регистрам PORTx, ANSELx, CHENx, где x = A, B...
///
#define SETBIT_REGISTER( REG, nBit, data ) ( REG##bits.REG##nBit = data )

 #endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   05-04-2016
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*
* Версия 2.0.1
* Дата   22-02-2017
* Автор  Третьяков В.Ж.
* 
* Изменения:
*    Изменения под новую схему на dsPIC33. 
*/
