/**
* \file    SafetyPowerControl.h
* \brief   Управление и контроль безопасного источника питания (Safety Power Control Supply)
* \details Интерфейс
*
* \version 1.0.1
* \date    04-04-2018
* \author  Агулов М.А
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef SAFETYPOWERCONTROL_H
#define SAFETYPOWERCONTROL_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdbool.h>

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация компонента.
/// \details Инициализируются данные для корректной работы компонента.
/// \note Вызывается перед началом работы с компонентом. 
/// \note Вызов этой функции перед использованием других функций этого 
/// компонента обязателен.
///
void SafetyPowerControl_ctor( void );

//*****************************************************************************
/// \brief Реализация формирования безопасного питания и его контроля.
/// \note Вызывается в прерывании 16кГц.
///
void SafetyPowerControl_runInterrupt( void );

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   04-04-2018
* Автор  Агулов М.А.
* 
* Изменения:
*     Базовая версия.
*/
