/**
* \file    CheckCauseReset.h
* \brief   Определение причин сброса МК
* \details Интерфейс
*
* \version 1.0.2
* \date    21-05-2020
* \author  Агулов М.А.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef CHECKCAUSERESET_H
#define CHECKCAUSERESET_H

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Определение причин сброса МК.
/// \note Если сброс по питанию или по внешнему сигналу сброса - продолжаем работу,
/// в противном случае - переход в 3С.
///
void checkCauseReset_run( void );

#endif

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Дата   18-07-2016
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*
* Версия 1.0.2
* Дата   21-05-2020
* Автор  Агулов М.А.
* 
* Изменения:
*    Добавлено сохранение регистра RCON в качестве
* параметра 1. 
*/
