/**
* \file    CheckCauseReset.c
* \brief   \copybrief CheckCauseReset.h
*
* \version 2.0.2
* \date    21-05-2020
* \author  Третьяков В.Ж., Агулов М.А.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
//#include <stdint.h>
#include "typeMK.h"
#include "asserts_ex.h"
#include "ProtectionState_codes.h"
#include "checkCauseReset.h"

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Определение причин сброса МК
void checkCauseReset_run( void )
{
    // Корректным считается СБРОС по включению питания или внешний сброс по
    //  входу nMCLR. Все другие признаки СБРОСа считаются некорректными.
    ASSERT_EX_ID( eGrPS_Main, ePS_MainIncorrectReset, 
                  (_POR || _EXTR) && !_WDTO && !_TRAPR && !_SWR && !_IOPUWR, 
                  RCON, 0, 0, 0 );

    RCON &= ~_RCON_POR_MASK & ~_RCON_EXTR_MASK & ~_RCON_BOR_MASK;               // Биты в регистре RCON длжны сбрасываться программно.
}

//*****************************************************************************
/**
* История изменений:
*  
* Версия 1.0.1
* Дата   18-07-2016
* Автор  Третьяков В.Ж.
* 
* Изменения:
*    Базовая версия.
* 
* Версия 2.0.1
* Дата   05-10-2017
* Автор  Третьяков В.Ж.
* 
* Изменения:
*    Изменения под новую схему на dsPIC33.
*
* Версия 2.0.2
* Дата   21-05-2020
* Автор  Агулов М.А.
* 
* Изменения:
*    Добавлено сохранение регистра RCON в качестве
* параметра 1.
 */
