/**
* \file    IdentHex.h
* \brief   Идентификация прибора и его ПО: имя, версия, дата
* \details Интерфейс
* 
* \version 1.0.1
* \date    06-10-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef IDENTHEX_H
#define IDENTHEX_H

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Запись в \a EEPROM имени прибора, версии, даты прошивки.
/// 
void IdentHex_run( void );

#endif

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   06-10-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
