/**
* \file    TimeSynchronizationPorts.h
* \brief   Порты для временной синхронизации МК.
* 
* \version 2.0.1
* \date    20-02-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef TIMESYNCHRONIZATIONPORTS_H
#define TIMESYNCHRONIZATIONPORTS_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "typeMK.h"
#include "IOports.h"

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
/// \brief Установить на линии временной синхронизации МК низкий уровень.
/// 
#define TIME_SYNCHRO_SET_LOW      LATEbits.LATE14 = 0

//*****************************************************************************
/// \brief Установить на линии временной синхронизации МК высокий уровень.
/// 
#define TIME_SYNCHRO_SET_HIGH     LATEbits.LATE14 = 1

//*****************************************************************************
/// \brief Инвертировать уровень на линии временной синхронизации МК.
/// 
#define TIME_SYNCHRO_TOGGLE_LEVEL TOGGLEBIT( LATE, 14 )

//*****************************************************************************
/// \brief Проверка низкого уровня на линии временной синхронизации МК.
/// 
#define TIME_SYNCHRO_CHECK_LOW    ( PORTEbits.RE15 == 0 )

//*****************************************************************************
/// \brief Проверка высокого уровня на линии временной синхронизации МК.
/// 
#define TIME_SYNCHRO_CHECK_HIGH   ( PORTEbits.RE15 == 1 )

//*****************************************************************************
/// \brief Сброс флага прерывания по изменению уровня на линии временной синхронизации МК.
/// 
#define CN_INTERRUPT_CLEAR_FLAG   IFS1bits.CNIF = 0;

//*****************************************************************************
/// \brief Проверка прерываний по изменению уровня.
/// 
#define CHECK_INTERRUPT_CN        ( IEC1bits.CNIE == 1 )

//*****************************************************************************
/// \brief Запрет прерываний по изменению уровня дискретного входа.
/// 
#define DISABLE_INTERRUPT_CN      ( IEC1bits.CNIE = 0 )

//*****************************************************************************
/// \brief Разрешение прерываний по изменению уровня дискретного входа.
/// 
#define ENABLE_INTERRUPT_CN       ( IEC1bits.CNIE = 1 )

//*****************************************************************************
// Макросы типа функция
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация портов ввода-вывода для линий временной синхронизации МК.
///
#define TIME_SYNCHRO_INIC_PORTS                   \
    do                                            \
    {                                             \
        INIC_PORT_IN( E, 15, eIO_pullDown );      \
        INIC_PORT_OUT( E, 14, eIO_openDrainOff ); \
    } while( 0 )

#endif

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
* 
* Версия 2.0.1
* Дата   20-02-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Изменения под новую схему на dsPIC33.
*/
