/**
* \file    TimeBeginSynchronization.h
* \brief   Начальная временная синхронизация МК
* \details Интерфейс
*
* \version 1.0.1
* \date    16-03-2016
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef TIMEBEGINSYNCHRONIZATION_H
#define TIMEBEGINSYNCHRONIZATION_H

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Начальная синхронизация МК по времени.
/// 
void TimeBeginSynchronization_run( void );

#endif

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Дата   16-03-2016
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
