/**
* \file    AnalogMeasurement.h
* \brief   Оцифровка, фильтрация, вычисление аналоговых параметров и приведение их к физическим величинам 
* \details Интерфейс
*
* \version 1.0.2
* \date    16-09-2020
* \author  Кругликов В.П.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef ANALOGMEASUREMENT_H
#define ANALOGMEASUREMENT_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "AnalogInput.h"

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
#define ANALOG_SYNCHRO_PERIOD    100          ///< Период синхронизации аналоговых параметров.

#define  MIDDLE_VAL_WINDOW_SIZE  128U            ///< Размер, выделяемый под кольцевой буфер для скользящего среднего

//*****************************************************************************
// Объявление типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Результат измерений, приведенный к физическим величинам.
///
typedef struct AnalogMeasurementValue_tag 
{
    uint16_t rms;          ///< Среднее значение сигнала.
    int16_t  value;        ///< Мгновенное значение сигнала.
} AnalogMeasurementValue;

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
void AnalogMeasurement_ctor( void );        ///< Инициализация переменных компонента (конструктор).

//*****************************************************************************
/// \brief Обработка аналоговых сигналов.
/// \details Функция выполняет:
/// \details - взаимодействие с модулями системы;
/// \details - настройку измерительных каналов;
/// \details - измерение постоянных и периодических сигналов;
/// \details - приведение измеренных значений к физическим величинам;
/// \details - синхронизацию измеренных параметров между двумя каналами.
/// \note Требования к вызову функции должны соответствовать требованиям 
/// функции #AnalogInput_run.
///
void AnalogMeasurement_run( void );

//*****************************************************************************
/// \brief Чтение результатов измерения АЦП.
/// \note Требования к вызову функции должны соответствовать требованиям 
/// функции #AnalogInput_runInterrupt.
///
void AnalogMeasurement_runInterrupt( void );

//*****************************************************************************
/// \brief Чтение измеренных значений (определяется используемой системой физических величин).
/// \param channel – номер канала.
/// \return Измеренные значения для указанного канала измерения.
///
const AnalogMeasurementValue *AnalogMeasurement_getData( uint16_t channel );



#endif

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Дата   08-10-2018
* Автор  Агулов М.А.
* 
* Изменения:
*    Базовая версия.
*
* Версия 1.0.2
* Дата   16-09-2020
* Автор  Кругликов В.П.
* 
* Изменения:
*    Добавлен прототип интерфейсной функции AnalogMeasurement_getMiddleValue. 
*/
