/**
* \file    ModeProtection.h
* \brief   Режим "ЗС"
* \details Интерфейс
*
* \version 1.0.2
* \date    03-06-2020
* \author  Агулов М.А.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef MODEPROTECTION_H
#define MODEPROTECTION_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************

//*****************************************************************************
#include <stdbool.h>

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Настройка передачи кода защитного отказа (используется в отладочном режиме).
///
void ModeProtection_ctor( void );

//*****************************************************************************
/// \brief Переход в защитное состояние.
/// \details При отключении периферии происходит запись в \a EEPROM кода ЗС.
/// \param codePS - код идентификации причины перехода в состояние ЗС.
///
void ModeProtection_run( uint16_t codePS );

//*****************************************************************************
/// \brief Переход в состояние бесконечного ожидания.
/// \details При отключении периферии происходит переход в пустой бесконечный цикл.
/// \param codePS - код идентификации причины перехода в состояние ЗО.
///
void ModeProtectiont_transmitToWait( uint16_t codePS );

//*****************************************************************************
/// \brief Пустой бесконечный цикл.
///
void ModeProtection_infinityLoop( void );

//*****************************************************************************
/// \brief Снятие состояния защитного отказа.
///
void ModeProtection_ClearPS( void );

#endif

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   26-08-2016
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*
* Версия 1.0.2
* Дата   03-06-2020
* Автор  Агулов М.А.
*
* Изменения:
*    Добавлены комментарии.
*/
