/**
* \file    CopySwap.c
* \brief   \copybrief CopySwap.h
*
* \version 1.0.1
* \date    29-03-2018
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>
#include "CopySwap.h"

//*****************************************************************************
// Копирование массива с заменой байт местами.
void copySwap( void *pDest, void *pSrc, uint16_t size )
{
    uint8_t *pOut = ( uint8_t * )pDest;
    uint8_t *pIn = ( uint8_t * )pSrc;
    uint8_t byte2 = 0;
    uint16_t i;

    for( i = 0; i < size; i++ )
    {
        if( ( i % 2 ) == 0 )
        {
            byte2 = pIn[i];
            pOut[i] = pIn[i + 1];
        }
        else
        {
            pOut[i] = byte2;
        }
    }
    if( ( size % 2 ) != 0 )
    {
        pOut[size - 1] = byte2;
    }
}

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Дата   29-03-2018
* Автор  Третьяков В.Ж.
* 
* Изменения:
*    Базовая версия.
*/
