/**
* \file    CopySwap.h
* \brief   Копирование массива с переменой байт
* \details Интерфейс
*
* \version 1.0.1
* \date    29-03-2018
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef CopySwap_h
#define CopySwap_h

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Копирование массива с переменой байт.
/// \param pDest - указатель на массив, куда будут скопированы данные \a aSrc;
/// \param pSrc  - указатель на массив исходных данных;
/// \param size  - размер копируемых данных в байтах.
/// \note При копировании меняется порядок байт:
///     - aDest[0] = aSrc[1]; 
///     - aDest[1] = aSrc[0]; 
///     - aDest[2] = aSrc[3]; 
///     - aDest[3] = aSrc[2] и т.д.
/// \note Если количество байт нечетно, то последний байт копируется без перемены байт.
///
void copySwap( void *pDest, void *pSrc, uint16_t size );

#endif

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   29-03-2018
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая редакция.
*/
