/**
* \file    wait.h
* \brief   Функции программных задержек
* \details Интерфейс
*
* \version 1.0.1
* \date    15-09-2016
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef WAIT_H
#define WAIT_H

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief Задержка на 1 мс.
/// \note Выполняется приблизительно 1 мс при отсутствии прерываний.
///
void wait1ms( void );

//*****************************************************************************
/// \brief Задержка на 125 мкс.
/// \note Выполняется приблизительно 125 мкс при отсутствии прерываний.
///
void wait125mks( void );

//*****************************************************************************
/// \brief Задержка на 62,5 мкс.
/// \note Выполняется приблизительно 62,5 мкс при отсутствии прерываний.
///
void wait62mks( void );

//*****************************************************************************
/// \brief Задержка на 1 мкс.
/// \note Выполняется приблизительно 1 мкс при отсутствии прерываний.
///
void wait1mks( void );

#endif

//*****************************************************************************
/**
* Пояснения:
*    Предназначены для работы при нулевой оптимизации 
*    для dsPIC33 с Fcy = 59.904 мГц (Tcy = 16.7 нс) 
*    Корректны для нулевого уровня оптимизации 
*/

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Дата   15-09-2016
* Автор  Третьяков В.Ж.
* 
* Изменения:
*    Базовая версия.
*/
