/**
* \file    wait.c
* \brief   \copybrief wait.h
*
* \version 2.0.1
* \date    18-04-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>
#include <libpic30.h>
#include "MainRegisters.h"
#include "wait.h"

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Задержка на 1 мс
void wait1ms( void )
{
    uint8_t i;
    for( i = 0; i < 8; i++ )
    {
        wait125mks( );
    }
}

//*****************************************************************************
// Задержка на 125 мкс
void wait125mks( void )
{
    wait62mks( );
    wait62mks( );
}

//*****************************************************************************
// Задержка на 62,5 мкс
void wait62mks( void )
{
    __delay32( ( ( Fcy / 10UL ) * 625UL ) / 1000000UL );
}

//*****************************************************************************
// Задержка на 1 мкс
void wait1mks( void )
{
    __delay32( Fcy / 1000000UL );
}

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   18-04-2016
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*
* Версия 2.0.1
* Дата   18-04-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Использования delay для обеспечения независимости от уровня оптимизации.
*/
